'use strict'
let backgrounds = [

//АРТИСТ
{
	background: "Артист",
	skills: [0, 5,],
	toolsPossession: [sets[6].name],
	specialty: ["Акробат", "Актор", "Жонглер", "Музикант", "Співак",
		"Пожирач вогню", "Поет", "Оповідач", "Танцюрист", "Шут", "Дресирувальник"],
	money: [0,0,0,15,0],
	featureOfCharacter:[
		"Для будь-якої ситуації я знайду підходящу розповідь.",
 		"Куди б я не прийшов, я починаю збирати місцеві чутки і поширювати плітки.",
 		"Я безнадійний романтик, завжди шукаю «когось особливого».",
 		"Ніхто не сердиться на мене або біля мене довго, так як я можу розрядити будь-яку напружену обстановку.",
 		"Мені подобаються образи, навіть якщо вони спрямовані на мене.",
 		"Мені прикро, якщо я не перебуваю в центрі уваги.",
 		"Над усе я ціную досконалість.",
 		"Мій настрій і наміри змінюються так само швидко як ноти в музиці."
 	],
	ideal: [
		["Краса. Виступаючи, я роблю світ краще.", [0,3,6]],
 		["Традиції. Розповіді, легенди і пісні минулого не повинні забуватися, так як вони вчать нас тому, хто ми такі. ", [0,1,2]],
 		["Творчість. Світу потрібні нові ідеї і сміливі дії.", [6,7,8]],
 		["Жадібність. Я займаюся всім цим заради грошей і слави.", [2,5,8]],
 		["Народ. Мені подобається бачити посмішки на обличчях під час виступу. У цьому-то вся справа.", [3,4,5]],
 		["Чесність. Мистецтво повинно відображати душу; воно повинно йти зсередини і показувати, чим ми є.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Мій інструмент - найдорожче, що у мене є, і він нагадує мені про мою любов.",
		"Хтось вкрав мій дорогоцінний інструмент, і коли-небудь я поверну його.",
		"Я хочу бути знаменитим, чого б це не коштувало.",
		"Я обожнюю героя старих оповідань, і завжди порівнюю свої вчинки з його.",
		"Я все зроблю, щоб довести перевагу над ненависним конкурентом.",
		"Я зроблю що завгодно для інших членів моєї старої трупи.",
	],
	weakness: [
		"Я піду на все заради слави і популярності.",
		"Не можу встояти перед гарненьким личком.",
		"Я не можу повернутися додому через скандал. Неприємності такого роду немов переслідують мене.",
		"Одного разу я висміяв дворянина, який все ще хоче відірвати мені голову. Це була помилка, але я можу повторити її ще неодноразово.",
		"Я не можу приховувати свої справжні почуття. Гострий язик завжди приносить мені неприємності.",
		"Я дуже стараюся виправитися, але друзям не варто на мене покладатися.",
	],
	features: [
	/*Назва:*/"На численні прохання",
	/*Опис:*/"Ви завжди можете знайти місце для виступу. Зазвичай це таверна або заїжджий двір, але це може бути цирк, " + 
	"театр або навіть двір знатного пана. У цьому місці ви отримуєте безкоштовну постіль і їжу за скромними або комфортними стандартами " + 
	"(в залежності від якості закладу), якщо ви виступаєте щовечора. Крім того, ваші виступи роблять вас місцевою знаменитістю. " + 
	"Коли сторонні впізнають вас в місті, в якому ви давали виступи, вони, швидше за все, будуть до вас ставитися добре."
	],

	starterItems () {
		pushCloneElement(player.items, 
			[{name:"Подарунок від прихильниці (Лист)"}, {name:"Подарунок від прихильниці (Щіпка волосся)"}, {name:"Подарунок від прихильниці (дрібничка)"}][randomInteger(0,2)],
			{name:"Костюм"},
			{name:"Поясний гаманець"}
		);
	},

	speciallyBackground(player) {
		//Уміння користуватись одним музикальним інструментом на вибір + сам інструмент
		let musInst = deepClone(musicItems);
		musInst = shuffle(musInst);
		for(let i = 0, j = 0; j < musInst.length && i < 1; j++ ) {
			if(contains(player.toolsPossession, musInst[j].name)) continue;
			pushCloneElement(player.items, musInst[j]);
			pushCloneElement(player.toolsPossession, musInst[j].name);
			i++
		}

	},
},

//Безпризорник
{
	background: "Безпризорник",
	skills: [8, 15,],
	toolsPossession: [scroungerTools[0].name, sets[6].name],
	specialty: [],
	money: [0,0,0,10,0],
	featureOfCharacter:[
		"У моїх кишенях повно брязкалець і недоїдків.",
 		"Я задаю дуже багато питань.",
 		"Я часто забиваюсь у вузькі закутки, де ніхто не зможе дістатися до мене.",
 		"Я завжди сплю, притулившись спиною до стіни або дерева, стискаючи вузлик з усіма своїми пожитками в руках.",
 		"Я не вихований, і їм як свиня.",
 		"Я переконаний, що всі, хто проявляють доброту до мене, насправді приховують злі наміри.",
 		"Я не люблю митися.",
  		"Я прямо говорю про те, на що інші воліють лише натякнути, або промовчати.",
 	],
	ideal: [
		["Повага. Всі люди, багаті вони, або бідні, гідні поваги.", [0,3,6]],
 		["Спільність. Ви повинні піклуватися один про одного, адже ніхто інший цього не зробить.", [0,1,2]],
 		["Зміни. Убогі піднесуться, а великі впадуть. Зміни в природі речей.", [6,7,8]],
 		["Відплата. Потрібно показати багатіям, чого варте життя і смерть в трущобах.", [2,5,8]],
 		["Люди. Я допомагаю тим, хто допомагає мені. Це дозволяє нам вижити.", [3,4,5]],
 		["Устремління. Я готовий довести, що гідний кращого життя.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Моє місто або село це мій будинок, і я буду захистити його.",
		"Я спонсорую притулок, щоб захистити інших від того, що довелося пережити мені.",
		"Я вижив лише завдяки іншому безпритульному, що передав мені знання, як поводитися на вулицях.",
		"Я в неоплатному боргу перед людиною, що зглянулася й допомогла мені.",
		"Я позбувся злиднів, пограбувавши важливу людину, і мене розшукують.",
		"Ніхто не повинен пережити ті труднощі, через які довелося пройти мені.",
	],
	weakness: [
		"Якщо я в меншості, то я втечу з битви.",
		"Золото в будь-якому вигляді виглядає для мене як велика купа грошей, і я зроблю все, щоб його у мене стало більше.",
		"Я ніколи не довіряю повністю кому б то не було, крім себе.",
		"Я вважатиму за краще вбити когось уві сні, ніж в чесному поєдинку.",
		"Це не крадіжка, якщо я взяв те, що потребую більше, ніж будь-хто інший.",
		"Ті, хто не можуть подбати про себе, отримають те, що заслужили.",
		"Ваше виховання в трущобах навчило вас важливим речам про виживання ціною елементарних речей, відомих іншим. На жаль, серед них виявилася і особиста гігієна.",
	],
	features: [
	/*Назва:*/"Міські таємниці",
	/*Опис:*/"Ви знаєте таємні лази і проходи міських вулиць, що дозволяють пройти там, де інші не побачать шляху. Поза бою ви (ваші союзники, що йдуть за вами) можете переміщатися по місту вдвічі швидше, ніж звичайно."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Маленький ніж"}, {name:"Карта міста (в якому ви виросли)"}, {name:"Ручна миша"},
			{name:"дрібничка в пам`ять про родину"}, {name:"Поясний гаманець"}, clothes[0], 
		);
	},

	speciallyBackground(player) {
	},
},

//БЛАГОРОДНИЙ
{
	background: "Благородний",
	skills: [7, 16,],
	toolsPossession: [],
	specialty: [],
	money: [0,0,0,25,0],
	featureOfCharacter:[
		"Я застосовую так багато лестощів, що всі, з ким я розмовляю, відчувають себе самими чудовими і важливими персонами в світі.",
 		"Місцеві люблять мене за доброту і великодушність.",
 		"Один лише погляд на мої регалії змушує перестати сумніватися в тому, що я вище немитого непотребу.",
 		"Я багато витрачаю на те, щоб виглядати приголомшливо, і за останнім словом моди.",
 		"Мені не подобається бруднити руки, і я не хочу померти в якомусь неналежному місці.",
 		"Незважаючи на благородне народження, я не ставлю себе вище народу. У всіх нас тече однакова кров.",
 		"Втративши мою милість, назад її НЕ повернеш.",
  		"Образиш мене, і я зітру тебе в порошок, знищу твоє ім'я, і спалю твої поля.",
 	],
	ideal: [
		["Повага. Повага - мій обов'язок. Ким би ти не був, до інших потрібно ставитися з повагою, незважаючи на їх походження.", [0,3,6]],
 		["Відповідальність. Я повинен поважати тих, хто вище мене, а ті, хто нижче мене, повинні поважати мене.", [0,1,2]],
 		["Незалежність. Я повинен довести, що впораюся і без турботи своєї сім'ї.", [6,7,8]],
 		["Влада. Якщо зберу багато влади, ніхто не посміє вказувати мені, що робити.", [2,5,8]],
 		["Сім'я. Справжня кров густіше.", [0,1,2,3,4,5,6,7,8]],
 		["Шляхетний борг. Я повинен захищати тих, хто нижче мене, і піклуватися про них.", [0,3,6]],
	],
	favor: [
		"Я піду на будь-який ризик, аби заслужити визнання сім'ї.",
		"Союз мого будинку з іншою благородною сім'єю потрібно підтримувати за будь-яку ціну.",
		"Немає нікого важливіше інших членів моєї сім'ї.",
		"Я закоханий в спадкоємицю сімейства, зневаженого моєю ріднею.",
		"Моя відданість правителю непохитна.",
		"Місцеві повинні вважати мене своїм героєм.",
	],
	weakness: [
		"Я потай вважаю всіх нижче себе.",
		"Я приховую ганебну таємницю, яка може знищити мою сім'ю.",
		"Я занадто часто чув завуальовані образи і погрози, і тому швидко впадаю в гнів.",
		"У мене невпинна пристрасть до плотських задоволень.",
		"Весь світ обертається навколо мене.",
		"Я часто накликали ганьбу на свою сім'ю словами і діями.",
	],
	features: [
	/*Назва:*/"Привілейованість",
	/*Опис:*/"Завдяки знатному походженню, інші добре до вас ставляться. Вас приймають у вищому світі, і вважається, що у вас є право відвідувати будь-які місця. Обивателі щосили намагаються зробити вам приємно і уникнути вашого гніву, а інші високородні вважають вас своєю рівнею. Якщо потрібно, ви можете отримати аудієнцію місцевого дворянина."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Гаманець"},
			{name:"сувій з генеалогічним древом"}, equipment[16], clothes[3], 
		);
	},

	speciallyBackground(player) {
		takeRandomObjects(player.toolsPossession, gameSet, 1);
		takeLanguage(player, languages, 1);
	},
},

//ГІЬДІЙСЬКИЙ РЕМЕСЛИНИК
{
	background: "Гільдійський ремісник",
	skills: [13, 16,],
	toolsPossession: [],
	specialty: ["Алхімік","Аптекар","Гончар","Майстер кераміки","Бляхар","Проволочник","Ливарник","Каліграф",
	"Писар","Нотаріус","Каменщик","Каменеріз","Картограф","Землемір","Промисловий дизайнер","Кожевник","Хутровик","Дубильника",
	"Коваль","Бронник","Металург","Майстер обробки металу","Пивовар","Винороб","Тесляр","Покрівельник","Штукатур","Кухар",
	"Пекар","Швець","Чоботар","Склодув","Скляр","Столяр","Бондар","Лучних справ майстер","Суднобудівник","Вітрильних справ майстер",
	"Стельмах","Колісних справ майстер","Ткач","Фарбувальник","Художник","Ілюстратор","Маляр","Ювелір","Огранщик"],
	money: [0,0,0,15,0],
	featureOfCharacter:[
		"Я вважаю, що все, що робиться, повинно робитися правильно. Нічого не можу з цим вдіяти - я перфекціоніст.",
 		"Я сноб, зверхньо дивлюся на тих, хто не може оцінити витончене мистецтво.",
 		"Мені завжди потрібно знати, як все навколо влаштовано, і як потрібно поводитися з іншими.",
 		"У мене багато дотепних афоризмів і є прислів'я на будь-який випадок.",
 		"Я грубий з тими, у кого немає моєї тяги до чесної і справедливому праці.",
 		"Про свою професію я можу говорити годинами.",
 		"Я не можу легко розлучатися з грошима, і можу скільки завгодно довго торгуватися.",
  		"Завдяки роботі я прославився, і хочу, щоб всі це цінували. Мене завжди вражає, коли інші говорять, що не чули про мене.",
 	],
	ideal: [
		["Спільнота. Всі цивілізовані народи зобов'язані зміцнювати співтовариство і забезпечувати безпеку цивілізації.", [0,1,2]],
 		["Великодушність. Талант був вручений мені, щоб я використовував його на благо всього світу.", [0,3,6]],
 		["Свобода. Всі повинні бути вільні, щоб жити так, як хочеться їм.", [6,7,8]],
 		["Жадібність. Я просто займаюся цим через гроші.", [2,5,8]],
 		["Народ. Я відданий своєму народові, а не ідеям.", [3,4,5]],
 		["Прагнення. Я старанно працюю над тим, щоб стати в своїй справі кращим.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Майстерня, де я навчався ремеслу, для мене - найважливіше місце в світі.",
		"Я створив для декого дивовижну роботу, але порахував його негідним. Я все ще шукаю того, хто виявиться гідний її.",
		"Я на все життя зобов'язаний гільдії за те, що вона зробила мене тим, хто я є.",
		"Багатство мені потрібно для завоювання серця коханої.",
		"Коли-небудь я повернуся в гільдію і доведу, що я кращий з усіх.",
		"Я мщу силам зла, які знищили мої торгові справи і зруйнували моє життя.",
	],
	weakness: [
		"Я зроблю все що завгодно, щоб отримати щось рідкісне або дуже цінне.",
		"Мені завжди здається, що мене намагаються обманути.",
		"Ніхто не повинен знати, що я одного разу вкрав гроші з казни гільдії.",
		"Мені завжди мало того, що у мене є - завжди потрібно більше.",
		"Я готовий вбити заради отримання благородного титулу.",
		"Я жахливо заздрю тим, хто може перевершити мою працю. Куди б я не пішов, мене оточують конкуренти.",
	],
	features: [
	/*Назва:*/"Членство в гільдії",
	/*Опис:*/"Будучи авторитетним і шанованим членом гільдії, ви можете користуватися особливими привілеями, наданими цим членством. Ваші товариші по гільдії при необхідності нададуть вам житло і харчування, і навіть оплатять ваші похорони. У деяких містах у гільдій є місце для збору, і там можна потенційно зустріти покровителів, союзників і найманців. "+
	"Гільдії часто володіють значною політичною владою. Якщо вас звинуватять у злочині, гільдія може допомогти, якщо існує імовірність виправдального вироку. Завдяки гільдії ви отримуєте доступ до впливових політиків, якщо перебуваєте в гільдії на хорошому рахунку. Для таких зв'язків може знадобитися жертвування грошей або магічних предметів в казну гільдії. " +
	"Щомісяця ви повинні виплачувати гільдії 5 зм. Якщо ви пропустите платіж, ви повинні спочатку сплатити всі борги, і тільки тоді відновите своє добре ім'я в гільдії."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Гаманець"},
			{name:"рекомендаційний лист з гільдії"}, {name:"Поясний гаманець"}, clothes[4], 
		);
	},

	speciallyBackground(player) {
		takeRandomObjects(player.toolsPossession, gameSet, 1);
		takeRandomObjects(player.toolsPossession, artisanTools, 1);
		takeLanguage(player, languages, 1);
	},
},

//МОРЯК
{
	background: "Моряк",
	skills: [2, 3,],
	toolsPossession: [scroungerTools[1].name, "Транспорт (Водяний)"],
	specialty: ["Боцман","Рульовий","Юнга","Кок","Матрос","Лоцман","Сигнальник","Штурман","Матрос","Матрос","Матрос"],
	money: [0,0,0,10,0],
	featureOfCharacter:[
		"Друзі знають, що завжди можуть на мене покластися.",
 		"Я старанно працюю, щоб потім можна було добре відпочити.",
 		"Мені подобається заходити в нові порти і знаходити друзів за кухлем елю.",
 		"Я готовий прибрехати, щоб вийшла гарна розповідь.",
 		"Для мене бійка в таверні - відмінний спосіб познайомитися з новим містом.",
 		"Я ніколи не відмовлюся від парі.",
 		"Я лаюся як банда орків.",
 		"Мені подобається, коли робота виконана, особливо якщо її можна доручити комусь іншому."
 	],
	ideal: [
		["Повага. Корабель тримається цілим завдяки взаємній пошані капітана і екіпажу.", [0,3,6]],
 		["Справедливість. Всі ми робимо одну справу, і нагороду повинні ділити порівну.", [0,1,2]],
 		["Свобода. Море це свобода - свобода йти куди завгодно і робити що завгодно.", [6,7,8]],
 		["Влада. Я хижак, а інші кораблі в морі - моя добича.", [2,5,8]],
 		["Команда. Я відданий екіпажу, а не ідеалам.", [3,4,5]],
 		["Прагнення. Коли-небудь у мене буде свій корабель, і я прокладу курс куди захочу.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"В першу чергу я вірний своєму капітанові, все інше вторинне.",
		"Найважливіше - це корабель, а екіпаж і капітани постійно змінюються.",
		"Я завжди буду пам'ятати свій перший корабель.",
		"В гавані у мене є кохана, очі якої варті того, щоб залишити заради неї море.",
		"Якось раз мені виплатили не повну частку з доходу, і я хочу повернути собі належне.",
		"Безжальні пірати вбили мого капітана і майже всю команду, розграбували корабель, і залишили мене вмирати. Помста буде страшною.",
	],
	weakness: [
		"Я виконую накази, навіть якщо вважаю, що вони несправедливі.",
		"Я наплету сім мішків гречаної вовни, аби не робити зайву роботу.",
		"Коли хтось кидає мені виклик, я ніколи не відступлюся, якою би небезпечною не була ситуація.",
		"Почавши пити, я не можу зупинитися.",
		"Не можу нічого вдіяти, але гроші у мене не затримуються.",
		"Моя гордість мене коли-небудь погубить.",
	],
	features: [
	/*Назва:*/"Поїздка на кораблі",
	/*Опис:*/"Якщо знадобиться, ви можете отримати безкоштовну поїздку на вітрильнику для себе і своїх супутників. Це може бути ваш старий корабель, або інший корабель, з яким ви перебуваєте в хороших відносинах (можливо, їм командує ваш колишній напарник). Вам надають послугу, тому ви не можете встановлювати розпорядок і прокладати маршрут. Майстер повідомить, скільки часу піде на плавання. В обмін на безкоштовну поїздку від вас і ваших супутників чекають посильну допомогу екіпажу під час плавання."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Кофель-нагель"}, equipment[4], {name:"Талісман (дрібничка)"}, clothes[0], {name:"Поясний гаманець"}
		);
	},

	speciallyBackground(player) {

	},
},

//мудрець
{
	background: "Мудрець",
	skills: [7, 9,],
	toolsPossession: [],
	specialty: ["Академік","Алхімік","Астроном","Бібліотекар","Дослідник","Писар","Підмайстер чарівника","Професор","Філософ"],
	money: [0,0,0,10,0],
	featureOfCharacter:[
		"Я використовую багатоскладні слова, що створюють враження освіченості.",
 		"Я прочитав всі книги в найбільших бібліотеках світу - або, принаймні, кажу так.",
 		"Я звик допомагати тим, хто не так розумний як я, і терпляче всім все пояснюю.",
 		"Найбільше на світі я люблю таємниці.",
 		"Перш ніж прийняти рішення, я вислухаю аргументи обох сторін спору.",
 		"Я ... кажу ... повільно ... коли розмовляю ... з ідіотами, ... тобто ... практично ... завжди.",
 		"У соціальній взаємодії я жахливо незграбний.",
 		"Я переконаний, що інші постійно хочуть вкрасти мої таємниці."
 	],
	ideal: [
		["Знання. Шлях до сили і самовдосконалення лежить в знаннях.", [3,4,5]],
 		["Краса. Краса веде нас до того, що істинно.", [0,3,6]],
 		["Логіка. Емоції не повинні пригнічувати логічне мислення.", [0,1,2]],
 		["Свобода. Ніщо не повинно стримувати нескінченні варіанти всіх можливих результатів.", [6,7,8]],
 		["Влада. Знання - шлях до влади і контролю.", [2,5,8]],
 		["Самовдосконалення. Мета життя в пізнанні - самовдосконалення.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Я повинен захищати своїх учнів.",
		"У мене є древній текст, що містить жахливу таємницю, і який не повинен потрапити в чужі руки.",
		"Я працюю над збереженням бібліотеки, університету, скрипторію або монастиря.",
		"Праця всього мого життя це серія томів, присвячена певній галузі знань.",
		"Все своє життя я шукаю відповідь на одне питання.",
		"Заради знань я продав душу. Коли-небудь я сподіваюся зробити велике діяння і повернути її собі.",
	],
	weakness: [
		"Мене легко відволікти, пообіцявши інформацію.",
		"Побачивши демона, більшість закричить і втече. Я ж зупинюся і буду вивчати його анатомію.",
		"Для розкриття древніх таємниць можна пожертвувати сучасною цивілізацією.",
		"Я уникаю очевидних рішень, користуючись хитромудрими.",
		"Я кажу, не обдумуючи слова, чим часто ображаю інших.",
		"Заради порятунку свого або чужого життя я розкрию будь-яку таємницю.",
	],
	features: [
	/*Назва:*/"Дослідник",
	/*Опис:*/"Якщо ви намагаєтеся вивчити або згадати інформацію, якою ви не володієте, ви часто знаєте, де і від кого її можна отримати. Зазвичай це бібліотека, скрипторій, університет, мудрець або інша істота. Майстер може вирішити, що шукане знання є таємницею і зберігається в практично недоступному місці, або що воно взагалі недоступно. Пошуки найглибших таємниць всесвіту можуть зажадати окремої пригоди або навіть цілої кампанії."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			equipment[44], equipment[28], {name:"Невеликикй ніж"},
			{name:"Лист від мертвого колеги з питанням (відповідь на нього ви не знаєте)"}, clothes[0],
			{name:"Поясний гаманець"}
		);

	},

	speciallyBackground(player) {
		takeLanguage(player, languages, 2);
	},
},

//Народний герой
{
	background: "Народний герой",
	skills: [4, 17,],
	toolsPossession: [],
	specialty: [],
	money: [0,0,0,10,0],
	featureOfCharacter:[
		"Я суджу інших за вчинками, а не словами.",
 		"Якщо хтось в біді, я завжди готовий прийти на допомогу.",
 		"Задумав щось, я прямолінійно йду до мети, незважаючи на перешкоди.",
 		"У мене загострене почуття справедливості, і в суперечці я завжди шукаю самого чесного рішення.",
 		"Я впевнений у своїх здібностях, і намагаюся вселити таку ж упевненість в інших.",
 		"Нехай думають інші. Я вважаю за краще діяти.",
 		"Я неправильно вимовляю довгі слова, коли намагаюся виглядати розумнішим.",
  		"Я швидко втомлююся. Коли вже я знайду свою долю?",
 	],
	ideal: [
		["Повага. Потрібно ставитися один до одного з гідністю і повагою.", [0,3,6]],
 		["Справедливість. Закон не повинен робити ні для кого винятків, і ніхто не може стати вище закону.", [0,1,2]],
 		["Свобода. Тирани не повинні пригнічувати народ.", [6,7,8]],
 		["Міць. Якщо я стану сильнішим, я зможу брати те, що захочу - і я це заслуговую.", [2,5,8]],
 		["Щирість. Немає нічого хорошого в тому, що ти прикидаєшся тим, ким не є.", [3,4,5]],
 		["Доля. Ніхто і ніщо не зіб'є мене з шляху до вищому покликанню.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"У мене є сім'я, але я не знаю, де вона. Сподіваюся, коли-небудь я побачу їх знову.",
		"Я працював на землі, я люблю землю, і я буду захищати землю.",
		"Один шляхетний мене дико побив, і я зганяв свій гнів на всіх зустрінутих задирах.",
		"Мої інструменти - символ мого колишнього життя, і я ношу їх, щоб не забувати коріння.",
		"Я захищаю тих, хто не може захистити себе сам.",
		"Хотів би я, щоб та, кого я любив в дитинстві, розділила зі мною долю.",
	],
	weakness: [
		"Тиран, правлячий моїми землями, ні перед чим не зупиниться, аби вбити мене.",
		"Я сліпо вірю в своє призначення, і не помічаю ні своїх недоліків, ні смертельних небезпек.",
		"Ті, хто знали мене молодим, знають і мою саму ганебну таємницю, так що я ніколи не повернуся додому.",
		"Я беззахисний перед вадами великого міста, особливо перед пияцтвом.",
		"Це не крадіжка, якщо я взяв те, що потребую більше, ніж будь-хто інший.",
		"Я таємно вважаю, що було б добре стати тираном, правлячим землями.",
		"Я не довіряю союзникам.",
	],
	features: [
	/*Назва:*/"Сільська гостинність",
	/*Опис:*/"Ви самі з простого народу, і тому легко знаходите з ними спільну мову. Ви можете знайти місце, щоб сховатися, відпочити або підлікуватися серед обивателів, якщо тільки ви не погрожуєте їм. Вони вкриють вас від представників закону і тих, хто шукає вас, але своїми життями за вас вони ризикувати не будуть."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Поясний гаманець"},
			containers[4], equipment[19], clothes[0], 
		);
	},

	speciallyBackground(player) {
		let musInst = deepClone(artisanTools);
		musInst = shuffle(musInst);
		for(let i = 0, j = 0; j < musInst.length && i < 1; j++ ) {
			if(contains(player.toolsPossession, musInst[j].name)) continue;
			pushCloneElement(player.items, musInst[j]);
			pushCloneElement(player.toolsPossession, musInst[j].name);
			i++
		}

		takeRandomObjects(player.toolsPossession, transport, 1);

	},
},

//Відлюдник
{
	background: "Відлюдник",
	skills: [10, 14,],
	toolsPossession: [sets[11].name],
	specialty: [],
	money: [0,0,0,5,0],
	featureOfCharacter:[
		"Я так багато прожив в ізоляції, що рідко говорю, вважаючи за краще жести і рідкісне мукання.",
 		"Я абсолютно спокійний, навіть в найжахливіших ситуаціях.",
 		"У лідера моєї громади були висловлювання для будь-якої ситуації, і я прагну поділитися цією мудрістю.",
 		"Я страшенно співпереживаю всім, хто страждає.",
 		"Мені не зрозумілі етикет і суспільні очікування.",
 		"Я пов'язую все, що відбувається зі мною, з грандіозним задумом космічного масштабу.",
 		"Я часто поринаю в свої думки, відволікаючись від оточення.",
  		"Я працюю над великою філософською теорією і люблю тих, хто розділяє мої ідеї.",
 	],
	ideal: [
		["Загальне благо. Мої дари призначені для всіх, я не повинен використовувати їх поодинці.", [0,3,6]],
 		["Логіка. Емоції не повинні затьмарювати наше бачення того, що істинно і справедливо, а також наше логічне мислення.", [0,1,2]],
 		["Вільнодумство. Вишукування і цікавість - стовпи прогресу.", [6,7,8]],
 		["Сила. Самота і споглядання - шлях до містичної і магічну силу.", [2,5,8]],
 		["Сам живи і іншим не заважай. Втручаючись у справи інших, завдаєш одні лише проблеми.", [3,4,5]],
 		["Самопізнання. Пізнаєш себе - пізнаєш все навколо.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Найважливіше для мене - це інші відлюдники, що жили поруч, або мій орден.",
		"Я усамітнився, щоб сховатися від тих, хто міг полювати за мною. Коли-небудь я сам кину їм виклик.",
		"Я все ще шукаю просвітлення, якого не досяг на самоті, але воно як і раніше вислизає від мене.",
		"Я усамітнився, тому що закохався в ту, з ким мені не судилося жити.",
		"Якщо моє одкровення збудеться, світ буде приречений на загибель.",
		"Моя ізоляція дозволила пізнати велике зло, знищити яке можу один лише я.",
	],
	weakness: [
		"Тепер, повернувшись в світ, я занадто сильно захоплююся його радощами.",
		"Я приховую темні, кровожерливі думки, які не пішли ні після ізоляції, ні після медитацій.",
		"Я категоричний в думках і підході до життя.",
		"Я дозволяю жадобі в суперечці ставати сильнішою дружби і гармонії.",
		"Я дуже сильно ризикую, прагнучи знайти втрачені частинки знань.",
		"Мені подобається зберігати таємниці, і я ними ні з ким не ділюся."
	],
	features: [
	/*Назва:*/"Одкровення",
	/*Опис:*/"Тихе усамітнення в доргому відлюдненні дало вам доступ до великого одкровення. Точна природа цього одкровення залежить від характеру вашого усамітнення. Це може бути істина про всесвіт, божествах, впливових створінь на зовнішніх планах, або силах природи. Це може бути місце, яке ніхто і ніколи не бачив. Ви могли виявити щось, що давно було забуто, або знайти реліквію минулого, здатну переписати історію. Це може бути інформація, яка може завдати шкоди тим, хто вигнав вас, і тим самим стала причиною повернення в суспільство. <br>Придумайте разом з Майстром деталі вашого одкровення і його вплив на кампанію."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Контейнер для свитків (повний ваших молитв)"}, {name:"Тепла ковдра"}, sets[11], clothes[0], 
		);
	},

	speciallyBackground(player) {
		takeLanguage(player, languages, 1);
	},
},

//Злочинець
{
	background: "Злочинець",
	skills: [11, 15,],
	toolsPossession: [scroungerTools[0].name],
	specialty: ["Зломщик","Здирник","Карманник","Контрабандист","Найманий вбивця","Скупник краденого","Шантажист"],
	money: [0,0,0,15,0],
	featureOfCharacter:[
		"У мене завжди є план на випадок, якщо все піде не так як задумано.",
 		"Я завжди холоднокровний, незважаючи ні на що. Я ніколи не підвищую голосу і не дозволяю емоціям управляти мною.",
 		"На новому місці я насамперед помічаю, де знаходяться різні цінності - або місця, де вони можуть бути заховані.",
 		"Я краще обзаведусь ще одним другом, ніж ще одним ворогом.",
 		"У мене проблеми з довірою. Ті, хто виглядають самими порядними, часто приховують безліч брудних секретів.",
 		"Мені наплювати на ризик. Ніколи не кажіть мені про можливі наслідки.",
 		"Найкращий спосіб змусити мене зробити щось - сказати мені цього не робити.",
  		"Я зриваюся навіть від найменшої образи.",
 	],
	ideal: [
		["Честь. Я не краду у своїх «колег»", [0,1,2]],
 		["Свобода. Будь-які кайдани повинні бути зламані, як і ті, хто їх викував.", [6,7,8]],
 		["Милосердя. Я краду у багатіїв, щоб допомогти людям у біді.", [3,0,6]],
 		["Жадібність. Я зроблю все що завгодно, лише б розбагатіти.", [2,5,8]],
 		["Друзі. Я вірний не якимось там ідеалам, а своїм друзям. А всі інші можуть котитися до біса.", [3,4,5]],
 		["Спокута. У кожному є щось хороше.", [3,0,6]],
	],
	favor: [
		"Я намагаюся оплатити старий борг одному щедрому благодійнику.",
		"Свої нечесно зароблені гроші я витрачаю на допомогу своїй сім'ї.",
		"У мене забрали щось важливе, і я маю намір викрасти це назад.",
		"Я буду найбільшим злодієм з усіх, які коли-небудь жили.",
	],
	weakness: [
		"Я винен в жахливому злочині. Сподіваюся, я зможу пробачити себе за це.",
		"Близька людина загинула через помилку, яку я зробив. Це не повториться знову.",
		"Коли я бачу щось цінне, я не можу думати ні про що інше, крім думок про те, як це вкрасти.",
		"Коли я стаю перед вибором між друзями і грошима, я зазвичай вибираю гроші.",
		"Якщо є якийсь план, я його напевно забуду. А якщо не забуду, то просто проігнорую.",
		"У мене є звичка, яка видає мене, коли я брешу.",
		"Я підтискаю хвіст і тікаю, коли все складається погано.",
		"Невинний чоловік перебуває у в'язниці через злочини, що я зробив. Мене це не турбує.",
	],
	features: [
	/*Назва:*/"Кримінальні зв'язки",
	/*Опис:*/"У вас є надійна довірена особа, яка виступає в ролі вашого зв'язкового в кримінальних колах. Ви вмієте отримувати і відправляти відомості зв'язного, навіть через великі відстані: наприклад, ви знаєте місцевих посильних, продажних караванників і нечистих на руку матросів, які можуть доставити повідомлення для вас."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Поясний гаманець"}, {name:"Комплект темної одежі з капішоном"}, equipment[18], 
		);
	},

	speciallyBackground(player) {
		takeRandomObjects(player.toolsPossession, gameSet, 1);
	},
},

//Прислужник
{
	background: "Прислужник",
	skills: [13, 14,],
	toolsPossession: [],
	specialty: [],
	money: [0,0,0,15,0],
	featureOfCharacter:[
		"Я ідеалізую конкретного героя своєї віри і постійно посилаюся на його вчинки і звершення.",
 		"Я можу знайти спільну позицію навіть у найзапекліших ворогів, співпереживаючи їм, і завжди прагнучи до примирення.",
 		"Я бачу знамення в кожній події і вчинку. Боги намагаються говорити з нами, потрібно лише прислухатися.",
 		"Ніщо не може похитнути мій оптимізм.",
 		"При будь оказії я цитую (або перебріхую) священні тексти і притчі.",
 		"Я терпимий до інших вірувань, і поважаю поклоніння іншим богам.",
 		"Я нетерпимий до інших вірувань, і поважаю засуджую поклоніння іншим богам.",
  		"Я люблю хорошу їжу, випивку і високе товариство представників свого храму. Життя далеко від цього мене дратує.",
   		"Я пробув у храмі занадто довго, і мені бракує досвіду взаємодії з людьми за його межами.",
 	],
	ideal: [
		["Традиції. Ми повинні зберегти і захистити стародавні традиції богослужіння і здійснення священних таїнств.", [0,1,2]],
 		["Милосердя. Незважаючи на витрачені зусилля, я завжди намагаюся допомогти тим, хто в нужді.", [0,3,6]],
 		["Зміни. Ми повинні допомагати привносити в світ зміни, які наші божества постійно жадають.", [6,7,8]],
 		["Влада. Я сподіваюся одного разу піднятися на саму вершину своєї релігійної ієрархії.", [0,1,2]],
 		["Віра. Я вірю, що моє божество направляє мене. І що старанна робота завжди буде винагороджена.", [0,1,2]],
 		["Прагнення. Я шукаю шанс довести, що я гідний благословення свого божества, здійснюючи діяння відповідно до його навчанням.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Я все зроблю, аби знайти древню реліквію своєї віри, що була втрачена давним давно.",
		"Одного разу я помщуся розбещеним представникам верховної ієрархії свого храму, що оголосили мене єретиком.",
		"Я зобов'язаний своїм життям священика, який подбав про мене, коли померли батьки.",
		"Все, що я роблю - для простих людей.",
		"Я піду на все що завгодно, щоб захистити свій храм.",
		"Я намагаюся зберегти священні тексти, які мої вороги вважають єретичними і намагаються знищити.",
	],
	weakness: [
		"Я не проявляю поблажливості до інших, але до себе я ще більш суворий.",
		"Я дуже довіряю тим, хто має владу в моїй церковної ієрархії.",
		"Моя побожність часто призводить до того, що я сліпо вірю всім, хто сповідує мою релігію.",
		"Я непохитний у своїх переконаннях.",
		"Я насторожено ставлюся до незнайомців і завжди чекаю від них гіршого.",
		"Одного разу вибравши мету, я стаю одержимим нею на шкоду всього іншого в своєму житті.",
	],
	features: [
	/*Назва:*/"Притулок для віруючих",
	/*Опис:*/"Ви і ваші супутники можете розраховувати на безкоштовне лікування і догляд в храмах, святинях і інших подібних місцях, присвячених вашій вірі. Вам доведеться надати матеріальні компоненти для заклинань, якщо такі знадобляться. Ті, хто розділяють вашу віру, можуть забезпечити вам (але тільки вам) скромне існування. "+
	"У вас також можуть бути зв'язки з якимось конкретним храмом, присвяченим вашому божеству або пантеону, в якому у вас є житлова кімната. Поки ви перебуваєте з цим храмом в хороших відносинах, перебуваючи неподалік від нього, ви можете попросити у його служителів допомоги, якщо вона не поставить їх під небезпеку.",
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			[{name:"молитовник"}, {name:"молитовний барабан"}][randomInteger(0,1)],
			{name:"облачення"}, equipment[18], clothes[0], {name:"Поясний гаманець"} 
		);
	},

	speciallyBackground(player) {
		//+ мова
		takeLanguage(player, languages, 2);
		
		//священий символ
		pushCloneElementWithEdit(player.items, [magicFocus[0],  magicFocus[5], magicFocus[7]][randomInteger(0,2)] ,"(священий символ)");

		//палички пахощів
		pushCountedItemNumber(player.items, {name:"Паличка пахощів"}, 5);
	},
},

//Солдат
{
	background: "Солдат",
	skills: [2, 6,],
	toolsPossession: ["Транспорт (Сухопутний)"],
	specialty: ["Офіцер","Розвідник","Піхотинець","Кавалерист","Лікар","Інтендант","Прапороносець","Обслуговуючий персонал","Диверсант"],
	money: [0,0,0,10,0],
	featureOfCharacter:[
		"Я завжди ввічливий і шанобливий.",
 		"Мене терзають спогади про війну. Не можу забути те насильство, що мені довелося побачити.",
 		"Я втратив багато друзів, і тепер насилу заводжу нових.",
 		"У мене багато надихаючих і застережних оповідань з військового минулого, придатних практично до будь-якої бойової ситуації.",
 		"Я можу дивитися прямо на пекельну гончу, не відводячи очей.",
 		"Мені подобається бути сильним і трощити речі.",
 		"У мене грубе почуття гумору.",
  		"Я вирішую проблеми прямолінійно. Просте рішення - найкращий шлях до успіху.",
 	],
	ideal: [
		["Вища благо. Наш жереб - віддати свої життя заради інших.", [0,1,2]],
 		["Відповідальність. Я роблю що повинен, і підкоряюся вищестоячим.", [0,1,2]],
 		["Незалежність. Якщо сліпо слідувати наказам, потрапляєш під п'яту тиранії.", [7,8,6]],
 		["Міць. У житті і війні перемагає найсильніший.", [2,5,8]],
 		["Живи і не заважай іншим. Ідеали не варті того, щоб заради них вбивати або воювати.", [3,4,5]],
 		["Нація. Моє місто, нація і народ - ось що найголовніше.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Я як і раніше готовий віддати своє життя за тих, кому поклявся служити.",
		"Дехто врятував мені життя на полі бою. З тих пір я ніколи не залишаю друзів, що залишилися в бою.",
		"Моя честь - моє життя.",
		"Ніколи не забуду нищівної поразки, якої зазнав наш загін",
		"Ніколи не забуду ворога, через якого наш загін отримав нищівної поразки.",
		"Ті, хто борються поруч зі мною, гідні того, щоб за них померти.",
		"Я борюся за тих, хто не може це зробити сам.",
	],
	weakness: [
		"Одне чудовисько, з яким ми колись воювали, до сих пір змушує мене тремтіти від страху.",
		"Я мало поважаю тих, хто не довів, що є гідним воїном.",
		"В одній битві я зробив жахливу помилку, що коштувала життя багатьом - і я зроблю що завгодно, лише б це залишалося в таємниці.",
		"Лють до ворогів засліплює мене і робить безрозсудним.",
		"Я підкоряюся закону, навіть якщо закон викликає страждання.",
		"Я скоріше з'їм свій обладунок, ніж зізнаюся, що був неправий.",
	],
	features: [
	/*Назва:*/"Військове звання",
	/*Опис:*/"Будучи солдатом, ви заслужили звання. Солдати, вірні військової організації, якій ви раніше належали, все ще визнають вашу владу і вплив, і вони підкоряються вам, якщо їх звання нижче вашого. За допомогою свого звання ви можете впливати на інших солдатів і брати в тимчасове користування просте спорядження або коней. Можливо, вас пропустять всередину військового табору або фортеці, якщо до вашого звання поставляться з повагою."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			{name:"Поясний гаманець"}, {name:"Відзнака"}, 
			[{name:"Трофей з убитого ворога (кинджал)"},{name:"Трофей з убитого ворога (зламаний меч)"},{name:"Трофей з убитого ворога (шматок прапора)"}][randomInteger(0,2)],
			[{name:"Набор ігрових кубиків"},{name:"Колода карт"}][randomInteger(0,1)],
			clothes[0]
		);
	},

	speciallyBackground(player) {
		takeRandomObjects(player.toolsPossession, gameSet, 1);
	},
},

//Чужинець
{
	background: "Чужинець",
	skills: [2, 4,],
	toolsPossession: [],
	specialty: ["Лісник","Траппер","Поселенець","Провідник","Вигнанець","Мисливець за головами","Пілігрим","Кочівник","Мисливець","Мародер"],
	money: [0,0,0,10,0],
	featureOfCharacter:[
		"Мною керує жага пригод, яка і забрала мене з дому.",
 		"Я стежу за друзями, як якщо б вони були сліпими кошенятами.",
 		"Одного разу я пробіг 40 кілометрів без зупинки, щоб попередити свій клан про наближення орди орків. Якщо знадобиться, я повторю це.",
 		"Для будь-якої ситуації у мене є уроки, витягнуті з спостережень за природою.",
 		"Я не розумію багатих і вихованих. Гроші і хороші манери не врятують тебе від голодного вовка.",
 		"Я весь час щось беру в руки, кручу і іноді ламаю.",
 		"Я набагато комфортніше почуваюся серед звірів, ніж серед людей.",
  		"Мене дійсно виростили вовки.",
 	],
	ideal: [
		["Зміни. Життя як пори року, постійно змінюється, і ми повинні мінятися разом з ним.", [6,7,8]],
 		["Процвітання. Кожен повинен робити так, щоб все плем'я було щасливо.", [0,3,6]],
 		["Честь. Якщо я забезпечу себе, я забезпечу весь свій клан.", [0,1,2]],
 		["Міць. Найсильніша має право наказувати.", [2,5,8]],
 		["Природа. Світ природи набагато важливіше будівель цивілізації.", [3,4,5]],
 		["Слава. Я повинен завойовувати славу в боях, для себе і свого клану.", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Моя сім'я, клан і плем'я - найважливіші речі в моєму житті, навіть коли вони далеко від мене.",
		"Осквернення дикої місцевості на моїй батьківщині я вважаю особистою образою.",
		"Я зжену свій жахливий гнів на лиходіїв, які знищили мої землі.",
		"Я останній зі свого племені, і повинен зробити так, щоб наші імена увійшли в легенди.",
		"Мені являються страшні бачення майбутньої катастрофи, і я зроблю все, щоб їй запобігти.",
		"Я повинен створювати нових дітей, які будуть підтримувати моє плем'я.",
	],
	weakness: [
		"Я занадто пристарсний до елю, вина і інших спиртних напоїв.",
		"В житті на повну котушку немає місця обережності.",
		"Я пам'ятаю всі отримані образи і таю злобу на всіх кривдників.",
		"Я насилу довіряю представникам інших рас, племен і спільнот.",
		"На будь-які негаразди я майже завжди відповідаю насильством.",
		"Не думайте, що я буду рятувати тих, хто не може сам про себе подбати. Сильні повинні процвітати, а слабкі гинуть, і це нормально.",
	],
	features: [
	/*Назва:*/"Мандрівник",
	/*Опис:*/"Ви відмінно запам'ятовуєте карти і місцевість, і завжди можете згадати загальні характеристики місцевості, поселення, і інші особливості в околицях. Крім того, ви кожен день можете знаходити їжу і прісну воду для себе і п'яти інших товаришів, за умови, що навколо вас можна знайти ягоди, дичину, воду і так далі."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			magicFocus[4], {name:"Капкан"}, {name:"трофей з вбитої тварини"},
			{name:"Комплект одягу мандрівника"}, {name:"Поясний гаманець"} 
		);
	},

	speciallyBackground(player) {
		takeRandomObjects(player.toolsPossession, musicItems, 1);
		takeLanguage(player, languages, 1);
	},
},

//Шарлатан
{
	background: "Шарлатан",
	skills: [8, 11,],
	toolsPossession: [sets[6].name, sets[7].name],
	specialty: [],
	money: [0,0,0,15,0],
	featureOfCharacter:[
		"Я легко починаю і розривають стосунки, і постійно перебуваю в пошуку нової пасії.",
 		"У мене припасені жарти на всі випадки життя, особливо на ті, де гумор взагалі недоречний.",
 		"Лестощі - мій улюблений спосіб домогтися бажаного.",
 		"Я природжений гравець, і не можу втриматися від ризику, якщо на кону стоїть щось вартісне.",
 		"Я постійно брешу, часто навіть без найменшої на те причини.",
 		"Сарказм і образи - мої улюблені прийоми.",
 		"Я ношу з собою різні святі символи, і кличу тих божеств, що краще підходять для кожного конкретного випадку.",
  		"Я тягну в кишеню все, що погано лежить і має хоч якусь цінність.",
 	],
	ideal: [
		["Незалежність. У мене волелюбна натура - ніхто не сміє вказувати мені, що робити.", [6,7,8]],
 		["Чесність. Я ніколи не виберу своєю жертвою людей, які знаходяться в тяжкому становищі.", [0,1,2]],
 		["Милосердя. Я розподіляю здобуті гроші між людьми, які в них дійсно потребують.", [0,3,6]],
 		["Креативність. Я ніколи не йду второваною доріжкою.", [6,7,8]],
 		["Дружба. Матеріальні блага приходять і йдуть, а друзі залишаються.", [0,3,6]],
 		["Прагнення. Я збираюся стати кимось значущим в цьому житті", [0,1,2,3,4,5,6,7,8]],
	],
	favor: [
		"Я перейшов доріжку не тій людині, і повинен постійно піклуватися про те, щоб мені і моїм близьким не нашкодили.",
		"Я всім зобов'язаний своєму наставнику - жахливій людині, який, цілком імовірно, гниє зараз в який-небудь в'язниці.",
		"Десь живе моя дитина, яка не знає про мене. І для неї я намагаюся зробити цей світ кращим.",
		"Я син шляхетного роду, і коли-небудь заберу свої землі і титул у тих, хто їх вкрав.",
		"Впливовий ворог вбив дорогу мені людину. І одного разу я помщуся.",
		"Я пустив по світу людину, яка того не заслуговувала. Я прагну спокутувати свою провину, але швидше за все ніколи себе не прощу.",
	],
	weakness: [
		"Я не можу встояти перед гарненькою мордочкою.",
		"Я постійно в боргах. Я витрачаю свої нечесно нажиті гроші швидше, ніж їх здобуваю.",
		"Я переконаний в тому, що ніхто не зможе обдурити мене так, як я обдурюють інших.",
		"Я дуже жадібний до золота. І не можу противитися ризику, якщо в цьому замішані гроші.",
		"Я не можу встояти і не обдурити людей, що стоять набагато вище, ніж я.",
		"Я ненавиджу себе за це, але я втечу, щоб врятувати свою власну шкуру, якщо раптом запахне смаженим.",
	],
	features: [
	/*Назва:*/"Підроблена особистість",
	/*Опис:*/"Ви створили собі другу особу, включаючи необхідні документи, знайомства і маскування, що дозволяє вам перевтілюватися в цей образ. На додаток до цього ви можете підробляти документи, включаючи офіційні документи і особисті листи, якщо раніше бачили приклад подібного документа або почерк, який намагаєтеся скопіювати."
	],

	starterItems (player) {
		pushCloneElement(player.items, 
			sets[6], clothes[3], {name:"Поясний гаманець"}, 
		);
	},

	speciallyBackground(player) {
		let items = shuffle([{name:"Бутель з підфарбованою рідиною x10"},{name:"Набір шулерських кубиків"},{name:"Колода мічаних карт"},{name:"Кільце з печаткою уявного герцога"}]);
		pushCloneElement(player.items, items.shift());
		pushCloneElement(player.items, items.shift());
	},
},

];