'use strict'
var classes = [
	
	//БАРД
	{
		class: "Бард",
		hitDice: [1, 8],

		armorPossession: ["легкі обладунки"],
		armorPossessionTypes:["Легкий"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "довгі мечі", "короткі мечі", "рапіри", "ручні арбалети"],
		weaponPossessionTypes:["Просте"],
		weaponPossessionItems:[weapon[22].name, weapon[14].name, weapon[32].name, weapon[2].name],
		
		tools:[],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/1, 
			/*Тіл:*/0, 
			/*Інт:*/0, 
			/*Мудр:*/0, 
			/*Хар:*/1
		],

		skills: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
		skillsNum: 3, 

		features: [
			/*Назва:*/"Натхнення Барда (к6)",
			/*Опис:*/"Своїми словами або музикою ви можете надихати інших. Для цього ви повинні бонусною дією вибрати одну істоту, відмінну від вас," + 
			" в межах 60 футів, яка може вас чути. Ця істота отримує кістку бардівського натхнення - к6. Протягом наступних 10 хвилин ця істота може один " +
			"раз кинути цю кістку і додати результат до свого кидка. Додавати можна до перевірки характеристики, атаки або спаскидку. Істота може прийняти" + 
			" рішення про кидок кістки натхнення вже після кидка К20, але має зробити це перш ніж Майстер оголосить результат кидка. Як тільки кістка бардівського" + 
			" натхнення кинута, вона зникає. Істота може мати тільки одну таку кістку одночасно. Кількість того, скільки разів ви можете використати це уміння, рівна " + 
			"модифікатору вашої Харизми, але як мінімум один раз. Витрачені використання цього вміння відновлюються після тривалого відпочинку. Ваша кістка бардівського натхнення" + 
			" змінюється з ростом вашого рівня в цьому класі. Вона стає К8 на 5 рівні, к10 на 10 рівні і к12 на 15 рівні.",
			/*Назва:*/"Використання заклинань",
			/*Опис:*/"Ви навчилися змінювати тканину реальності відповідно вашої волі і музики. Ваші заклинання є частиною вашого великого репертуару; це магія, якій ви знайдете " +
			" застосування в будь-якій ситуації."+
			"<br><b><i>Відомі заклинання першого і більш високих рівнів.</b></i> Ви знаєте чотири заклинання 1 зі списку доступних барду. " +
			"Колонка «відомі заклинання» показує, коли ви зможете вивчити нові заклинання. Рівень заклинань не повинен перевищувати рівень найвищої наявної у вас клітинки заклинань. Крім того, коли ви отримуєте рівень в цьому класі, ви можете вибрати одне з відомих вам заклинань чаклуна і замінити його іншим заклинанням зі списку заклинань чаклуна, з рівнем, що не перевищує рівень осередків заклинань."+
			"<br><b><i>Виконання ритуалів.</b></i> Ви можете виконати будь-яке відоме вам заклинання барда як ритуал, якщо заклинання дозволяє це. " +
			"<br><b><i>Фокусування заклинання.</b></i> Ви можете використовувати ваш музичний інструмент в якості фокусування для ваших заклинань барда.",
			],

		spellcastClass: "Бард",
		baseSpellChar:5,
		complotNum: 2,
		complotList: [2, 1, 4, 5, 9, 10, 14, 15, 16, 19, 25],
		allSpells: 4,
		availableSpells: 2,
		spellList: [1, 5, 8, 12, 15, 16, 18, 19, 21, 25, 26, 29, 31, 32, 35, 37, 40, 41, 46, 52, 57, 48, 43],

		itemsVariant(player) {
			let itemsVariant = [];

			itemsVariant.push(	[
				new namedFunction("Рапіра", () => 
					pushCloneElement(player.weapons, weapon[32]) ),
				new namedFunction("Довгий меч", () => 
					pushCloneElement(player.weapons, weapon[14]) ),
				new namedFunction("Проста зброя", () => 
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір дипломата", () => pushCloneElement(player.items, sets[5]) ),
				new namedFunction("Набір артиста", () => pushCloneElement(player.items, sets[3]) ),
			]);

			return itemsVariant;
		},

		starterItems(player) {
			pushCloneElement(player.weapons, weapon[18]);
			pushCloneElement(player.armor, armor[1]);
		},


		speciallyClass(player) {
			//генерує володіння муз інструментами і видає один муз інструмент
			let musInst = deepClone(musicItems);
			musInst = shuffle(musInst);
			for(let i = 0, j = 0; j < musInst.length && i < 3; j++ ) {
				if(contains(player.toolsPossession, musInst[j].name)) continue;
				if(i == 0) pushCloneElement(player.items, musInst[0]);
				pushCloneElement(player.toolsPossession, musInst[j].name);
				i++
			}
		},
	},

	//ВАРВАР
	{
		class: "Варвар",
		hitDice: [1, 12],

		armorPossession: ["Легкі обладнуки", "середні обладунки", "щити"],
		armorPossessionTypes:["Легкий","Середній", "Щит"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "військова зброя"],
		weaponPossessionTypes:["Просте", "Військове"],
		weaponPossessionItems:[],

		tools: [],
		
		saveDice: [
			/*Сил:*/1, 
			/*Лов:*/0, 
			/*Тіл:*/1, 
			/*Інт:*/0, 
			/*Мудр:*/0, 
			/*Хар:*/0
		],

		features: [
			/*Назва:*/"Захист без обладунку",
			/*Опис:*/"Якщо ви не носите обладунок, ваш КД дорівнює 10 + модифікатор Спритності + модифікатор Статури."+
			"Ви можете використовувати щит, не втрачаючи цієї переваги.",
			/*Назва:*/"Лють",
			/*Опис:*/"У бою ви воюєте з первісної лютістю. У свій хід ви можете бонусною дією увійти в стан люті. У стані люті ви отримуєте наступні переваги, якщо не носите важку броню:<br>" +
			"• Ви робите з перевагою перевірки і спаскидки Сили.<br>" +
			"• Якщо ви робите рукопашну атаку зброєю, використовуючи Силу, ви отримуєте бонус до кидка урону +2.<br>" +
			"• Ви отримуєте опір до дробного, колющого та рубаного урону.<br>" +
      "Якщо ви були здатні використовувати заклинання, то ви не можете використовувати або концентруватися на заклинаннях, поки перебуваєте в стані люті. <br>" +
			"Ваша лють триває 1 хвилину. Вона припиняється раніше: <br>" +
			"• якщо ви втратили свідомість, <br>" +
			"• якщо ви закінчили хід, чи не атакував ворожу по відношенню до вас істоту з моменту закінчення минулого ходу,<br>" +
			"• якщо ви з моменту закінчення минулого ходу не отримали урон. <br>" +
			"Також ви можете припинити свою лють бонусною дією. <br>" +
			"Якщо ви впадали в стан люті 2 рази, то ви повинні зробити тривалий відпочинок, перш ніж зможете використовувати лють ще раз.",
			],

		skills: [2, 3, 4, 6, 12, 17],
		skillsNum: 2, 

		spellcastClass: "",
		baseSpellChar:-1,
		complotNum: 0,
		complotList: [],
		allSpells: 0,
		availableSpells: 0,
		spellList: [],

		itemsVariant(player) {
			let itemsVariant = [];
			let functionForSearch = (el) =>  el.category[0] == "Військове" && el.category[1] == "Рукопашне";

			itemsVariant.push(	[
				new namedFunction("Топір", () => 
					pushCloneElement(player.weapons, weapon[38]) ),
				new namedFunction("Військ. рук. зброя", () => 
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, functionForSearch))),
			]);

			itemsVariant.push(	[
				new namedFunction("Дві ручні сокири", () => {
					pushCloneElement(player.weapons, weapon[33]);
					pushCloneElement(player.weapons, weapon[33])
					}),
				new namedFunction("Проста зброя", () => 
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			return itemsVariant;
		},

		starterItems(player) {
			pushCloneElement(player.items, sets[9]);
			pushCountedItemNumber(player.weapons, weapon[24], 4);
		},

		speciallyClass(player) {
			player.KD[0] = 10 + player.modifierStats[2] + player.modifierStats[1];
		}
	},

	//ВОЇН
	{
		class: "Воїн",
		hitDice: [1, 10],

		armorPossession: ["всі види обладунків", "щити"],
		armorPossessionTypes:["Легкий","Середній", "Важкий", "Щит"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "військова зброя"],
		weaponPossessionTypes:["Просте", "Військове"],
		weaponPossessionItems:[],

		tools: [],
		
		saveDice: [
			/*Сил:*/1, 
			/*Лов:*/0, 
			/*Тіл:*/1, 
			/*Інт:*/0, 
			/*Мудр:*/0, 
			/*Хар:*/0
		],

		features: [
			/*Назва:*/"Друге дихання",
			/*Опис:*/"Ви володієте обмеженим джерелом витривалості, яким можете скористатися, щоб уберегти себе. У свій хід ви можете бонусною дією відновити хіти в розмірі 1к10 + ваш рівень воїна." +
		"Використавши це вміння, ви повинні завершити короткий або тривалий відпочинок, щоб отримати можливість використовувати його знову.",
		],

		skills: [0, 2, 3, 4, 6, 7, 13, 17],
		skillsNum: 2, 

		spellcastClass: "",
		baseSpellChar:-1,
		complotNum: 0,
		complotList: [],
		allSpells: 0,
		availableSpells: 0,
		spellList: [],

		itemsVariant(player) {
			let itemsVariant = [];
			let functionToGetItems = () => {
				pushCountedItemNumber(player.ammo, ammo[4], 20);
				pushCloneElement(player.armor, armor[1]);
				pushCloneElement(player.weapons, weapon[13]);

			}

			itemsVariant.push(	[
				new namedFunction("Кольчуга", () => 
					pushCloneElement(player.armor, armor[3]) ),
				new namedFunction("Шкіряний обл., лук", () => functionToGetItems()),
			]);

			itemsVariant.push(	[
				new namedFunction("Дві військові зброї", () => {
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Військове"));
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Військове"));
					}),
				new namedFunction("Військова зброя і щит", () => {
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Військове"));
					pushCloneElement(player.shield, shield[0]);
					}),
			]);

			itemsVariant.push(	[
				new namedFunction("Дві ручні сокири", () => {
					pushCloneElement(player.weapons, weapon[33]);
					pushCloneElement(player.weapons, weapon[33])
					}),
				new namedFunction("Арбалет і болти", () => {
					pushCloneElement(player.weapons, weapon[1]);
					pushCountedItemNumber(player.ammo, ammo[0], 20);
					}),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір дослідника підземель", () => {
					pushCloneElement(player.items, sets[8]);
					}),
				new namedFunction("Набір мандрівника", () => {
					pushCloneElement(player.items, sets[9]);
					}),
			]);

			return itemsVariant;
		},

		starterItems (player) {},

		speciallyClass(player) {
			let str = "";
			let rnd = randomInteger(0,10);

			switch(rnd) {
				case 0: player.featuresList.push("Дуелянт"); str+= "Поки ви тримаєте рукопашну зброю в одній руці і не використовуєте в іншу зброю, ви отримуєте бонус +2 до кидкам урону цією зброєю."; break;
				case 1: player.featuresList.push("Захист"); str+=" Якщо істота, яку ви бачите, атакує не вас, а іншу істоту, що знаходиться в межах 5 футів від вас, ви можете Реакцією створити перешкоду його кидку атаки. Для цього ви повинні використовувати щит."; break;
				case 2:	player.featuresList.push("Оборона"); str+=" Поки ви носите обладунки, ви отримуєте бонус +1 до КД."; 
				player.KD[1] += 1;
				break;
				case 3:	player.featuresList.push("Бій великою зброєю"); str+=" Якщо у вас випало «1» або «2» на кістках урону зброї при атаці, яку ви робили рукопашною зброєю, утримуючи її двома руками, то ви можете перекинути цю кістку, і повинні використовувати новий результат, навіть якщо знову випало «1» або «2». Щоб ви могли скористатися цією перевагою, ваша зброя повинна мати властивість «Дворучне» або «Універсальне»."; break;
				case 4:	player.featuresList.push("Бій двома мечами"); str+=" Якщо ви воюєте зброєю в кількості двох штук, ви можете додати модифікатор характеристики до урону від другої атаки."; break;
				case 5:	player.featuresList.push("Стрільба"); str+=" Ви отримуєте бонус +2 до кидка атаки, коли атакуєте далекобійною зброєю."; break;
				case 6:	player.featuresList.push("Бій наосліп"); str+=" Ви отримуєте сліпий зір в радіусі 10 футів. Ви відчуваєте істот, які не перебувають за повним укриттям і не заховані від вас, навіть якщо ви в темряві або засліплені."; break;
				case 7:	player.featuresList.push("Перехоплення"); str+=" Коли істота, яку ви бачите, атакує іншу істоту в 5 футів від вас, Реакцією ви можете зменшити урон на 1к10 + ваш бонус майстерності. У вас в руках повинен бути щит або зброя."; break;
				case 8: player.featuresList.push("Бій метальною зброєю"); str+=" Частиною атаки метальною зброєю ви можете дістати його з піхов. Ваші атаки метальною зброєю отримують +2 додаткового урону."; break;
				case 9:	player.featuresList.push("Беззбройна атака"); str+=" Ваша беззбройна атака завдає урон 1к6 + модіффікатор Сили. Якщо на вас не надітий щит і зброя, то урон беззбройної атаки дорівнює 1к8 + модіффікатор Сили. На початку кожного ходу ви наносите шкоду 1К4 дробного урону істоті, що знаходиться в вашому захопленні."; break;
				
				case 10: player.featuresList.push("Чудова техніка");  str+= " У вас є бойовий прийом на ваш вибір зі списку архетипу воїна \"майстер бойових мистецтв\". Якщо прийом вимагає, щоб ціль зробила спаскидок для опору ефекту прийому, то Сл спасуидка дорівнює 8 + ваш бонус майстерності +" +
				" ваш модифікатор Сили або Спритності (за вашим вибором). Ви отримуєте одну кістку переваги: к6. Ця кістка додається до інших кісток переваги, отриманим вами з інших джерел. Ця кістка використовується для ваших прийомів і витрачається при використанні. Ви відновлюєте всі свої витрачені кістки переваги після закінчення короткого або тривалого відпочинку.<br>"; 
				str += "<b><i>Прийом: "
				rnd = randomInteger(0, 22);
				switch(rnd) {
					case 0: str+="Активне ухилення. </b></i>При переміщенні ви можете витратити одну кістку переваги, зробити кидок і додати значення до КД, поки не припините переміщення."; break;
					case 1: str+="Атака з випадом. </b></i>Якщо ви в свій хід робите рукопашну атаку зброєю, ви можете витратити одну кістку переваги, щоб збільшити досяжність цієї атаки на 5 футів. У разі потрапляння ви додаєте кістку переваги до кидка урону цій атаки."; break;
					case 2: str+="Атака з маневром.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб один з ваших товаришів зміг переміститися в більш вигідне становище. Ви додаєте кістка переваги до кидка урону цій атаки і вибираєте дружнє істоту, яка може бачити або чути вас. Ця істота може реакцією переміститися на відстань до половини своєї швидкості, не провокуючи при цьому атаки від цілі вашої атаки."; break;
					case 3: str+="Атака з загрозою.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб спробувати налякати ціль. Ви додаєте кістку переваги до кидка урону цієї атаки, а ціль повинна зробити спаскдок Мудрості. При провалі ціль перелякана вами до кінця вашого наступного ходу."; break;
					case 4: str+="Атака з фінтом.</b></i> Ви можете в свій хід витратити одну кістку переваги і бонусним дією зробити фінт, вибравши в якості мети одна істота в межах 5 футів. Наступний кидок атаки по цій істоті ви робите з перевагою. Якщо атака потрапляє, додайте кістку переваги до кидка урону цій атаки. Обидва переваги пропадають, якщо ви не використовуєте їх в тому ж ходу, в якому отримали їх."; break;
					case 5: str+="Швидкий кидок.</b></i> Ви можете витратити кістку переваги і Бонусну дію, щоб атакувати метальною зброєю. Ви зможете дістати зброю, частиною дії атаки і додати значення кістки переваги до урону цією атакою."; break;
					case 6: str+="Засада.</b></i> Ви можете додати кістку переваги до перевірки скритності або кидка Ініціативи."; break;
					case 7: str+="Командирська присутність.</b></i> Ви можете додати кістку переваги до перевірок Залякування, Виконання або Переконання."; break;
					case 8: str+="Обеззброююча атака.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб спробувати обеззброїти противника, змушуючи його скинути один предмет за вашим вибором, який він тримає. Ви додаєте кістку переваги до кидка урону атаки, а ціль повинна зробити спаскидок Сили. У разі провалу вона скидує обраний вами предмет. Предмет падає біля її ніг."; break;
					case 9: str+="Перекидаюча атака.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб спробувати збити мета з ніг. Ви додаєте кістка переваги до кидка урону атаки, і, якщо розмір цілі Великий або менше, вона повинна зробити спасбросок Сили. У разі провалу ви збиваєте ціль з ніг."; break;
					case 10: str+="Удар у відповідь.</b></i> Якщо істота промахується по вам рукопашною атакою, ви можете реакцією витратити одну кістку переваги, щоб зробити рукопашну атаку зброєю по цій істоті. Якщо ви потрапляєте, ви додаєте кістку переваги до кидка урону цій атаці."; break;
					case 11: str+="Відволікаючий удар.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб відволікти істоту, відкриваючи її для ваших союзників. Ви додаєте кістку переваги до кидка урону цій атаці. Наступний кидок атаки по цій цілі будь-якої істоти, крім вас, відбувається з перевагою, якщо атака відбувається до початку вашого наступного ходу."; break;
					case 12: str+="Парирування.</b></i> Якщо інша істота заподіює вам урону рукопашною атакою, ви можете Реакцією витратити одну кістку переваги, щоб зменшити урон на величину, рівну кидку вашої кістки переваги + ваш модифікатор Спритності."; break;
					case 13: str+="Провокуюча атака.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб спробувати спровокувати противника атакувати вас. Ви додаєте кістку переваги до кидка урону цій атаці, а ціль повинна зробити спаскидок Мудрості. При провалі ціль до кінця вашого наступного ходу робить з перешкодою кидки атаки по всіх цілях, крім вас."; break;
					case 14: str+="Рокіровка.</b></i> Ви можете витратити кістку переваги і помінятись місцями з істотою в межах 5 футів. Ви витрачаєте 5 футів пересування, а ціль повинна бути дієздатна і згодна. Це переміщення не провокує Атак по можливості і до початку вашого наступного ходу ви або заміняєма істота отримуєте бонус до КД в розмірі випав на кістки числа."; break;
					case 15: str+="Сполучення.</b></i> Ви можете в свій хід бонусною дією витратити одну кістку переваги, щоб підтримати рішучість одного з ваших спутників. Якщо ви це зробите, виберіть дружню істоту, яке може бачити або чути вас. Ця істота отримує тимчасові хіти, рівні кидку кістки переваги + ваш модифікатор Харизми."; break;
					case 16: str+="Тактичний аналіз.</b></i> Ви можете додати кістку переваги до перевірок Історії, Проникливості або Аналізу."; break;
					case 17: str+="Штовхаюча атака.</b></i> Якщо ви потрапляєте по істоті атакою зброєю, ви можете витратити одну кістку переваги, щоб спробувати відштовхнути ціль. Ви додаєте кістку переваги до кидка урону атаки, і, якщо розмір цілі Великий або менше, вона повинна зробити спаскидок Сили. При провалі ви штовхаєте ціль на відстань до 15 футів від себе."; break;
					case 18: str+="Точна атака.</b></i> Якщо ви робите кидок атаки зброєю по істоті, ви можете витратити одну кістку переваги, щоб додати її до кидка. Ви можете використовувати цей прийом до або після здійснення кидка атаки, але до застосування ефектів атаки."; break;
					case 19: str+="Удар командувача.</b></i> Якщо ви робите в свій хід дію атаки, ви можете відмовитися від однієї з ваших атак і бонусною дією направити удар одного з ваших соратників. Якщо ви це зробите, виберіть дружню істоту, яка може бачити або чути вас і потратьте одну кістку переваги. Ця істота може негайно зробити Реакцією одну атаку зброєю, додавши кістку переваги до кидка урону цій атаці."; break;
					case 20: str+="Удар з захопленням.</b></i> Бонусною дією ви можете витратити кістку переваги, відразу після того, як потрапили по цілі атакою ближнього бою, щоб спробувати взяти її в захват. Результат кістки переваги додається до вашої перевірки Сили (Атлетика)."; break;
					case 21: str+="Зміцнення.</b></i> Коли істота входить в радіус досяжності вашої зброї ближнього бою, ви можете Реакцією витратити кістку переваги, щоб зробити по ній Атаку, при цьому ви можете додати значення, що випало на кістці переваги до урону цієї атаки."; break;
					case 22: str+="Широка атака.</b></i> Якщо ви потрапляєте по істоті атакою рукопашною зброєю, ви можете витратити одну кістку переваги, щоб спробувати завдати урон іншій істоті цією ж атакою. Виберіть іншу істоту в межах 5 футів від первісної цілі і в межах вашої досяжності. Якщо кидок атаки потрапляє по другій цілі, вона отримує урон, рівний кидку кістки переваги. Втрати того ж виду, що й для вихідної атаки."; break;
				}	
				break;
			}

			player.featuresList.push(str); 
		}
	},

	//Чарівник
	{
		class: "Чарівник",
		hitDice: [1, 6],

		armorPossession: [],
		armorPossessionTypes:[],
		armorPossessionItems:[],

		weaponPossession: ["кинжали", "дротики", "пращі", "ручні арбалети", "бойові посохи", "легкі арбалети"],
		weaponPossessionTypes:[],
		weaponPossessionItems:[weapon[18].name, weapon[15].name, weapon[31].name, weapon[6].name, weapon[1].name],
		
		tools:[],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/0, 
			/*Тіл:*/0, 
			/*Інт:*/1, 
			/*Мудр:*/1, 
			/*Хар:*/0
		],

		skills: [1, 7, 9, 10, 13, 14],
		skillsNum: 2, 

		features: [
			/*Назва:*/"Магічне відновлення",
			/*Опис:*/"Ви знаєте як відновлювати частину магічної енергії, вивчаючи книгу заклинань. Один раз в день, коли ви закінчуєте короткий відпочинок, ви можете відновити частину використаних клітинок заклинань. Клітинки заклинань можуть мати сумарний рівень, який не перевищує половину рівня вашого чарівника (округляючи в більшу сторону), і жодна з клітинок не може бути шостого рівня або вище. " +
	  "Наприклад, якщо ви чарівник 4 рівня, ви можете відновити клітинки заклинань з сумою рівнів не більше двох. Ви можете відновити одну клітинку заклинань 2 рівня, або дві клітинки заклинань 1 рівня.",
			/*Назва:*/"Використання заклинань",
			/*Опис:*/"Будучи учнем таємниць магії, ви володієте книгою, що містить заклинання, що показує перші проблиски вашої справжньої сили." +
			"<br><b><i>Копіювання заклинання в книгу.</b></i> Якщо ви знаходите заклинання чарівника 1 або більш високого рівня, ви можете додати його в свою книгу заклинань, якщо воно має такий рівень, заклинання якого ви можете готувати, і у вас є вільний час для його розшифровки і копіювання." +
			"Копіювання заклинання в вашу книгу включає відтворення основної форми заклинання, а також розшифровку унікальної системи позначень, використовуваної чарівником, який записав його. Ви повинні підібрати потрібні жести і звуки, після чого записуєте його в свою книгу заклинань, використовуючи власні позначення." +
			"За кожен рівень заклинання процес займає 2 години і коштує 50 золотих монет. Вартістю є матеріальні компоненти, які ви витрачаєте на експерименти з заклинанням, щоб їм опанувати, а також високоякісне чорнило для запису тексту. Після того як ви витратили час і гроші, ви можете готувати це заклинання як і свої інші заклинання."+
			"<br><b><i>Заміна книги.</b></i> Ви можете копіювати заклинання зі своєї книги заклинань в іншу, наприклад, якщо хочете зробити резервну копію. Це робиться так само як і просте копіювання заклинань, але швидше і простіше, так як ви розумієте свої власні позначення і вже знаєте, як творити це заклинання. Вам необхідно витратити тільки по 10 золотих монет і 1 годині для кожного рівня копійованого заклинання."+
			"Якщо ви втратили свою книгу заклинань, ви можете використовувати ту ж процедуру для запису заклинань, які у вас підготовлені, в нову книгу заклинань. Для заповнення решти книги заклинань потрібно знайти нові заклинання, щоб повернути все як раніше. З цієї причини багато чарівники тримають запасні книги заклинань в безпечному місці." +
			"<br><b><i>Зовнішній вигляд книги.</b></i> Ваша книга заклинань є унікальною збіркою заклинань, зі своїми декоративними завитками і ремарками. Це може бути звичайна, обтягнута шкірою книга, яку ви отримали в подарунок від наставника, або обплетений золотом том, який ви знайшли в стародавній бібліотеці, або навіть розрізнена колекція записів, зібрана разом після втрати попередньої книги заклинань в результаті нещасного випадку. "+
			"<br><b><i>Підготовка і створення заклинань.</b></i> Ви готуєте список заклинань чарівника, доступних для створення. При цьому ви вибираєте число заклинань чарівника зі своєї книги заклинань, рівне модифікатору Інтелекту + рівень чарівника (мінімум одне заклинання). Рівень заклинань не повинен перевищувати рівень найвищої наявної у вас клітинки заклинань. " +
			"Наприклад, якщо ви чарівник 3 рівня, то у вас є чотири клітинки заклинань 1 рівня та дві клітинки 2 рівня. При модифікатору Інтелекту +3 ваш список підготовлених заклинань може включати в себе шість заклинань 1 або 2 рівня, в будь-якій комбінації, вибраних з вашої книги заклинань. Якщо ви підготували заклинання 1 рівня чарівна стріла, ви можете створити його, використовуючи клітинку 1 рівня або елемент 2 рівня. Створене заклинання не видаляє його зі списку підготовлених заклинань." +
			" Ви можете змінити список підготовлених заклинань, коли завершуєте тривалий відпочинок. Підготовка нового списку заклинань чарівника вимагає часу, проведеного в вивченні книги заклинань і запам'ятовуванні слів і жестів, які ви повинні зробити, щоб створити заклинання: не менше 1 хвилини за рівень заклинання для кожного заклинання у вашому списку." +
	  "<br><b><i>Ритуальне чаклунство.</b></i> Ви можете створити заклинання чарівника як ритуал, якщо у цього заклинані є ключове слово «ритуал», і воно є у вашій книзі заклинань. Вам не потрібно мати це заклинання підготовленим.",
		],

		spellcastClass: "Чарівник",
		baseSpellChar:3,
		complotNum: 3,
		complotList: [0,1,2,4,7,8,9,10,13,14,15,16,19,25,27,28],
		allSpells: 6,
		availableSpells: 2,
		spellList: [1, 4, 5, 6, 14, 16, 17, 20, 21, 24, 26, 29, 30, 32, 35, 37, 39, 40, 42, 44, 45, 48, 50, 51, 52, 54, 55, 57, 58, 60],

		itemsVariant(player) {
			let itemsVariant = [];
			let functionToGetItems = () => {
				pushCountedItemNumber(player.ammo, ammo[4], 20);
				pushCloneElement(player.armor, armor[1]);
				pushCloneElement(player.weapons, weapon[13]);
			}

			itemsVariant.push(	[
				new namedFunction("Бойовий посох", () => pushCloneElement(player.weapons, weapon[6]) ),
				new namedFunction("Кинжал", () => pushCloneElement(player.weapons, weapon[18])),
			]);

			itemsVariant.push(	[
				new namedFunction("Мішечок з компонентами", () => pushCloneElement(player.items, containers[12])),
				new namedFunction("Магічне фокусування", () => pushCloneElement(player.items, magicFocus[randomInteger(0,magicFocus.length-1)])),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір вченого", () => {
					pushCloneElement(player.items, sets[12]);
					}),
				new namedFunction("Набір мандрівника", () => {
					pushCloneElement(player.items, sets[9]);
					}),
			]);

			return itemsVariant;
		},


		starterItems (player) {
			pushCloneElement(player.items, equipment[14]);
		},

		speciallyClass(player) {},
	},

	//Друїд
	{
		class: "Друїд",
		hitDice: [1, 8],

		armorPossession: ["легкі обладунки", "середні обладунки", "щити", "(друїди не носять обладунки і щити з металу)" ],
		armorPossessionTypes:["Легкий","Середній", "Щит"],
		armorPossessionItems:[],

		weaponPossession: ["бойові посохи", "булави", "дротики", "дубинки", "кинжали", "списи", "метальні списи", "пращі", "серпи", "скімітари"],
		weaponPossessionTypes:[],
		weaponPossessionItems:[weapon[6].name, weapon[8].name, weapon[15].name, weapon[16].name, weapon[18].name, weapon[20].name, weapon[24].name, weapon[31].name, weapon[34].name, weapon[39].name],
		
		tools:[sets[11].name],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/0, 
			/*Тіл:*/0, 
			/*Інт:*/1, 
			/*Мудр:*/1, 
			/*Хар:*/0
		],

		skills: [3, 4, 9, 10, 17, 12, 13, 14],
		skillsNum: 2, 

		features: [
			/*Назва:*/"Друїдична мова",
			/*Опис:*/"Ви знаєте друїдичну мову - таємну мову друїдів. Ви можете на ній говорити і залишати таємні послання. Ви і всі, хто знають цю мову, автоматично помічаєте ці послання. Інші зауважують присутність послання при успішній перевірці Мудрості (Уважність) зі Сл 15, але без допомоги магії не можуть розшифрувати його.",
			/*Назва:*/"Використання заклинань",
			/*Опис:*/"Для створення заклинань друїди користуються сакральною есенцією самої природи, встановлюючи в неї свою волю. " +
			"<br>Будучи учнем таємницею магії, ви володієте книгою, що містить заклинання, що показує перші проблиски вашої справжньої сили. " +
			"<br><b><i>Підготовка і створення заклинань.</b></i> Ви готуєте список заклинань друїда, доступних для створення. При цьому ви вибираєте число заклинань друїда зі списку заклинань друїда, рівне модифікатору Мудрості + рівень друїда (мінімум одне заклинання). Рівень заклинань не повинен перевищувати рівень найвищої наявної у вас клітинки заклинань. " +
			"Наприклад, якщо ви друїд 3 рівня, то у вас є чотири клітинки заклинань 1 рівня та дві клітинки 2 рівня. При Мудрості 16 ваш список підготовлених заклинань може включати в себе шість заклинань 1 або 2 рівня, в будь-якій комбінації. Якщо ви підготували заклинання 1 рівня лікування ран, ви можете створити його, використовуючи клітинку 1 рівня або елемент 2 рівня. Створене заклинання не видаляє його зі списку підготовлених заклинань." +
			"Ви можете змінити список підготовлених заклинань, коли завершуєте тривалий відпочинок. Підготовка нового списку заклинань друїда вимагає часу, проведеного в молитвах і медитації: не менше 1 хвилини за рівень заклинання для кожного заклинання у вашому списку. " +
			"<br><b><i>Священні рослини.</b></i> Деякі рослини вважаються священними у друїдів. Зокрема, це береза, бузина, дуб, верба, ялівець, вільха, омела, горіх, падуб (він же гостролист), горобина, тис і ясен. Ці рослини часто використовуються у виготовленні фокусування друїдів, яке може включати, наприклад, гілки дуба або тиса, пагони омели. " +
			"<br><b><i>Ритуальне чаклунство.</b></i> Ви можете створити заклинання друїда як ритуал, якщо у цього заклинання є ключове слово «ритуал», і воно підготовлене вами." +
			"<br><b><i>Фокусування заклинання.</b></i> Ви можете використовувати фокусування друїдів як фокусування для заклинань друїда.",
		],

		spellcastClass: "Друїд",
		baseSpellChar:4,
		complotNum: 2,
		complotList: [3, 6, 15, 20, 21, 22, 23, 28, 8],
		allSpells: 0,
		availableSpells: 2,
		spellList: [5, 15, 18, 19, 27, 29, 31, 33, 35, 36, 44, 46, 52, 55, 59, 53, 28],

		itemsVariant(player) {
			let itemsVariant = [];
			let functionForSearch = (el) =>  el.category[0] == "Просте" && el.category[1] == "Рукопашне";

			itemsVariant.push(	[
				new namedFunction("Дерев`яний щит", () => pushCloneElement(player.shield, shield[0]) ),
				new namedFunction("Проста зброя", () => pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			itemsVariant.push(	[
				new namedFunction("Скімітар", () => pushCloneElement(player.weapons, weapon[39])),
				new namedFunction("Проста рук. зброя", () => pushCloneElement(player.weapons,takeFromListOfAvilableItem(weapon, functionForSearch))),
			]);

			return itemsVariant;
		},

		starterItems (player) {
			//Річ 3
			pushCloneElement(player.items, sets[9]);
			pushCloneElement(player.armor, armor[1]);
			pushCloneElement(player.items, druidFocus[randomInteger(0,3)]);
		},


		speciallyClass(player) {
		},
	},

	//ЖРЕЦЬ
	{
		class: "Жрець",
		hitDice: [1, 8],

		armorPossession: ["легкі обладунки", "середні обладунки", "щити"],
		armorPossessionTypes:["Легкий","Середній", "Щит"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя"],
		weaponPossessionTypes:["Просте"],
		weaponPossessionItems:[],
		
		tools:[],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/0, 
			/*Тіл:*/0, 
			/*Інт:*/0, 
			/*Мудр:*/1, 
			/*Хар:*/1
		],

		skills: [7, 10, 13, 14, 16],
		skillsNum: 2, 

		features: [
			/*Назва:*/"Використання заклинань",
			/*Опис:*/"Будучи провідником божественної сили, ви можете творити заклинання жерця. " +
			"<br><b><i>Підготовка і створення заклинань.</b></i> Ви готуєте список заклинань жреця, доступних для створення. При цьому ви вибираєте число заклинань жреця, рівне модифікатору Мудрості + рівень жреця (мінімум одне заклинання). Рівень заклинань не повинен перевищувати рівень найвищої наявної у вас клітинки заклинань. " +
			"Наприклад, якщо ви жрець 3 рівня, то у вас є чотири клітинки заклинань 1 рівня та дві клітинки 2 рівня. При Мудрості 16 ваш список підготовлених заклинань може включати в себе шість заклинань 1 або 2 рівня, в будь-якій комбінації. Якщо ви підготували заклинання 1 рівня лікування ран, ви можете створити його, використовуючи клітинку 1 рівня або елемент 2 рівня. Створене заклинання не видаляє його зі списку підготовлених заклинань." +
			"Ви можете змінити список підготовлених заклинань, коли завершуєте тривалий відпочинок. Підготовка нового списку заклинань друїда вимагає часу, проведеного в молитвах і медитації: не менше 1 хвилини за рівень заклинання для кожного заклинання у вашому списку. " +
			"<br><b><i>Ритуальне чаклунство.</b></i> Ви можете створити заклинання жреця як ритуал, якщо у цього заклинання є ключове слово «ритуал», і воно підготовлене вами." +
			"<br><b><i>Фокусування заклинання.</b></i> Ви можете використовувати священі символи як фокусування для заклинань жреця.",
			],

		spellcastClass: "Жрець",
		baseSpellChar:4,
		complotNum: 3,
		complotList: [15, 16, 17, 20, 23, 24, 26],
		allSpells: 0,
		availableSpells: 2,
		spellList: [],

		itemsVariant(player) {
			let itemsVariant = [];

			itemsVariant.push(	[
				new namedFunction("Булава", () => pushCloneElement(player.weapons, weapon[8]) ),
				new namedFunction("Бойовий молот", () => pushCloneElement(player.weapons, weapon[5])),
			]);

			itemsVariant.push(	[
				new namedFunction("Лускатий обладунок", () => pushCloneElement(player.armor, armor[9])),
				new namedFunction("Шкіряний обладунок", () => pushCloneElement(player.armor, armor[1])),
				new namedFunction("Кольчуга", () =>  pushCloneElement(player.armor, armor[3])),
			]);

			itemsVariant.push(	[
				new namedFunction("Легкий арбалет, болти", () => {
					pushCloneElement(player.weapons, weapon[1]);
					pushCountedItemNumber(player.ammo, ammo[0], 20);
					}),
				new namedFunction("Проста зброя", () => pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір священика", () => pushCloneElement(player.items, sets[10])),
				new namedFunction("Набір мандрівника", () => pushCloneElement(player.items,  sets[9])),
			]);

			return itemsVariant;
		},

		starterItems(player) {
			pushCloneElement(player.shield, shield[0]);
			pushCloneElementWithEdit(player.items, [magicFocus[0],  magicFocus[5], magicFocus[7]][randomInteger(0,2)] ,"(священий символ)");
		},


		speciallyClass(player) {
			//ДОМЕН
				let item = deepClone(artisanTools);
				item = shuffle(item);
				for(let i = 0, j = 0; j < item.length && i < 1; j++ ) {
					if(contains(player.toolsPossession, item[j].name)) continue;
					pushCloneElement(player.toolsPossession, item[j].name);
					i++
				}
			let str = "<b><i>Ваш домен: ";
			switch(randomInteger(0,7)) {
				case 0: 
					str += "Домен Бурі. </b></i>";
					str += "Боги, чиї портфоліо включають домен бурі - в тому числі Талос, Амберлі, Корд, Зебоім, Поглинач, Зевс і Тор - правлять бурями, морями і небесами. Серед них боги грому і блискавок, боги землетрусів, деякі боги вогню та насильства, фізичної сили і безстрашності. У деяких пантеонах боги цього домену правлять іншими божествами, і відомі швидким судом, що закінчується ударом блискавки. У пантеонах мореплавців боги цього домену є божествами океану і покровителями моряків. Боги бурі відправляють своїх жерців вселяти страх простим смертним, або наставляти людей на праведний шлях, або змушують їх приносити жертви, щоб уникнути божественного гніву.";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: хвиля грому, туманна хмара<br>"+
							"Рівень 3: друзки, порив вітру<br>"+
							"Рівень 5: заметіль, заклик блискавки<br>"+
							"Рівень 7: владу над водами, град<br>"+
							"Рівень 9: нашестя комах, руйнівна хвиля";
	 				if(!contains( player.spells, 55)) player.spells.push(55);
	 				if(!contains( player.spells, 5))player.spells.push(5);
	 				if(!player.weaponPossessionTypes.includes("Військове")) {
	 					player.weaponPossessionTypes.push("Військове");
	 				 	player.armorAndWaponPossession.push("військова зброя"); 
	 				}
	 				if(!player.armorPossessionTypes.includes("Важкий")){
	 				 	player.armorPossessionTypes.push("Важкий");
	 				 	player.armorAndWaponPossession.push("важкі обладунки");
	 				}
	 				player.featuresList.push("Гнів бурі");
	 				player.featuresList.push("Ви можете гучно покарати нападників. Якщо істота в межах 5 футів від вас, яку ви можете бачити, успішно потрапляє по вам атакою, ви можете реакцією змусити істоту зробити спаскидок Спритності. "+
					"Істота отримує урон звуком або електрикою (за вашим вибором) 2к8, якщо провалить спаскидок, і половину цієї шкоди якщо досягне успіху. Ви можете використовувати це вміння кількість разів, рівне вашому модифікатору Мудрості (мінімум 1 раз). " +
					"Ви відновлюєте всі витрачені застосування, коли завершуєте тривалий відпочинок.");
	 				break;
	 			case 1: 
					str += "Домен Війни. </b></i>";
					str += "Війна має багато проявів. Вона може зробити героїв зі звичайних людей. Вона може бути відчайдушною і жахливою, з проявами жорстокості і боягузтва, переважаючими приклади майстерності і безстрашності. У будь-якому випадку, боги війни стежать за воїнами і винагороджують за великі звершення. " +
					"Жерці таких богів відрізняються в битві, надихаючи інших битися або закликаючи до насильства в своїх молитвах. Серед богів війни є чемпіони честі і лицарства (такі як Торм, Хіронеус і Кірі-Джолі), а також боги руйнування і мародерства (такі як Ерітнул, Лють, Груумш і Арес) і боги завоювань і підкорення (такі як Бейн, Хекстор і Маглубіет ). " +
					"Інші боги війни (такі як Темпус, Ніка і Нуада) займають більш нейтральну позицію, сприяючи війні у всіх її проявах і підтримуючи воїнів в будь-яких обставинах.";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: божественне благовоління, щит віри<br>"+
							"Рівень 3: божественне зброю, магічне зброю<br>"+
							"Рівень 5: духовні варти, мантія хрестоносця<br>"+
							"Рівень 7: кам'яна шкіра, свобода переміщення<br>"+
							"Рівень 9: небесний вогонь, утримання чудовиська";
	 				if(!contains( player.spells, 3))player.spells.push(3);
	 				if(!contains( player.spells, 61))player.spells.push(61);
	 				if(!player.weaponPossessionTypes.includes("Військове")) {
	 					player.weaponPossessionTypes.push("Військове");
	 				 	player.armorAndWaponPossession.push("військова зброя"); 
	 				}
	 				if(!player.armorPossessionTypes.includes("Важкий")){
	 				 	player.armorPossessionTypes.push("Важкий");
	 				 	player.armorAndWaponPossession.push("важкі обладунки");
	 				}
	 				player.featuresList.push("Бойовий священик");
	 				player.featuresList.push("Ваш бог наділяє вас натхненням, коли ви вступаєте в битву. Коли ви використовуєте дію Атака, ви можете зробити одну атаку зброєю бонусною дією. Ви можете використовувати це вміння кількість разів, рівне вашому модифікатору Мудрості (мінімум 1 раз). " +
					"Ви відновлюєте всі витрачені використання, коли завершуєте тривалий відпочинок.");
	 				break;
	  			case 2: 
					str += "Домен життя. </b></i>";
					str += "Домен життя зосереджений на тремтливій позитивній енергії - однієї з фундаментальних сил всесвіту, яка підтримує життя. Боги життя сприяють життєздатності і здоров'ю, зцілюючи хворих і поранених, піклуючись про нужденних, і відганяючи нежить і сили смерті. " +
					"Майже будь-яке не зле божество може претендувати на вплив в цьому домені, особливо божества землеробства (такі як Чонтіа, Араван і Деметра), боги сонця (такі як Латандер, Пелор і Ра-Хорахті), боги зцілення і витривалості (такі як Ільматер, Мішакаль , Аполлон і Діан Кехт) і боги домашнього вогнища і громад (такі як Гестія, хаорі і Болдрі).";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: благословення, лікування ран<br>"+
							"Рівень 3: божественна зброю, мале відновлення<br>"+
							"Рівень 5: відродження, маяк надії<br>"+
							"Рівень 7: захист від смерті, страж віри<br>"+
							"Рівень 9: множинне лікування ран, оживлення";
	 				if(!contains( player.spells, 2))player.spells.push(2);
	 				if(!contains( player.spells, 19))player.spells.push(19);
	 				if(!player.armorPossessionTypes.includes("Важкий")){
	 				 	player.armorPossessionTypes.push("Важкий");
	 				 	player.armorAndWaponPossession.push("важкі обладунки");
	 				}
	 				player.featuresList.push("Проборник життя");
	 				player.featuresList.push("Ваші лікуючі заклинання стають більш ефективними. Кожен раз, коли ви використовуєте заклинання 1 рівня або вище, відновлююче хіти створіння, ця істота відновлює додатково число хітів, рівне 2 + рівень заклинання.");
	 				break;
	 			case 3: 
					str += "Домен Знань. </b></i>";
					str += "Боги знань - в тому чіслі Огма, Боккоб, Гілеан, Ауреон і Той - цінують освіченість і розуміння перш за все. Деякі вчать збирати знання і робити їх доступними в бібліотеках та університетах, або розвивати практичні знання ремесел і винаходів. " +
					"Деякі божества збирають знання і зберігають їх в таємниці для себе. А деякі обіцяють своїм послідовникам, що вони отримають величезну владу, якщо розкриють таємниці мультивсесвіту. "+
					"Послідовники цих богів вивчають езотеричні знання, збирають старі фоліанти, досліджують таємні куточки землі, і вивчають все, що зможуть. Деякі боги розвивають практичні знання ремесла і винаходи, в тому числі боги-ковалі Гонд, Реоркс, Онатар, Морадін, Гефест і Гоібніу."
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: впізнання, наказ<br>"+
							"Рівень 3: навіювання, ворожіння<br>"+
							"Рівень 5: невиявність, розмова з мертвими<br>"+
							"Рівень 7: магічне око, сум'яття<br>"+
							"Рівень 9: знання легенд, спостереження";
	 				if(!contains( player.spells, 32))player.spells.push(32);
	 				if(!contains( player.spells, 43))player.spells.push(43);
	 				player.featuresList.push("Благословення знань");
			
					let skillsVariants = ["Акробатики","Аналізу", "Атлетики", "Уважності", "Виживання", "Виступу", "Залякування", "Історії",  
					"Спритності рук", "Магії", "Медицини", "Обману", "Природи", "Проникливості","Релігії", "Скритності", "Переконання", "Догляду за тваринами"];
					let takedSkills = []; 
					
					let skills = [7,9,12,14];
					skills = shuffle(skills);

					let counter = 0
					for(let j = 0; j < skills.length && counter < 2; j++ ) {
						let bool = tryAddNewSkill(player, skills[j]);
						if(bool) {

							takedSkills.push(skills[j]);
							skills.splice(j,1);
							j--; counter++;
						}
					}
					for(let i = 0; i < 2-counter; i++) {
						takedSkills.push(skills[i]);
					}

	 				player.featuresList.push("Ваш бонус майстерності подвоюється для перевірок характеристик при використанні цих навичок: " + skillsVariants[takedSkills[0]] + " і " + skillsVariants[takedSkills[1]]);
		
					takeLanguage(player, languages, 2);

	 				break;
				case 4: 
					str += "Домен Обману. </b></i>";
					str += "Боги обману, такі як Лешті, Бешаба, Олідаммара, Страник, Гарлем, Златоблеск і Локі - інтригани і підбурювачі, які постійно кидають виклик прийнятому порядку серед богів і смертних. Це покровителі злодіїв, негідників, азартних гравців, бунтівників і визволителів. "+
					"Їхні жерці представляють руйнівні сили світу, що пронизують гордість, що висміюють тиранів, що крадуть у багатих, які звільняють полонених і зневажають безглузді традиції. Прямому протистоянню вони переважають виверти, витівки, обман і злодійство.";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: маскування, очарування особистості<br>"+
							"Рівень 3: безслідне пересування, відображення<br>"+
							"Рівень 5: мерехтіння, розсіювання магії<br>"+
							"Рівень 7: переносить двері, перетворення<br>"+
							"Рівень 9: зміна пам'яті, підпорядкування особистості";
	 				if(!contains( player.spells, 21))player.spells.push(21);
	 				if(!contains( player.spells, 35))player.spells.push(35);
	 				player.featuresList.push("Благословення ошуканця");
	 				player.featuresList.push("Ви можете дією торкнутися згідну істоту, відмінну від вас, щоб дозволити їй здійснювати з перевагою перевірки Спритності (Скритність). " +
					"Це благословення триває 1 годину, або ви не використовуєте це вміння знову.");
	 				break;
				case 5: 
					str += "Домен Природи. </b></i>";
					str += "Боги природи настільки ж різноманітні, як і сама дика природа, від незбагненних богів глибоких лісів (таких як Сильванус, Обадеш-Хай, Чіслев, Балінор і Пан) до доброзичливих божеств, які ототожнюються з джерелами і гаями (таких як Ельдат). " +
					"Друїди, які шанують природу в цілому, можуть служити одному з цих божеств, практикуючи таємничі обряди і читаючи майже забуті молитви на власною таємною мовою. Але багато хто з цих богів мають також жерців, героїв, які виконують більш активну роль в просуванні інтересів конкретного бога природи. " +
					"Ці жерці можуть полювати на злих чудовиськ, що псують лісові угіддя, благословляти урожай віруючих, або висушувати посіви тих, хто розгнівав їх богів.";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: дружба з тваринами, розмова з тваринами<br>"+
							"Рівень 3: дубова кора, шипи<br>"+
							"Рівень 5: ріст рослин, стіна вітрів<br>"+
							"Рівень 7: підпорядкування звіра, чіпка лоза<br>"+
							"Рівень 9: деревне шлях, нашестя комах";
	 				if(!contains( player.spells, 46))player.spells.push(46);
	 				if(!contains( player.spells, 15))player.spells.push(15);
	 				if(!player.armorPossessionTypes.includes("Важкий")){
	 				 	player.armorPossessionTypes.push("Важкий");
	 				 	player.armorAndWaponPossession.push("важкі обладунки");
	 				}

	 				let smskills = shuffle( [4,12,17] );
	 				for(let i = 0; i < smskills.length; i++) {
	 					if(tryAddNewSkill(player, smskills[i])) break;
	 				}

 				  	let complots = shuffle([3, 6, 15, 20, 21, 22, 23, 28, 8]);
				  	for(let i = 0, n = 1; i < complots.length && n > 0; i++) {
				     	if(contains(player.complot, complots[i]) ) continue;
				     	player.complot.push(complots[i]);
				    	 n--;
		 			}
		 			break;
				case 6: 
					str += "Домен Світла. </b></i>";
					str += "Боги світла - в тому числі Хельм, Латандер, Фолтус, Бранчала, Срібне Полум'я, Беленус, Аполлон і Ра-Хорахті - представляють ідеали відродження та оновлення, істини, пильності і краси, часто використовуючи символ сонця. Деякі з цих богів самі зображуються як сонце або візник, провідний сонце через небо. " +
					"Інші - як невтомні часові, чиї очі пронизують будь-яку тінь і бачать будь-який обман. " +
					"Деякі є божествами краси і артистизму, які вчать, що мистецтво - це засіб вдосконалення душі. " +
					"Жерці бога світла - просвітлені душі, сповнені сяйвом і силою проникливості свого божества, що відганяють геть брехню і спопеляючу темрявю.";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: вогняні долоні, вогонь фей<br>"+
							"Рівень 3: пекучий промінь, палаюча куля<br>"+
							"Рівень 5: денне світло, вогненна куля<br>"+
							"Рівень 7: вогненна стіна, страж віри<br>"+
							"Рівень 9: спостереження, небесний вогонь";
	 				if(!contains( player.spells, 30))player.spells.push(30);
	 				if(!contains( player.spells, 31))player.spells.push(31);
	 				if(!player.complot.includes(16)) player.complot.push(16);
	 				player.featuresList.push("Захищающа вспишка");
	 				player.featuresList.push("Ви можете створити божественне світло між собою і атакуючим противником. Якщо ви атаковані видимою вами істотою, що знаходяться в межах 30 футів, ви можете реакцією створити перешкоду для його кидка атаки, викликаючи перед атакуючим спалах світла, до того як він потрапить або промаже. " +
					"Істоти, які не можуть бути засліплені, мають імунітет до цього вміння. " +
					"Ви можете використовувати це вміння кількість разів, рівну вашому модифікатору Мудрості (мінімум один раз). " +
					"Ви відновлюєте всі витрачені використання, коли завершуєте тривалий відпочинок.");
	 				break;				
				case 7: 
					str += "Домен Смерті. </b></i>";
					str += "Домен смерті сфокусований навколо сил, що заподіюють смерть, а також негативної енергії, що створює нежить. Такі божества як Чемош, Міркул і Ві Джас - покровителі некромантій, лицарів смерті, Лічей, владик мумій і вампірів. Боги домену смерті також втілюють вбивство (Анубіс, Баал і Пайреміус), біль (Іуз і Ловіатар), хвороби і отрути (Інкабулос, Талону і Моргіон), а також підземний світ (Аїд і Хель).";
					str += "У кожного домена є список заклинань, які ви отримуєте на нових рівнях жерця. Як тільки ви отримуєте заклинання домену, воно завжди вважається підготовленим і не враховується при підрахунку кількості заклинань, які можна підготувати.";
	 				str +=  "<br>Рівень 1: промінь хвороби, псевдожиття<br>"+
							"Рівень 3: глухота / сліпота, промінь слабкості<br>"+
							"Рівень 5: повсталий труп, дотик вампіра<br>"+
							"Рівень 7: захист від смерті, всихання<br>"+
							"Рівень 9: хмара смерті, перешкода життя";
	 				if(!contains( player.spells, 20))player.spells.push(20);
	 				if(!contains( player.spells, 45))player.spells.push(45);
	 				if(!player.weaponPossessionTypes.includes("Військове")) {
	 					player.weaponPossessionTypes.push("Військове");
	 				 	player.armorAndWaponPossession.push("військова зброя"); 
	 				}

					let someComplot = ""; 
 				  	let nerocomplots = shuffle([7,24]);
				  	for(let i = 0, n = 1; i < nerocomplots.length && n > 0; i++) {
				     	if(contains(player.complot, nerocomplots[i]) ) continue;
				     	player.complot.push(nerocomplots[i]);
				    	n--;
		 			}
				
	 				player.featuresList.push("Жнець");
	 				player.featuresList.push(someComplot+"Коли цей жрець накладає заговор школи Некромантії, в звичайних умовах націлюющийся тільки на одну істоту, це заклинання може націлюватися на двох істот, що знаходяться в межах дистанції і при цьому в межах 5 футів один від одного.");
	 				break;
	
			}
			
			player.featuresList.push("Божествені домени");
			player.featuresList.push(str);

		},
	},

	//ЧАКЛУН
	{
		class: "Чаклун",
		hitDice: [1, 8],

		armorPossession: ["легкі обладунки"],
		armorPossessionTypes:["Легкий"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя"],
		weaponPossessionTypes:["Просте"],
		weaponPossessionItems:[],
		
		tools:[],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/0, 
			/*Тіл:*/0, 
			/*Інт:*/0, 
			/*Мудр:*/1, 
			/*Хар:*/1
		],

		skills: [1, 6, 7, 9, 11, 12, 14],
		skillsNum: 2, 

		features: [
			/*Назва:*/"Магія договору",
			/*Опис:*/"Дослідження таємниць і магія, дарована покровителем, дають вам можливість використовувати заклинання." +
			"<br><b><i>Осередки заклинань.</b></i> Всі ваші осередки заклинань одного рівня."+
			"<br><b><i>Відомі заклинання першого і більш високих рівнів.</b></i> На 1 рівні ви знаєте два заклинання 1 рівня зі списку заклинань чаклуна. Колонка «відомі заклинання» показує, коли ви зможете вивчити нові заклинання 1 рівня і вище. Рівень заклинання, яке ви вибрали, не повинен перевищувати рівень клітинок, вказаний в таблиці для чаклуна вашого рівня. Крім того, коли ви отримуєте рівень в цьому класі, ви можете вибрати одне з відомих вам заклинань чаклуна і замінити його іншим заклинанням зі списку заклинань чаклуна, з рівнем, що не перевищує рівень осередків заклинань." +
			"<br><b><i>Фокусування заклинання.</b></i> Ви можете використовувати магічне фокусування в якості заклинательного фокусування для заклинань чаклуна.",
			],

		spellcastClass: "Чаклун",
		baseSpellChar:5,
		complotNum: 2,
		complotList: [1, 2, 4, 7, 9, 10, 11, 25, 28],
		allSpells: 2,
		availableSpells: 2,
		spellList: [0, 4, 13, 17, 25, 26, 35, 40, 42, 47],

		itemsVariant(player) {
			let itemsVariant = [];

			itemsVariant.push(	[
				new namedFunction("Легкий арбалет, болти", () => {
					pushCloneElement(player.weapons, weapon[1]);
					pushCountedItemNumber(player.ammo, ammo[0], 20);
					}),
				new namedFunction("Проста зброя", () => pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			itemsVariant.push(	[
				new namedFunction("Мішечок з компонентами", () => pushCloneElement(player.items, containers[12])),
				new namedFunction("Магічне фокусування", () => pushCloneElement(player.items, magicFocus[randomInteger(0,magicFocus.length-1)])),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір вченого", () => {
					pushCloneElement(player.items, sets[12]);
					}),
				new namedFunction("Набір мандрівника", () => {
					pushCloneElement(player.items, sets[9]);
					}),
			]);

			return itemsVariant;
		},

		starterItems (player) {
			pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"));
			pushCloneElement(player.weapons, weapon[18]);
			pushCloneElement(player.weapons, weapon[18]);
			pushCloneElement(player.armor, armor[1]);
		},


		speciallyClass(player) {
			let str = "Ви уклали угоду з потойбічною істотою";
			let bonusStr = "";
			let familiar = ["Архіфея", "Виплодок", "Великий Древній"];
			familiar = familiar[randomInteger(0,familiar.length-1)]

			str += "(" + familiar + ")<br>";
			switch(familiar) {
				case "Архіфея":
					str += "Ваш покровитель це " + [
					"леді фей - Титания. Королева Літа швидше за все є наймогутнішою з архіфей. Від її посмішки дозріває урожай, а коли вона хмуриться в лісах спалахують пожежі. Вона править благословенним Літнім Двором.",
					"лорд фей - Оберон. Зелений Владика, незрівнянний мисливець і лісової воїн, коханець Титании і часто її ж противник. Оберон існує в гармонії з кожним сучком кожного дерева і з кожним струмочком лісів Країни Фей. Якщо у Оберона і є слабкість, то це дика природа його серця. Його настрій мінливий, як політ листка в урагані.",
					"лорд фей - Хірcам. Принц Дурнів, вважається першим сатиром. Він володіє кристально чистим голосом, а його жарти і гримаси можуть змусити навіть каміння реготати до сліз. Втім, Хірcам також уособлює дух нестримної дикості. Хірcам Дурень часто влаштовує розіграші, але, коли все заходить занадто далеко, а жарти стають жорстокими і смертельно небезпечними, в справу вступає Хірcам Дикун.",
					"Королева Темряви і Повітря. Править темним Сутінковим Двором з оніксового трону, який стоїть порожнім і лише Діамант Ночі розміром з людську голову ширяє над ним, тьмяно блискуючи спійманими зірками. Королева Темряви і Повітря незримо присутня поруч з ним, і голос її гучно мовить з Діаманта Ночі або ж ледь чутно нашіптує секрети придворним прямо у вуха, а іноді і те, і інше одночасно.",
					"Принц Мороза, раніше був відомий як Сонячний Принц, але його серце охололо, коли його кохана зрадила його і втекла, перетворивши свою душу в одну з зірок. З тих пір, гнівний принц прагне возз'єднатися зі своєю нареченою, коли та втілиться в смертній формі.",
					][randomInteger(0,4)];
					str += "<br>Архіфея дозволяє вам при вивченні заклинань чаклуна вибирати з більш широкого списку. У ваш список заклинань чаклуна додаються такі заклинання:<br>"
					str += "Рівень 1: " + spells[31].name + " "+ spells[57].name +"<br>";
					str += "Рівень 2: уявна сила, умиротворення <br>";
					str += "Рівень 3: мерехтіння, зростання рослин <br>";
					str += "Рівень 4: вища невидимість, підпорядкування звіра <br>";
					str += "Рівень 5: підпорядкування особистості, удавання";
					bonusStr = ["Фейська зовнішність",
					"Починаючи з 1 рівня ваш покровитель дарує вам можливість проектувати одночасно привабливу і в той же час лячну присутність фей. " +
					"Дією ви можете змусити кожну істоту в 10-футовому кубі, що рахується від вас, зробити спаскидок Мудрості зі Сл ваших заклинань чаклуна. Всі істоти, що провалили спаскидок, стають до кінця вашого наступного ходу очарованими або наляканими вами (на ваш вибір). " +
					"Використавши це вміння, ви не можете використовувати його знову, не завершивши короткого або тривалого відпочинку."];
					if(!contains(player.spells, 31)) player.spells.push(31);
					if(!contains(player.spells, 57)) player.spells.push(57);	
					break;

				case "Виплодок": 
					str += "Ваш покровитель це " + [
					"Баазка, диявол ями, стоїть за більшістю недавніх вторгнень інфернальних сил з Замку Драконівського Спису. Його плани на Узбережжя Мечів були зруйновані разом з планами Червоних Магів, але його амбіції по відношенню до регіону залишилися в силі.",
					"Белафосс, підручний демон Демогоргона, вважає себе найбільшим слугою Принца Демонів і тому є суперником мощі Демогоргона.",
					"Ельтаб, колись укладений під тейскім містом Ельтаббар, який своїми вулицями і каналами утворював печать його заключення. Демон нині на свободі у світі і шукає помсти.",
					"Еррту, балор мучавший Дзіррта До'Урдена понад століття, здебільшого через володіння артефактом під назвою Креншінібон. Програвши останню битву і будучи вигнаним зі світу, Балора тепер шукає непрямі способи помститися.",
					"Горгота, загадкова інфернальна сутність, яка шукає божественності, будучи замкненою в світі всередині магічного щита.",
					"Лоркан є камбіоном, який збирає чаклунів, як колекціонери - метеликів. Його улюблена частина колекції, Троільская Чортова Дюжина, включає в себе чаклунів, кровних нащадків тринадцяти, що уклали перший пакт з асмодеем.",
					"Малкізід, павший солар, зрадивший Селдарін. З тих пір, Малкізід насолоджувався кожним нещастям, яке він може принести ельфам, але найвищу насолоду він отримує, коли налаштовує ельфів один проти одного.",
					"Вендонай, лорд-балор був першим, хто спокусив темних ельфів викликати демонів в древніх війнах ельфійських народів. Він також наставив їх поклонятися Лолс і продовжував радити і вчити їх ще довгий час після Падіння.",
					][randomInteger(0,7)];
					str += "<br>Виплодок дозволяє вам при вивченні заклинань чаклуна вибирати з більш широкого списку. У ваш список заклинань чаклуна додаються такі заклинання:<br>"
					str += "Рівень 1: вогняні долоні, наказ<br>";
					str += "Рівень 2: глухота / сліпота, пекучий промінь <br>";
					str += "Рівень 3: смердюча хмара, вогненна куля <br>";
					str += "Рівень 4: вогненна стіна, вогненний щит <br>";
					str += "Рівень 5: небесний вогонь, святилище";
					bonusStr = ["Благословення темного",
					"Починаючи з 1 рівня, коли ви опускаєте хіти ворожої істоти до 0, ви отримуєте тимчасові хіти, рівні вашому модифікатору Харизми + ваш рівень чаклуна (мінімум 1)."];
					if(!contains(player.spells, 30)) player.spells.push(30);
					if(!contains(player.spells, 43)) player.spells.push(43);	
					break;
				case "Великий Древній":
					str += "Ваш покровитель це " + [
					"Дендар Нічна Змія, Пожирательница світів, за чутками, як виродок першого кошмару, пожирач поганих видінь і провісник кінця світу. Її чаклунам часто сняться шипіння Дендара і сухий шелест її луски, коли вони тільки усвідомлюють свій потенціал.",
					"Гонадор, Той Хто Прихований, бог аберацій Подземья, також відомий як Стародавнє Око. Йому поклоняються (якщо взагалі можна так висловитися) слизні і подібні істоти.",
					"Кезеф, Гонча Хаосу, чорний скелет мастиффа покритий хробаками, а кров його - чорна кислота. Боги уклали Кезефа на непорушній прив'язі, сковані Гондом, в сяючій в'язниці, створеної Містерой. Для того щоб заманити Гончу Хаосу туди, Тиру довелося дозволити йому відкусити собі руку.",
					"Моандер, темна сила розкладання і гниття. Відмічені його впливом спочатку бачать сон, «насіння Моандера», в якому чують слова: «Не став під сумніви слів Моандера, або будеш покараний Пожираючим Зсередини. Іди і володій сутністю сили, дій для мене. Убивай і нехай все покриє гниль. Бійся мене і підкоряйся мені ».",
					"Тірантракс, також відомий як Дух Одержимості або Палаючий, шукає влади над світом через тіла інших. Як і Мати Земля, він використовує магічні колодязі як вікна в світ, щоб поширювати свій вплив.",
					"Заргон, що повертається, також званий Незламний Тиран, по чуткам не вбиваєме і не вмираюче зло. Деякі історії стверджують, що Заргон був першим королем Дев'яти Преісподен. Інші, що він могутній Принц Демонов, вигнаний з Безодні. Можливо, жодна з цих історій не є правдою. Напевно відомо лише, що Заргон - це сила, що вселяє жах і божевілля.",
					][randomInteger(0,5)];
					str += "<br>Великий Древній дозволяє вам при вивченні заклинань чаклуна вибирати з більш широкого списку. У ваш список заклинань чаклуна додаються такі заклинання:<br>"
					str += "Рівень 1: дисонуючий шепіт, моторошний сміх Таши <br>";
					str += "Рівень 2: уявна сила, виявлення думок <br>";
					str += "Рівень 3: підглядання, послання <br>";
					str += "Рівень 4: підпорядкування звіра, евардові чорні щупальця <br>";
					str += "Рівень 5: підпорядкування особистості, телекінез";
					bonusStr = ["Пробуджений розум",
					"Починаючи з 1 рівня ваше чужде знання дає вам можливість торкатися розуму інших істот. Ви можете спілкуватися телепатично з будь-якою істотою, яку бачите в межах 30 футів від себе. Вам не потрібно знати спільну з істотою мову для того, щоб вона розуміла ваші телепатичні висловлювання, але істота має бути в змозі розуміти як мінімум одну мова."];
					if(!contains(player.spells, 12)) player.spells.push(12);
					if(!contains(player.spells, 16)) player.spells.push(16);	
					break;
			}


			player.featuresList = player.featuresList.concat([
			/*Назва:*/"Уміння покровителя",
			/*Опис:*/str,
			]);

			if(bonusStr != "") player.featuresList = player.featuresList.concat(bonusStr);
		},
	},

	//МОНАХ
	{
		class: "Монах",
		hitDice: [1, 8],

		armorPossession: [],
		armorPossessionTypes:[],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "короткі мечі"],
		weaponPossessionTypes:["Просте"],
		weaponPossessionItems:[weapon[22].name],

		tools: [],
		
		saveDice: [
			/*Сил:*/1, 
			/*Лов:*/1, 
			/*Тіл:*/0, 
			/*Інт:*/0, 
			/*Мудр:*/0, 
			/*Хар:*/0
		],

		features: [
			/*Назва:*/"Захист без обладунку",
			/*Опис:*/"Починаючи з 1 рівня, якщо ви не носите ні обладунок, ні щит, ваш Клас обладунки дорівнює 10 + модифікатор Спритності + модифікатор Мудрості. "+
			"Ви можете використовувати щит, не втрачаючи цієї переваги.",
			/*Назва:*/"Бойові мистецтва",
			/*Опис:*/"На 1 рівні ваше знання бойових мистецтв дозволяє вам ефективно використовувати в бою беззбройні удари і зброю ченців - короткі мечі, а також будь-яку просту зброю, яка не має властивостей «Дворучне» і «Важке». Якщо ви беззбройні або використовуєте тільки зброю ченців, і не носите ні обладунків, ні щита, ви отримуєте наступні переваги: " +
			"<br>• Ви можете використовувати Спритність замість Сили для кидків атак і урону ваших беззбройних ударів і атак зброєю чинців. " +
			"<br>• Ви можете використовувати кістку к4 замість звичайної кістки урону ваших беззбройних ударів або атак чернечою зброєю. Ця кістка збільшується з вашим рівнем, як показано в колонці «бойові мистецтва»." +
			"<br>• Якщо в свій хід ви використовуєте дію Атака для беззбройної атаки, або атаки чернечою зброєю, ви можете зробити ще одну беззбройну атаку бонусною дією. Наприклад, якщо ви зробили дію Атака і атакували бойовим посохом, ви можете зробити бонусною дією беззбройний атаку, за умови, що в цьому ходу ви ще не робили бонусну дію. " +
			"<br>Деякі монастирі використовують особливі види чернечого зброї. Наприклад, ви можете використовувати палицю у вигляді двох дерев'яних брусків, з'єднаних коротким ланцюгом (таку зброю називається нунчаками), або серп з більш коротким і прямим лезом (називається камою). Як би не називалося ваша чернеча зброю, ви використовуєте характеристики з розділу 5, відповідно цієї зброї. ",
			],

		skills: [0, 2, 7, 13, 14, 15],
		skillsNum: 2, 

		spellcastClass: "",
		baseSpellChar:-1,
		complotNum: 0,
		complotList: [],
		allSpells: 0,
		availableSpells: 0,
		spellList: [],


		itemsVariant(player) {
			let itemsVariant = [];

			itemsVariant.push(	[
				new namedFunction("Короткий меч", () => {
					pushCloneElement(player.weapons, weapon[22]);
					pushCountedItemNumber(player.ammo, ammo[0], 20);
					}),
				new namedFunction("Проста зброя", () => pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір дослідника підземель", () => {
					pushCloneElement(player.items, sets[8]);
					}),
				new namedFunction("Набір мандрівника", () => {
					pushCloneElement(player.items, sets[9]);
					}),
			]);

			return itemsVariant;
		},

		starterItems (player) {
			pushCountedItemNumber(player.weapons,weapon[15], 10);
		},


		speciallyClass(player) {
			player.KD[0] = 10 + player.modifierStats[4] + player.modifierStats[1];

			let rnd = randomInteger(0,1);
			if(rnd) takeRandomObjects(player.toolsPossession, artisanTools, 1);
			else takeRandomObjects(player.toolsPossession, musicItems, 1);		
		}
	},

	//ПАЛАДІН
	{
		class: "Паладін",
		hitDice: [1, 10],

		armorPossession: ["всі види обладунків", "щити"],
		armorPossessionTypes:["Легкий","Середній", "Важкий", "Щит"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "військова зброя"],
		weaponPossessionTypes:["Просте", "Військове"],
		weaponPossessionItems:[],

		tools: [],
		
		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/0, 
			/*Тіл:*/0, 
			/*Інт:*/0, 
			/*Мудр:*/1, 
			/*Хар:*/1
		],

		features: [
			/*Назва:*/"Божественне відчуття",
			/*Опис:*/"Присутність сильного зла сприймається вашими відчуттям як неприємний запах, а могутнє добро звучить як небесна музика в ваших вухах. " +
			"Ви можете дією відкрити свою свідомість для виявлення таких сил. Ви до кінця свого наступного ходу знаєте місце розташування всіх виплодків, небожителів і нежиті в межах 60 футів, що не мають повного укриття. Ви знаєте тип (виплодок, небожитель, нежить) будь-якої істоти, чию присутність ви відчуваєте, але не можете визначити, хто це конкретно (наприклад, вампір Граф Страда фон Заровіч). " +
			"У цьому ж радіусі Ви виявляєте присутність місць і предметів, які були освячені або осквернені, наприклад, заклинанням святилище. Ви можете використовувати це вміння кількість разів, рівне 1 + модифікатор Харизми. " +
			"Коли ви закінчуєте тривалий відпочинок, ви відновлюєте всі витрачені використання.",
			/*Назва:*/"Накладення рук",
			/*Опис:*/"Ваш благословенний дотик може лікувати рани. У вас є запас цілющої сили, який відновлюється після тривалого відпочинку. За допомогою цього запасу ви можете відновлювати кількість хітів, рівне рівню Паладіна, помноженому на 5. Ви можете дією торкнутися істоти і, зачерпнувши силу з запасу, відновити кількість хітів цієї істоти на будь-яке число, аж до максимуму, що залишився в вашому запасі. В якості альтернативи, ви можете витратити 5 хітів з вашого запасу хітів для лікування цілі від однієї хвороби або одної діючої на неї отрути. Ви можете усунути кілька ефектів хвороби і отрути одним використанням Накладання рук, витрачаючи хіти окремо для кожного ефекту. Це вміння не робить ніякого ефекту на нежить і конструктів.",
		],

		skills: [2, 6, 10, 13, 14, 16],
		skillsNum: 2, 

		spellcastClass: "",
		baseSpellChar:-1,
		complotNum: 0,
		complotList: [],
		allSpells: 0,
		availableSpells: 0,
		spellList: [],

		itemsVariant(player) {
			let itemsVariant = [];
			let functionForSearch = (el) =>  el.category[0] == "Просте" && el.category[1] == "Рукопашне";

			itemsVariant.push(	[
				new namedFunction("Дві військові зброї", () => {
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Військове"));
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Військове"));
					}),
				new namedFunction("Військова зброя і щит", () => {
					pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Військове"));
					pushCloneElement(player.shield, shield[0]);
					}),
			]);

			itemsVariant.push(	[
				new namedFunction("5 метальних списів", () => {
					pushCountedItemNumber(player.weapons, weapon[24], 5);
					}),
				new namedFunction("Проста рук. зброя", () => pushCloneElement(player.weapons,takeFromListOfAvilableItem(weapon, functionForSearch))),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір священика", () => pushCloneElement(player.items, sets[10])),
				new namedFunction("Набір мандрівника", () => pushCloneElement(player.items,  sets[9])),
			]);

			return itemsVariant;
		},

		starterItems(player) {
			pushCloneElement(player.armor, armor[3]);
			pushCloneElementWithEdit(player.items, [magicFocus[0],  magicFocus[5], magicFocus[7]][randomInteger(0,2)] ,"(священий символ)");
		},

		speciallyClass(player) {
		}
	},

	//ПЛУТ
	{
		class: "Плут",
		hitDice: [1, 8],

		armorPossession: ["легкі обладунки"],
		armorPossessionTypes:["Легкий"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "довгі мечі", "короткі мечі", "рапіри", "ручні арбалети"],
		weaponPossessionTypes:["Просте"],
		weaponPossessionItems:[weapon[22].name, weapon[14].name, weapon[32].name, weapon[2].name],
		
		tools:[scroungerTools[0].name],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/1, 
			/*Тіл:*/0, 
			/*Інт:*/1, 
			/*Мудр:*/0, 
			/*Хар:*/0
		],

		skills: [0, 1, 2, 3, 5, 6, 8, 11, 13, 15, 16],
		skillsNum: 4, 

		features: [
			/*Назва:*/"Прихована атака",
			/*Опис:*/"Починаючи з 1 рівня ви знаєте, як точно наносити удар і використовувати відволікання ворога. Один раз в хід ви можете заподіяти додатковий урон 1к6 одній з істот, по якій ви потрапили атакою, скоєною з перевагою до кидка атаки. Атака повинна використовувати далекобійну зброю або зброю з властивістю «фехтувальне». Вам не потрібно мати перевагу при кидку атаки, якщо інший ворог цілі знаходиться в межах 5 футів від неї. Цей ворог не повинен бути недієздатним, і у вас не повинно бути перешкоди для кидка атаки. Додатковий урон збільшується, коли ви отримуєте рівні в цьому класі, як показано в колонці «прихована атака».",
			/*Назва:*/"Злодійський Жаргон",
			/*Опис:*/"Під час шахрайського навчання ви вивчили злодійський жаргон, таємну суміш діалекту, жаргону та шифру, який дозволяє приховувати повідомлення в, здавалося б, звичайній розмові. Тільки інша істота, яка знає злодійський жаргон, розуміє такі повідомлення. Це займає в чотири рази більше часу, ніж передача тих же слів прямим текстом." +
			"Крім того, ви розумієте набір секретних знаків і символів, який використовується для передачі коротких і простих повідомлень. Наприклад, чи є область небезпечною або територією гільдії злодіїв, чи знаходиться поблизу здобич, чи простодушні люди в окрузі, і чи надають тут безпечний притулок для злодіїв в бігах.",
		],

		spellcastClass: "",
		baseSpellChar:-1,
		complotNum: 0,
		complotList: [],
		allSpells: 0,
		availableSpells: 0,
		spellList: [],

		itemsVariant(player) {
			let itemsVariant = [];

			itemsVariant.push(	[
				new namedFunction("Рапіра", () => pushCloneElement(player.weapons, weapon[32])),
				new namedFunction("Короткий меч", () => pushCloneElement(player.weapons, weapon[22])),
			]);

			itemsVariant.push(	[
				new namedFunction("Короткий лук, сагайдак", () => {
					pushCloneElement(player.weapons, weapon[21]);
					pushCountedItemNumber(player.ammo, ammo[4],20);
					pushCloneElement(player.items, containers[5]);
					}),
				new namedFunction("Короткий меч", () => pushCloneElement(player.weapons, weapon[22])),
			]);


			itemsVariant.push(	[
				new namedFunction("Набір взломщика", () => pushCloneElement(player.items, sets[4])),
				new namedFunction("Набір дослідника підземель", () => pushCloneElement(player.items, sets[8])),
				new namedFunction("Набір мандрівника", () => pushCloneElement(player.items, sets[9])),
			]);

			return itemsVariant;
		},

		starterItems (player) {
			pushCloneElement(player.weapons, weapon[18]);
			pushCloneElement(player.weapons, weapon[18]);
			pushCloneElement(player.armor, armor[1]);
			pushCloneElement(player.items, scroungerTools[0]);
		},


		speciallyClass(player) {
			let str = "Ваш бонус майстерності подвоюється для перевірок  ";
			let skillsList = []; 
			let rnd, rnd2;
			skillsList = skillsList.concat(player.skills);
			skillsList.push(1);

			while(true) {
				rnd = randomInteger(0,18);
				if(skillsList[rnd] == 1) break;
			}

			str += ["Акробатики","Аналізу", "Атлетики", "Уважності", "Виживання", "Виступу", "Залякування", "Історії",  
			"Ловкісті рук", "Магії", "Медицини", "Обману", "Природи", "Проникливості","Релігії", "Скритності", "Переконання", "Догляду за тваринами", "Воровських інструментів"][rnd];

			while(true) {
				rnd2 = randomInteger(0,18);
				if(skillsList[rnd2] == 1 && rnd2 != rnd) break;
			}

			str += " і " + ["Акробатики","Аналізу", "Атлетики", "Уважності", "Виживання", "Виступу", "Залякування", "Історії",  
			"Ловкісті рук", "Магії", "Медицини", "Обману", "Природи", "Проникливості","Релігії", "Скритності", "Переконання", "Догляду за тваринами", "Воровських інструментів"][rnd2] +
			".";



			player.featuresList = player.featuresList.concat([
			/*Назва:*/"Компетентність",
			/*Опис:*/str,
			]);			
		},
	},

	//СЛІДОПИТ
	{
		class: "Слідопит",
		hitDice: [1, 10],

		armorPossession: ["Легкі обладнуки", "середні обладунки", "щити"],
		armorPossessionTypes:["Легкий","Середній", "Щит"],
		armorPossessionItems:[],

		weaponPossession: ["проста зброя", "військова зброя"],
		weaponPossessionTypes:["Просте", "Військове"],
		weaponPossessionItems:[],

		tools: [],
		
		saveDice: [
			/*Сил:*/1, 
			/*Лов:*/1, 
			/*Тіл:*/0, 
			/*Інт:*/0, 
			/*Мудр:*/0, 
			/*Хар:*/0
		],

		features: [],

		skills: [1, 2, 3, 4, 12, 13, 15, 17],
		skillsNum: 3, 

		spellcastClass: "",
		baseSpellChar:-1,
		complotNum: 0,
		complotList: [],
		allSpells: 0,
		availableSpells: 0,
		spellList: [],

		itemsVariant(player) {
			let itemsVariant = [];
			let functionForSearch = (el) =>  el.category[0] == "Військове" && el.category[1] == "Рукопашне";

			itemsVariant.push(	[
				new namedFunction("Лускатий обладунок", () => pushCloneElement(player.armor, armor[9])),
				new namedFunction("Шкіряний обладунок", () => pushCloneElement(player.armor, armor[1])),
			]);

			itemsVariant.push(	[
				new namedFunction("2 коротких меча", () => {
					pushCloneElement(player.weapons, weapon[22]);
					pushCloneElement(player.weapons, weapon[22]);
					}),
				new namedFunction("2 прості рук. зброї", () => {
					pushCloneElement(player.weapons,takeFromListOfAvilableItem(weapon, functionForSearch));
					pushCloneElement(player.weapons,takeFromListOfAvilableItem(weapon, functionForSearch));
				}),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір дослідника підземель", () => pushCloneElement(player.items, sets[8])),
				new namedFunction("Набір мандрівника", () => pushCloneElement(player.items, sets[9])),
			]);

			return itemsVariant;
		},

		starterItems (player) {
			pushCloneElement(player.weapons, weapon[13]);
			pushCountedItemNumber(player.ammo, ammo[4],20);	
		},

		speciallyClass(player) {
			if(randomInteger(0,1)) {
				player.featuresList =  player.featuresList.concat([
					/*Назва:*/"Обраний ворог",
					/*Опис:*/"Починаючи з 1 рівня у вас є значний досвід вивчення, відстеження, полювання і навіть спілкування з певним видом ворогів. " +
					"Виберіть вид обраного ворога: аберації, велетні, дракони, звірі, породження, конструкти, монстри, небожителі, нежить, рослини, слиз, феї або елементалі. В якості альтернативи ви можете вибрати в якості обраних ворогів дві гуманоїдні раси (наприклад, гноллов і орків)<br>."+
					"Запишіть ваших ворогів тут: <br>" +
					"Ви робите з перевагою перевірки Мудрості (Виживання) для вистежування обраних ворогів, а також перевірки Інтелекту для згадування інформації про них. "+
					"Коли ви отримуєте це вміння, ви також навчаєтеся однієї з мов, на якій говорить ваш обраний ворог, якщо він взагалі вміє говорити. ",	
				]);
			} else {
				player.featuresList =  player.featuresList.concat([
					/*Назва:*/"Переважний противник",
					/*Опис:*/"Коли ви потрапляєте атакою по цілі, ви можете закликати сили природи, щоб відзначити істоту і зробити її вашим заклятим супротивником на 1 хвилину або до тих пір, поки не втратите концентрацію (як якщо б ви концентрувалися на заклинання). "+
					"Вперше в кожен свій хід, коли ви потрапляєте атакою по поміченому противнику і наносите йому урон, в тому числі і коли ви відзначаєте його, ви можете додатково нанести 1К4 шкоди того ж типу. "+
					"Ви можете використовувати це вміння для позначки кращого ворога кількість разів, рівну вашому бонусу майстерності. Ви відновлюєте всі витрачені використання після довгого відпочинку.",	
				]);
			}

			if(randomInteger(0,1)) {
				let str = ["Арктиками", "Болотами", "Горами", "Лісами", "Луками", "Узбережжями", "Підземеллями", "Пустелями"][randomInteger(0,7)];
				player.featuresList =  player.featuresList.concat([
					/*Назва:*/"Дослідник природи",
					/*Опис:*/"Ви дуже добре знайомі з "+str+" одним видом природного середовища і маєте великий досвід подорожей і виживання в регіонах з таким кліматом. Коли ви робите перевірку Інтелекту або Мудрості, пов'язану з відомою вам місцевістю, ваш бонус майстерності подвоюється, якщо ви використовуєте навик, яким володієте. " +
					"Подорожуючи по обраній вами місцевості протягом години або більше, ви отримуєте наступні переваги:" +
					"<br>• Труднопрохідна місцевість не уповільнює подорож групи."+
					"<br>• Ваша група не може заблукати, крім як з вини магії."+
					"<br>• Навіть коли ви займаєтеся іншою діяльністю під час подорожі (наприклад, шукаєте їжу, орієнтуєтеся або вистежуєте), ви залишаєтеся готові до небезпеки."+
					"<br>• Якщо ви подорожуєте поодинці, ви можете переміщатися приховано в нормальному темпі."+
					"<br>• Коли ви шукаєте їжу, то знаходите в два рази більше, ніж зазвичай."+
					"<br>• Коли ви вистежуєте інших істот, ви також дізнаєтеся їх точну кількість, їх розміри і як давно вони пройшли через область.",	
				]);
			} else {	
				let rnd;
				while(true) {
					rnd = randomInteger(0,17);
					if(player.skills[rnd] == 1) break;
				}
				let str = "";
				str += ["Акробатики","Аналізу", "Атлетики", "Уважності", "Виживання", "Виступу", "Залякування", "Історії",  
				"Ловкісті рук", "Магії", "Медицини", "Обману", "Природи", "Проникливості","Релігії", "Скритності", "Переконання", "Догляду за тваринами"][rnd];

				takeLanguage(player, languages, 2);

				player.featuresList =  player.featuresList.concat([
					/*Назва:*/"Майстерний дослідник",
					/*Опис:*/"Ви - неперевершений дослідник і виживальщик, здатний як самостійно мандрувати по дикій місцевості, так і допомагати з цим іншим. Ви отримуєте описану нижче здатність «Хитрун»",	
					/*Назва:*/"Хитрун",
					/*Опис:*/"Ваш бонус майстерності подвоюється для всіх перевірок характеристики, які ви робите, використовуючи перевірку: " + str +". " +
					"Ви також можете говорити, читати і писати на двох додаткових мовах.", 	
				]);
			}

		}
	},

	//ЧАРОДІЙ
	{
		class: "Чародій",
		hitDice: [1, 6],

		armorPossession: [],
		armorPossessionTypes:[],
		armorPossessionItems:[],

		weaponPossession: ["бойові посохи", "дротики", "кинжали", "легкі арбалети", "пращі"],
		weaponPossessionTypes:[],
		weaponPossessionItems:[weapon[6].name, weapon[15].name, weapon[18].name, weapon[1].name, weapon[31].name],
		
		tools:[],

		saveDice: [
			/*Сил:*/0, 
			/*Лов:*/0, 
			/*Тіл:*/1, 
			/*Інт:*/0, 
			/*Мудр:*/0, 
			/*Хар:*/1
		],

		skills: [6, 9, 11, 13, 14, 16],
		skillsNum: 2, 

		features: [
			/*Назва:*/"Використання заклинань",
			/*Опис:*/"Певний подія у вашому минулому або в житті ваших батьків або предків залишило на вас незгладимий відбиток, зв'язавши вас з магією. Ваші заклинання живить якесь джерело магії, якого б походження воно не було. " +
			"<br><b><i>Відомі заклинання першого і більш високих рівнів.</b></i> Ви знаєте два заклинання 1 рівня зі списку заклинань чародія. Колонка «відомі заклинання» показує, коли ви зможете вивчити нові заклинання. Рівень заклинань не повинен перевищувати рівень найвищої наявної у вас клітинки заклинань. " +
			"Наприклад, коли ви досягнете 3 рівня в цьому класі, ви можете вивчити одне нове заклинання 1 або 2 рівня. " +
			"Крім того, коли ви отримуєте новий рівень в цьому класі, ви можете одне з відомих вам заклинань чародія замінити на інше зі списку чародія, рівень якого теж повинен відповідати наявним осередкам заклинань." +
			"<br><b><i>Фокусування заклинання.</b></i> Ви можете використовувати магічне фокусування в якості фокусування для заклинань чародія.",
		],

		spellcastClass: "Чародій",
		baseSpellChar:5,
		complotNum: 4,
		complotList: [0, 1, 2, 4, 7, 8, 9, 10, 13, 14, 15, 16, 19, 25, 27, 28],
		allSpells: 2,
		availableSpells: 2,
		spellList: [1, 4, 5, 6, 14, 20, 21, 29, 30, 35, 37, 40, 42, 44, 45, 48, 55, 57, 58, 60, 51],

		itemsVariant(player) {
			let itemsVariant = [];

			itemsVariant.push(	[
				new namedFunction("Легкий арбалет, болти", () => {
					pushCloneElement(player.weapons, weapon[1]);
					pushCountedItemNumber(player.ammo, ammo[0], 20);
					}),
				new namedFunction("Проста зброя", () => pushCloneElement(player.weapons, takeFromListOfAvilableItem(weapon, el=> el.category[0] == "Просте"))),
			]);

			itemsVariant.push(	[
				new namedFunction("Мішечок з компонентами", () => pushCloneElement(player.items, containers[12])),
				new namedFunction("Магічне фокусування", () => pushCloneElement(player.items, magicFocus[randomInteger(0,magicFocus.length-1)])),
			]);

			itemsVariant.push(	[
				new namedFunction("Набір дослідника підземель", () => {
					new namedFunction("Набір дослідника підземель", () => pushCloneElement(player.items, sets[8]));
					}),
				new namedFunction("Набір мандрівника", () => {
					pushCloneElement(player.items, sets[9]);
					}),
			]);

			return itemsVariant;
		},

		starterItems (player) {	
			pushCloneElement(player.weapons, weapon[18]);
			pushCloneElement(player.weapons, weapon[18]);
		},


		speciallyClass(player) {
			let str = "<b><i>Ваше походження: ";
			let dragon;
			let elem;
			
			switch(randomInteger(0,1)) {
				case 0: 
					str += "Спадщина драконячої крові.</b></i> ";
					str += "Ваша вроджена магія родом з магії драконів, що змішалася з вашою кров`ю, або успадкована вами. Найчастіше, чарівники з таким джерелом сили можуть простежити свій родовід до могутніх чарівників давнини, котрі укладали угоди з драконами або навіть оголошували себе нащадками драконів. " +
					"Деякі з таких спадкових гілок добре відомі, але більшість з них приховані. Або чарівник може бути родоначальником такої гілки, отримавши силу в результаті договору або інших надприродних обставин.";
	 				
					switch(randomInteger(0, 4)) {
						case 0: 
							dragon = ["Білий", "Срібний"][randomInteger(0, 1)];
							elem = "Холод";
							break;
						case 1: 
							dragon = ["Зелений"][0];
							elem = "Отрута";
							break;
						case 2: 
							dragon = ["Золотий", "Червоний","Латунний"][randomInteger(0, 2)];
							elem = "Вогонь";
							break;
						case 3: 
							dragon = ["Бронзовий", "Синій"][randomInteger(0, 1)];
							elem = "Електрика";
							break;
						case 4:
							dragon = ["Мідний", "Чорний"][randomInteger(0, 1)];
							elem = "Кислота";
							break;
					}
 					if( !player.languages.includes(languages[10]) ) player.languages.push(languages[10]);
 					player.featuresList.push("Драконячий предок");
 					player.featuresList.push("Ваш предок: " + dragon +" дракон (елемент: " + elem + "), пов'язаний з ним вид урону використовується в ваших уміннях. Крім того, коли ви взаємодієте з драконами і робите перевірку Харизми, ваш бонус майстерності подвоюється для цієї перевірки.");
 					player.featuresList.push("Драконяча стійкість");
 					player.featuresList.push("Магія, що тече через ваше тіло, проявляє фізичні риси ваших предків драконів. Максимум ваших хітів збільшується на 1 на 1 рівні і на 1 на кожному рівні, отриманому в даному класі. Крім того, деякі ділянки вашої шкіри покриті тонкою драконячою лускою. Якщо ви не носите обладунки, ваш КД дорівнює 13 + модифікатор Спритності.");
 					player.maxHits++;
 					player.KD[0] = 13 + player.modifierStats[1];
	 				break;
	 			case 1: 
					str += "Дика магія. </b></i>";
					str += "Ваша магія виходить від диких сил хаосу, що лежать в основі світобудови. Ви, можливо, зазнали впливу грубої магії в тій чи іншій формі. Можливо, вона просочилася через портал, ведучий в Лімбо, Стихійні Плани або таємничу Далеку Межу. Може бути, ви були благословенні могутньої феєю або відзначені демоном. Або ваша магія може бути випадковістю вашого народження, без очевидної причини. Незалежно від її походження, хаотична магія вирує всередині вас, готова вирватися назовні.";
	 				player.featuresList.push("Хвилі дикої магії");
	 				player.featuresList.push("Ваше чаклунство може викликати хвилі дикої магії. Відразу після накладання вами заклинання як мінімум 1 рівня Майстер може попросити вас кинути К20. Якщо випадає 1, киньте кістку по таблиці «Хвиля дикої магії» для створення випадкового магічного ефекту (заготовьте таблицб самі). Хвиля може виникатись тільки один раз за хід. Якщо ефект хвилі є заклинанням, він занадто непередбачуваний, щоб його можна було модифікувати метамагією. Якщо заклинання-ефект в звичайних обставинах вимагає концентрацію, то в даному випадку воно не вимагає концентрацію і триває свою максимальну тривалість.");
	 				player.featuresList.push("Потік хаосу");
	 				player.featuresList.push("Починаючи з 1 рівня ви можете маніпулювати силами випадку і хаосу, щоб отримати перевагу для одного кидка атаки, перевірки характеристики або спаскидка. Зробивши це, ви повинні зробити тривалий відпочинок, перш ніж ви зможете використовувати це вміння ще раз. У будь-який момент до того як ви відновите це вміння, відразу після використання вами заклинання чарівника як мінімум 1 рівня, Майстер може попросити вас кинути кістку на ефект від Хвилі дикої магії. Після цього ви відновлюєте використання цього вміння.");
	 				break;
			}
			
			player.featuresList.push("Походження чародія");
			player.featuresList.push(str);
		},
	},


];

function randomInteger(min, max) {
  // случайное число от min до (max+1)
  let rand = min + Math.random() * (max + 1 - min);
  return Math.floor(rand);
}

function addSkillFromClericKnowlage(player) {

}