'use strict'

// 1 - мм
// 2 - см
// 3 - эм
// 4 - зм
// 5 - ...

//МУЗИКАЛЬНІ ІНСТРУМЕНТИ
var musicItems = [
	{
		id: 0,
		name: "Барабан",
		value: [6, 4], // Вартсть, номінал
		weight: 3.0
	},

	{
		id: 1,
		name: "Віола",
		value: [30, 4], 
		weight: 1.0
	},

	{
		id: 2,
		name: "Волинка",
		value: [30, 4], 
		weight: 6.0
	},

	{
		id: 3,
		name: "Ліра",
		value: [30, 4],
		weight: 2.0
	},

	{
		id: 4,
		name: "Лютня",
		value: [35, 4], 
		weight: 3.0
	},

	{
		id: 5,
		name: "Ріжок",
		value: [3, 4],
		weight: 2.0
	},

	{
		id: 6,
		name: "Свірель",
		value: [12, 4], 
		weight: 2.0
	},

	{
		id: 7,
		name: "Флейта",
		value: [2, 4],
		weight: 1.0
	},

	{
		id: 8,
		name: "Цимбали",
		value: [25, 4], 
		weight: 10.0
	},

	{
		id: 9,
		name: "Шоломія",
		value: [2, 4], 
		weight: 1.0
	},
];

//СНАРЯЖЕНИЕ
var equipment = 
[
	{
		id: 0,
		name: "Абак",
		value: [2, 4], 
		weight: 2.0
	},

	{
		id: 1,
		name: "Блок і лебідка",
		value: [1, 4], 
		weight: 5.0
	},

	{
		id: 2,
		name: "Папір (один лист)",
		value: [2, 2], 
		weight: 0
	},

	{
		id: 3,
		name: "Прядив'яна мотузка",
		value: [1, 4], 
		weight: 10.0
	},

	{
		id: 4,
		name: "Мотузка з шовку",
		value: [10, 4], 
		weight: 0
	},

	{
		id: 5,
		name: "Ваги торгові",
		value: [5, 4], 
		weight: 3.0
	},

	{
		id: 6,
		name: "Віск (сургуч)",
		value: [5, 2], 
		weight: 0
	},

	{
		id: 7,
		name: "Духи (флакон)",
		value: [5, 4], 
		weight: 0
	},

	{
		id: 8,
		name: "Замок",
		value: [10, 4], 
		weight: 1.0
	},

	{
		id: 9,
		name: "Дзеркало стальне",
		value: [5, 4], 
		weight: 1.2
	},

	{
		id: 10,
		name: "Калтропи",
		value: [1, 4], 
		weight: 2.0
	},

	{
		id: 11,
		name: "Кандали",
		value: [2, 4], 
		weight: 6.0
	},

	{
		id: 12,
		name: "Кірка гірницька",
		value: [2, 4], 
		weight: 10.0
	},

	{
		id: 13,
		name: "Книга",
		value: [25, 4], 
		weight: 5.0
	},

	{
		id: 14,
		name: "Книга заклинань",
		value: [50, 4], 
		weight: 1.0
	},

	{
		id: 15,
		name: "Дзвіночок",
		value: [1, 4], 
		weight: 0
	},

	{
		id: 16,
		name: "Кільца-печатка",
		value: [5, 4], 
		weight: 0
	},

	{
		id: 17,
		name: "Драбина",
		value: [1, 2], 
		weight: 25.0
	},

	{
		id: 18,
		name: "Лом",
		value: [2, 4], 
		weight: 5.0
	},

	{
		id: 19,
		name: "Лопата",
		value: [2, 4], 
		weight: 5.0
	},

	{
		id: 20,
		name: "Молот ковальський",
		value: [2, 4], 
		weight: 10.0
	},

	{
		id: 21,
		name: "Молоток",
		value: [1, 4], 
		weight: 3.0
	},

	{
		id: 22,
		name: "Мило",
		value: [2, 1], 
		weight: 0
	},

	{
		id: 23,
		name: "Одіяло",
		value: [5, 2], 
		weight: 3.0
	},

	{
		id: 24,
		name: "Мисливський капкан",
		value: [5, 4], 
		weight: 25.0
	},

	{
		id: 25,
		name: "Намет двомісний",
		value: [2, 4], 
		weight: 20.0
	},

	{
		id: 26,
		name: "Пергамент (один лист)",
		value: [1, 2], 
		weight: 0
	},

	{
		id: 27,
		name: "Піщаний годиник",
		value: [25, 4], 
		weight: 1.0
	},

	{
		id: 28,
		name: "Письмове перо",
		value: [2, 1], 
		weight: 2.0
	},

	{
		id: 29,
		name: "Підзорна труба",
		value: [1000, 4], 
		weight: 1.0
	},

	{
		id: 30,
		name: "Сідельні сумки",
		value: [4, 4], 
		weight: 8.0
	},

	{
		id: 31,
		name: "Сідло військове",
		value: [20, 4], 
		weight: 30.0
	},

	{
		id: 32,
		name: "Сідло грузове",
		value: [5, 4], 
		weight: 15.0
	},

	{
		id: 33,
		name: "Сідло їздове",
		value: [10, 4], 
		weight: 25.0
	},

	{
		id: 34,
		name: "Сідло екзотичне",
		value: [60, 4], 
		weight: 40.0
	},

	{
		id: 35,
		name: "сигнальний свисток",
		value: [5, 1], 
		weight: 0
	},

	{
		id: 36,
		name: "Спальник",
		value: [1, 4], 
		weight: 7.0
	},

	{
		id: 37,
		name: "Столовий набір",
		value: [2, 2], 
		weight: 1.0
	},

	{
		id: 38,
		name: "Таран портативний",
		value: [4, 4], 
		weight: 35.0
	},

	{
		id: 39,
		name: "Трутниця",
		value: [5, 2], 
		weight: 1.0
	},	

	{
		id: 40,
		name: "Збільшувальне скло",
		value: [100, 5], 
		weight: 0
	},

	{
		id: 41,
		name: "Упряж і вуздечка",
		value: [2, 4], 
		weight: 1.0
	},

	{
		id: 42,
		name: "Ланцюг",
		value: [5, 4], 
		weight: 10.0
	},

	{
		id: 43,
		name: "Людський череп пофарбований охрою",
		value: [10, 4], 
		weight: 0
	},

	{
		id: 44,
		name: "Чорнила",
		value: [10, 4], 
		weight: 0
	},

	{
		id: 45,
		name: "Жердина",
		value: [5, 1], 
		weight: 7.0
	},

	{
		id: 46,
		name: "Шипи залізні (по 10 шт.)",
		value: [1, 4], 
		weight: 5.0
	},

	{
		id: 47,
		name: "Шлямбур (кілочок)",
		value: [5, 1], 
		weight: 0.25
	},				
];

var ammo = [
	{
		id: 0,
		name: "Арбалетні болти",
		value: [1, 4], 
		weight: 1.5,
		count: 20,
	},

	{
		id: 1,
		name: "Голки для трубки",
		value: [1, 4], 
		weight: 1.0,
		count: 50
	},

	{
		id: 2,
		name: "Металеві шарики",
		value: [1, 4], 
		weight: 2.0,
		count: 1000
	},
	
	{

		id: 3,
		name: "Снаряди для пращі",
		value: [4, 1], 
		weight: 1.5,
		count: 20
	},

	{
		id: 4,
		name: "Стріли",
		value: [1, 4], 
		weight: 1.0,
		count: 20
	},			
];

var throwing = [
	{
		id: 0,
		name: "Алхімічний вогонь (фляга)",
		value: [500, 4], 
		weight: 1.0,
	},	

	{
		id: 1,
		name: "Бомба",
		value: [150, 4], 
		weight: 1.0,
	},	

	{
		id: 2,
		name: "Кислота (флакон)",
		value: [25, 4], 
		weight: 1.0,
	},	

	{
		id: 3,
		name: "Крюк-кішка",
		value: [2, 4], 
		weight: 4.0,
	},	

	{
		id: 4,
		name: "Масло (фляга)",
		value: [1, 2], 
		weight: 1.0,
	},	

	{
		id: 5,
		name: "Свята вода",
		value: [25, 4], 
		weight: 1.0,
	},	
];

var armor = [
	//ЯКЩО БРОНЯ ЛЕГКА, ДО НЕМА ОГРАНЫЧЭНЫЯ ПО ЛОВКОСТІ
	{
		id: 0,
		name: "Кіраса (Нагрудник)",
		value: [400, 4], 
		weight: 20.0,
		type: "Середній",
		KD: 14,
		bonusKD: true
	},	

	{
		id: 1,
		name: "Шкіряний обладунок",
		value: [10, 4], 
		weight: 10.0,
		type: "Легкий",
		KD: 11,
		bonusKD: true
	},	

	{
		id: 2,
		name: "Кільчастий (колечний) обладунок",
		value: [30, 4], 
		weight: 40.0,
		type: "Важкий",
		KD: 14,
		bonusKD: false
	},	
	
	{
		id: 3,
		name: "Кольчуга",
		value: [75, 4], 
		weight: 55.0,
		type: "Важкий",
		KD: 16,
		bonusKD: false
	},	

	{
		id: 4,
		name: "Лати",
		value: [1500, 4], 
		weight: 65.0,
		type: "Важкий",
		KD: 18,
		bonusKD: false
	},	

	{
		id: 5,
		name: "Набороной (пластинчастий) обладунок",
		value: [200, 4], 
		weight: 60.0,
		type: "Важкий",
		KD: 17,
		bonusKD: false
	},	

	{
		id: 6,
		name: "Полулати",
		value: [750, 4], 
		weight: 40.0,
		type: "Середній",
		KD: 15,
		bonusKD: true
	},	

	{
		id: 7,
		name: "Проклепаний шкіряний обладунок",
		value: [45, 4], 
		weight: 13.0,
		type: "Легкий",
		KD: 12,
		bonusKD: true
	},	

	{
		id: 8,
		name: "Стебнований обладунок",
		value: [5, 4], 
		weight: 8.0,
		type: "Легкий",
		KD: 11,
		bonusKD: true
	},	

	{
		id: 9,
		name: "Лускатий обладунок",
		value: [50, 4], 
		weight: 45.0,
		type: "Середній",
		KD: 14,
		bonusKD: true
	},	

	{
		id: 10,
		name: "Шипований обладунок",
		value: [75, 4], 
		weight: 45.0,
		type: "Середній",
		KD: 14,
		bonusKD: true
	},	

	{
		id: 11,
		name: "Шкурний обладунок",
		value: [10, 4], 
		weight: 12.0,
		type: "Середній",
		KD: 12,
		bonusKD: true
	},	
];

var food = [
	{
		id: 0,
		name: "Вино звичайне (кухоль)",
		value: [2, 2], 
		weight: 0,
	},	

	{
		id: 1,
		name: "Вино відмінне (пляшка)",
		value: [10, 4], 
		weight: 0,
	},	

	{
		id: 2,
		name: "М'ясо смажене (шматок)",
		value: [3, 4], 
		weight: 0,
	},	

	{
		id: 3,
		name: "Пиво Галон (4 літри)",
		value: [2, 2], 
		weight: 0,
	},	

	{
		id: 4,
		name: "Пиво (кухоль)",
		value: [4, 0], 
		weight: 0,
	},	

	{
		id: 5,
		name: "Раціони (1 день)",
		value: [5, 2], 
		weight: 2.0,
	},	

	{
		id: 6,
		name: "Сир (шматок)",
		value: [1, 2], 
		weight: 0,
	},	

	{
		id: 7,
		name: "Урочиста вечеря",
		value: [10, 4], 
		weight: 0,
	},	

	{
		id: 8,
		name: "Хліб (шмат)",
		value: [2, 1], 
		weight: 0,
	},	
];

var ridingAnimal = [
	
	{
		id: 0,
		name: "Бойовий кінь",
		value: [400, 4], 
		weight: 0,
	},	

	{
		id: 1,
		name: "Верблюд",
		value: [50, 4], 
		weight: 0,
	},	

	{
		id: 2,
		name: "Кінь їздовий",
		value: [75, 4], 
		weight: 0,
	},	

		{
		id: 3,
		name: "Кінь тяговий",
		value: [50, 4], 
		weight: 0,
	},	

		{
		id: 4,
		name: "Мастиф",
		value: [25, 4], 
		weight: 0,
	},	

		{
		id: 5,
		name: "Мул",
		value: [8, 4], 
		weight: 0,
	},	

		{
		id: 6,
		name: "Віслюк",
		value: [8, 4], 
		weight: 0,
	},	

		{
		id: 7,
		name: "Поні",
		value: [30, 4], 
		weight: 0,
	},	

	{
		id: 8,
		name: "Слон",
		value: [200, 4], 
		weight: 0,
	},	

];

var gameSet = [
	{
		id: 0,
		name: "Драконові шахи",
		value: [1, 4], 
		weight: 0.5,
	},	

	{
		id: 1,
		name: "Карти",
		value: [5, 2], 
		weight: 0,
	},	

	{
		id: 2,
		name: "Кубики",
		value: [1, 2], 
		weight: 0,
	},

	{
		id: 3,
		name: "Ставка трьох драконів",
		value: [1, 4], 
		weight: 0,
	},	
];

var scroungerTools = [
	{
		id: 0,
		name: "Інструменти крадія",
		fullName: "Інструменти крадія (невеликий напильник, набір відмичок, " +
		"невеличке дзеркальце на довгій ручці, ножиці і пара щіпчікова щипчиків)",
		value: [25, 4], 
		weight: 15.0,
	},	

	{
		id: 2,
		name: "Інструменти отруйника",
		fullName: "Інструменти отруйника (склянки, ступка і товкач, хімічні реагенти і скляна паличка для розмішування)",
		value: [25, 4], 
		weight: 2.0,
	},		
];

var artisanTools = [
	{
		id: 0,
		name: "Інструменти алхіміка",
		fullName: "Інструменти алхіміка (дві скляні мензурки, металевий каркас, підтримувач мензурки над відкритим полум'ям, скляна паличка для розмішування, невелика ступка і товкач, мішечок звичайних алхімічних інгредієнтів, що включає в себе сіль, подрібнене залізо і дистильовану воду)",
		value: [50, 4], 
		weight: 8.0,
	},		

	{
		id: 1,
		name: "Інструменти гончара",
		fullName: "Інструменти гончара (гончарні голки, цикли, скребки, ніж та кронциркуль)",
		value: [10, 4], 
		weight: 3.0,
	},

	{
		id: 2,
		name: "Інструменти бляхаря",
		fullName: "Інструменти бляхаря (різні ручні інструменти, нитки, голки, точильний камінь, шматки тканини і шкіри, невелика банка клею",
		value: [50, 4], 
		weight: 10.0,
	},

	{
		id: 3,
		name: "Інструменти каліграфа",
		fullName: "Інструменти каліграфа (чорнило, безліч пергаментних аркушів і три писемних пера)",
		value: [10, 4], 
		weight: 5.0,
	},

	{
		id: 4,
		name: "Інструменти муляра",
		fullName: "Інструменти муляра (кельма, молоток, долото, щітки і косинець)",
		value: [10, 4], 
		weight: 8.0,
	},

	{
		id: 5,
		name: "Інструменти картографа",
		fullName: "Інструменти картографа (письмове перо, чорнило, пергамент, циркуль, кронциркуль і лінійка)",
		value: [15, 4], 
		weight: 6.0,
	},		

	{
		id: 6,
		name: "Інструменти шкіряника",
		fullName: "Інструменти шкіряника (шкіряний різак (ніж), невелика киянка, канавкоріз, пробійник, нитка і шматки шкіри)",
		value: [5, 4], 
		weight: 5.0,
	},

	{
		id: 7,
		name: "Інструменти коваля",
		fullName: "Інструменти коваля (молоти, кліщі, вугілля, ганчір'я і точильний камінь)",
		value: [20, 4], 
		weight: 8.0,
	},

	{
		id: 8,
		name: "Інструменти пивовара",
		fullName: "Інструменти пивовара (велика скляна пляшка, трохи хмелю, сифон, змійовик і кілька футів трубок)",
		value: [8, 4], 
		weight: 6.0,
	},

	{
		id: 9,
		name: "Інструменти кухаря",
		fullName: "Інструменти кухаря (металевий казан, ножі, виделки, ложка для розмішування і ополоник)",
		value: [1, 4], 
		weight: 8.0,
	},

		{
		id: 10,
		name: "Інструменти теслі",
		fullName: "Інструменти теслі (пила, молоток, цвяхи, сокира, кутник, лінійка, кородер, рубанок і стамеска)",
		value: [8, 4], 
		weight: 6.0,
	},

	{
		id: 11,
		name: "Інструменти різьбяра по дереву",
		fullName: "Інструменти різьбяра по дереву (ніж, стамеска і маленька пилка)",
		value: [1, 4], 
		weight: 5.0,
	},

	{
		id: 12,
		name: "Інструменти шевця",
		fullName: "Інструменти шевця (молоток, шило, ніж, взуттєва колодка, ножиці, запас шкіри і ниток)",
		value: [5, 4], 
		weight: 5.0,
	},

		{
		id: 13,
		name: "Інструменти склодува",
		fullName: "Інструменти склодува (трубка для видування, маленька склодувна обкатка, катальник, розгортки і щипці)",
		value: [30, 4], 
		weight: 5.0,
	},

	{
		id: 14,
		name: "Інструменти ткача",
		fullName: "Інструменти ткача (нитки, голки і шматки тканини)",
		value: [1, 4], 
		weight: 5.0,
	},

	{
		id: 15,
		name: "Інструменти художника",
		fullName: "Інструменти художника (мольберт, полотно, фарби, пензлі, вугільні олівці і палітра)",
		value: [10, 4], 
		weight: 5.0,
	},

	{
		id: 16,
		name: "Інструменти ювеліра",
		fullName: "Інструменти ювеліра (невелика пила і молоточок, напильники, щипці і пінцет)",
		value: [25, 4], 
		weight: 2.0,
	},

	{
		id: 17,
		name: "Інструменти навігатора",
		fullName: "Інструменти навігатора (секстант, компас, кронциркуль, лінійка, пергамент, чорнило, письмове перо)",
		value: [25, 4], 
		weight: 2.0,
	},	

];

var containers = [
	{
		id: 0,
		name: "Бочка",
		value: [2, 4], 
		weight: 70.0,
	},

	{
		id: 1,
		name: "Бурдюк",
		value: [2, 2], 
		weight: 5.0,
	},

	{
		id: 2,
		name: "Бутилка скляна",
		value: [2, 4], 
		weight: 2.0,
	},

	{
		id: 3,
		name: "Відро деревяне",
		value: [5, 1], 
		weight: 2.0,
	},

		{
		id: 4,
		name: "Горшок залізний",
		value: [2, 4], 
		weight: 10.0,
	},

	{
		id: 5,
		name: "Сагайдак",
		value: [1, 4], 
		weight: 1.0,
	},

	{
		id: 6,
		name: "Контейнер для арбалетних болтів",
		value: [1, 4], 
		weight: 1.0,
	},

	{
		id: 7,
		name: "Контейнер для карт і свитків",
		value: [1, 4], 
		weight: 1.0,
	},

		{
		id: 8,
		name: "Корзина",
		value: [4, 2], 
		weight: 2.0,
	},

	{
		id: 9,
		name: "Гаманець",
		value: [5, 2], 
		weight: 1.0,
	},

	{
		id: 10,
		name: "Кувшин",
		value: [2, 1], 
		weight: 4.0,
	},

	{
		id: 11,
		name: "Мішок",
		value: [1, 1], 
		weight: 0.5,
	},

		{
		id: 12,
		name: "Мішечок з компонентами",
		value: [25, 4], 
		weight: 2.0,
	},

	{
		id: 13,
		name: "Рюкзак",
		value: [2, 4], 
		weight: 5.0,
	},

	{
		id: 14,
		name: "Скриня",
		value: [5, 4], 
		weight: 25.0,
	},

	{
		id: 15,
		name: "Флакон",
		value: [1, 4], 
		weight: 0,
	},

	{
		id: 16,
		name: "Фляга",
		value: [2, 1], 
		weight: 1.0,
	},
];

var magicFocus = [
	
	{
		id: 0,
		name: "Амулет",
		value: [5, 4], 
		weight: 1.0,
	},

	{
		id: 1,
		name: "Чарівна палочка",
		value: [10, 4], 
		weight: 1.0,
	},

	{
		id: 2,
		name: "Жезл",
		value: [10, 4], 
		weight: 2.0,
	},

	{
		id: 3,
		name: "Кристал",
		value: [10, 4], 
		weight: 1.0,
	},

	{
		id: 4,
		name: "Посох",
		value: [5, 4], 
		weight: 4.0,
	},

	{
		id: 5,
		name: "Релікварій",
		value: [5, 4], 
		weight: 2.0,
	},

	{
		id: 6,
		name: "Сфера",
		value: [20, 4], 
		weight: 3.0,
	},

	{
		id: 7,
		name: "Емблема",
		value: [5, 4], 
		weight: 0,
	},
];

var sets = [
	{
		id: 0,
		name: "Комплект для лазіння",
		fullName: "Комплект для лазіння (шлямбури, накладні підошви, рукавички і страхувальна прив'язь)",
		value: [25, 4], 
		weight: 12.0,
	},		

	{
		id: 1,
		name: "Комплект для риболовлі",
		fullName: "Комплект для риболовлі (вудилище, шовкова волосінь, корковий поплавець, сталеві гачки, свинцеві грузила, приманки з ниток і дрібноклітинна сітка)",
		value: [1, 4], 
		weight: 4.0,
	},

	{
		id: 2,
		name: "Комплект цілителя",
		fullName: "Комплект цілителя (шкіряний гаманець з бинтами, мазями і шинами",
		value: [5, 4], 
		weight: 3.0,
	},

	{
		id: 3,
		name: "Набір артиста",
		fullName: "Набір артиста (рюкзак, спальник, 2 костюма, 5 свічок, раціони на 5 днів, хутро і набір для гриму (різна косметика, фарба для волосся, трохи реквізиту і кілька нарядів))",
		value: [40, 4], 
		weight: 25.0,
	},

	{
		id: 4,
		name: "Набір зломщика",
		fullName: "Набір зломщика (рюкзак, сумка з 1 000 металевих кульок, 10 футів волосіні, дзвіночок, 5 свічок, ломик, молоток, 10 шлямбурів, закритий ліхтар, 2 фляги масла, раціони на 5 днів, трутніця і бурдюк)",
		value: [16, 4], 
		weight: 35.0,
	},

	{
		id: 5,
		name: "Набір дипломата",
		fullName: "Набір дипломата (скриня, 2 контейнера для карт і свитків, комплект відмінного одягу, пляшечка чорнил, письмове перо, лампа, 2 фляги масла, 5 аркушів паперу, флакон духів, віск і мило)",
		value: [39, 4], 
		weight: 35.0,
	},		

	{
		id: 6,
		name: "Набір для гриму",
		fullName: "Набір для гриму (різна косметика, фарба для волосся, трохи реквізиту і кілька нарядів)",
		value: [25, 4], 
		weight: 3.0,
	},

	{
		id: 7,
		name: "Набір для фальсифікації",
		fullName: "Набір для фальсифікації (чорнила різних видів, пергамент і папір різних видів, два писемних пера, печатка і сургуч, золотий і срібний листи і невеликі інструменти для ліплення з розплавленого воску імітації печаті)",
		value: [15, 4], 
		weight: 5.0,
	},

	{
		id: 8,
		name: "Набір дослідника підземель",
		fullName: "Набір дослідника підземельа (рюкзак, ломик, молоток, 10 шлямбурів, 10 факелів, трутниця, раціони на 10 днів і бурдюк)",
		value: [12, 4], 
		weight: 35.0,
	},

	{
		id: 9,
		name: "Набір мандрівника",
		fullName: "Набір мандрівника (рюкзак, спальник, столовый набір, трутниця, 10 факелів, раціони на 10 днів, бурдюк, 50-футова прядив'яна мотузка)",
		value: [10, 4], 
		weight: 59.0,
	},

		{
		id: 10,
		name: "Набір священика",
		fullName: "Набір священика (рюкзак, ковдра, 10 свічок, трутниця, коробка для пожертвувань, 2 упаковки пахощів, кадило, одяг священика, раціони на 2 дні і бурдюк)",
		value: [19, 4], 
		weight: 15.0,
	},

	{
		id: 11,
		name: "Набір травника",
		fullName: "Набір травника (мішечки для зберігання трав, секатор і шкіряні рукавички для збору рослин, кілька скляних банок, ступку і товкач)",
		value: [1, 4], 
		weight: 5.0,
	},

	{
		id: 12,
		name: "Набір вченого",
		fullName: "Набір вченого (рюкзак, наукова книга, пляшечка чорнил, письмове перо, 10 аркушів пергаменту, невелика сумочка з піском і невеликий ніж)",
		value: [40, 4], 
		weight: 15.0,
	},
];

var clothes = [

	{
		id: 0,
		name: "Комплект одягу (звичайна)",
		value: [5, 2], 
		weight: 3.0,
	},			

	{
		id: 1,
		name: "Коплект одягу (костюм)",
		value: [5, 4], 
		weight: 4.0,
	},	

	{
		id: 2,
		name: "Криваво-червоне вбрання",
		value: [4, 4], 
		weight: 4.0,
	},

	{
		id: 3,
		name: "Одяг (відмінний, парадний)",
		value: [15, 4], 
		weight: 6.0,
	},

	{
		id: 4,
		name: "Одяг мандрівника (дорожня)",
		value: [2, 4], 
		weight: 3.0,
	},	

	{
		id: 5,
		name: "Ряса",
		value: [1, 4], 
		weight: 4.0,
	},	

];

var weapon = [

	{
		id: 0,
		name: "Алебарда",
		value: [20, 4], 
		weight: 6.0,
		damage:[1, 10, "рубаний"],
		properties: ["Дворучне", "Досяжність", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 1,
		name: "Арбалет легкий",
		value: [25, 4], 
		weight: 5.0,
		damage:[1, 8, "колющий"],
		properties: ["Дворучне", "Перезарядка", "Боєприпас"],
		category: ["Просте", "Далекобійне"],
		dist: [80, 320]
	},

	{
		id: 2,
		name: "Арбалет ручний",
		value: [75, 4], 
		weight: 3.0,
		damage:[1, 6, "колющий"],
		properties: ["Боєприпас", "Легке", "Перезарядка"],
		category: ["Військове", "Далекобійне"],
		dist: [30, 120]
	},

	{
		id: 3,
		name: "Арбалет важкий",
		value: [50, 4], 
		weight: 18.0,
		damage:[1, 10, "колющий"],
		properties: ["Дворучне", "Боєприпас", "Важке", "Перезарядка"],
		category: ["Військове", "Далекобійне"],
		dist: [100, 400]
	},

	{
		id: 4,
		name: "Бойова кирка",
		value: [5, 4], 
		weight: 2.0,
		damage:[1, 8, "колющий"],
		properties: [],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 5,
		name: "Бойовий молот",
		value: [15, 4], 
		weight: 2.0,
		damage:[1, 8, "дробний"],
		properties: ["Універсальне"],
		category: ["Військове", "Рукопашне"],
		twoHand: [1, 10],
	},

	{
		id: 6,
		name: "Бойовий посох",
		value: [2, 2], 
		weight: 4.0,
		damage:[1, 6, "дробний"],
		properties: ["Універсальне"],
		category: ["Просте", "Рукопашне"],
		twoHand: [1, 8],
	},

	{
		id: 7,
		name: "Бойова сокира",
		value: [10, 4], 
		weight: 4.0,
		damage:[1, 8, "рубаний"],
		properties: ["Універсальне"],
		category: ["Військове", "Рукопашне"],
		twoHand: [1, 10],
	},

	{
		id: 8,
		name: "Булава",
		value: [5, 4], 
		weight: 1.0,
		damage:[1, 6, "дробний"],
		properties: [],
		category: ["Просте", "Рукопашне"],
	},

	{
		id: 9,
		name: "Глефа",
		value: [20, 4], 
		weight: 6.0,
		damage:[1, 10, "рубаний"],
		properties: ["Дворучне", "Досяжність", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 10,
		name: "Дворучний меч",
		value: [20, 4], 
		weight: 6.0,
		damage:[1, 10, "рубаний"],
		properties: ["Дворучне", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 11,
		name: "Дворучна сокира",
		value: [20, 4], 
		weight: 6.0,
		damage:[1, 12, "рубаний"],
		properties: ["Дворучне", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 12,
		name: "Довгий спис",
		value: [10, 4], 
		weight: 6.0,
		damage:[1, 12, "колющий"],
		properties: ["Дворучне", "Особливе", "Досяжність"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 13,
		name: "Довгий лук",
		value: [50, 4], 
		weight: 2.0,
		damage:[1, 8, "колющий"],
		properties: ["Дворучне", "Боєприпас", "Важке"],
		category: ["Військове", "Далекобійне"],
		dist: [150, 600]
	},

	{
		id: 14,
		name: "Довгий меч",
		value: [15, 4], 
		weight: 3.0,
		damage:[1, 8, "рубаний"],
		properties: ["Універсальне"],
		category: ["Військове", "Рукопашне"],
		twoHand: [1, 10],
	},

	{
		id: 15,
		name: "Дротик",
		value: [5, 1], 
		weight: 0.25,
		damage:[1, 4, "колющий"],
		properties: ["Метальне", "Фехтувальне"],
		category: ["Просте", "Далекобійне"],
		dist: [20, 60]
	},

	{
		id: 16,
		name: "Дубинка",
		value: [1, 2], 
		weight: 2.0,
		damage:[1, 4, "дробний"],
		properties: ["Легке"],
		category: ["Просте", "Рукопашне"],
	},

	{
		id: 17,
		name: "Духовая трубка",
		value: [10, 4], 
		weight: 1.0,
		damage:[1, 1, "колющий"],
		properties: ["Боєприпас", "Перезарядка"],
		category: ["Військове", "Далекобійне"],
		dist: [25, 100]
	},

	{
		id: 18,
		name: "Кинджал",
		value: [2, 4], 
		weight: 1.0,
		damage:[1, 4, "колющий"],
		properties: ["Метальне", "Фехтувальне", "Легке"],
		category: ["Просте", "Рукопашне"],
		dist: [20, 60]
	},

	{
		id: 19,
		name: "Кнут",
		value: [2, 4], 
		weight: 3.0,
		damage:[1, 4, "рубаний"],
		properties: ["Фехтувальне", "Досяжність"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 20,
		name: "Спис",
		value: [1, 4], 
		weight: 3.0,
		damage:[1, 6, "колющий"],
		properties: ["Метальне", "Універсальне"],
		category: ["Просте", "Рукопашне"],
		dist: [20, 60],
		twoHand: [1, 8],
	},

	{
		id: 21,
		name: "Короткий лук",
		value: [25, 4], 
		weight: 2.0,
		damage:[1, 6, "колющий"],
		properties: ["Дворучне", "Боєприпас"],
		category: ["Просте", "Далекобійне"],
		dist: [80, 320]
	},

	{
		id: 22,
		name: "Короткий меч",
		value: [10, 4], 
		weight: 2.0,
		damage:[1, 6, "колющий"],
		properties: ["Фехтувальне", "Легке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 23,
		name: "Легкий молот",
		value: [2, 4], 
		weight: 2.0,
		damage:[1, 4, "дробний"],
		properties: ["Легке", "Метальне"],
		category: ["Просте", "Рукопашне"],
		dist: [20, 60]
	},

	{
		id: 24,
		name: "Метальний спис",
		value: [5, 2], 
		weight: 2.0,
		damage:[1, 6, "колющий"],
		properties: ["Метальне"],
		category: ["Просте", "Рукопашне"],
		dist: [30, 120]
	},

	{
		id: 25,
		name: "Молот",
		value: [10, 4], 
		weight: 10.0,
		damage:[2, 6, "дробний"],
		properties: ["Дворучне", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 26,
		name: "Моргенштерн",
		value: [15, 4], 
		weight: 4.0,
		damage:[1, 8, "колющий"],
		properties: [],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 27,
		name: "Мушкет",
		value: [500, 4], 
		weight: 10.0,
		damage:[1, 12, "колющий"],
		properties: ["Дворучне", "Перезарядка", "Боєприпас"],
		category: ["Військове", "Далекобійне"],
		dist: [40, 120]
	},

	{
		id: 28,
		name: "Палица (дубина)",
		value: [2, 2], 
		weight: 10.0,
		damage:[1, 8, "дробний"],
		properties: ["Дворучне"],
		category: ["Просте", "Рукопашне"],
	},

	{
		id: 29,
		name: "Піка",
		value: [5, 4], 
		weight: 18.0,
		damage:[1, 10, "колющий"],
		properties: ["Дворучне", "Досяжність", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 30,
		name: "Пістоль",
		value: [250, 4], 
		weight: 3.0,
		damage:[1, 10, "колющий"],
		properties: ["Боєприпас"],
		category: ["Військове", "Далекобійне"],
		dist: [30, 90]
	},

	{
		id: 31,
		name: "Праща",
		value: [1, 2], 
		weight: 0.1,
		damage:[1, 4, "дробний"],
		properties: ["Боєприпас"],
		category: ["Просте", "Далекобійне"],
		dist: [30, 120]
	},

	{
		id: 32,
		name: "Рапіра",
		value: [25, 4], 
		weight: 2.0,
		damage:[1, 8, "колющий"],
		properties: ["Фехтувальне"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 33,
		name: "Ручна сокира",
		value: [5, 4], 
		weight: 2.0,
		damage:[1, 6, "рубаний"],
		properties: ["Легке", "Метальне"],
		category: ["Просте", "Рукопашне"],
		dist: [20, 60]
	},

	{
		id: 34,
		name: "Серп",
		value: [1, 4], 
		weight: 2.0,
		damage:[1, 4, "рубаний"],
		properties: ["Легке"],
		category: ["Просте", "Рукопашне"],
	},

	{
		id: 35,
		name: "Сітка",
		value: [1, 4], 
		weight: 3.0,
		damage:[0, 0, " "],
		properties: ["Метальне", "Особливе"],
		category: ["Військове", "Далекобійне"],
	},

	{
		id: 36,
		name: "Тризуб",
		value: [5, 4], 
		weight: 4.0,
		damage:[1, 6, "колющий"],
		properties: ["Метальне", "Універсальне"],
		category: ["Військове", "Рукопашне"],
		dist: [20, 60],
		twoHand: [1, 8],
	},

	{
		id: 37,
		name: "Ціп",
		value: [10, 4], 
		weight: 2.0,
		damage:[1, 8, "дробний"],
		properties: [],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 38,
		name: "Топір",
		value: [10, 4], 
		weight: 2.0,
		damage:[1, 8, "рубаний"],
		properties: ["Дворучне", "Важке"],
		category: ["Військове", "Рукопашне"],
	},

	{
		id: 39,
		name: "Скімітар",
		value: [25, 4], 
		weight: 2.0,
		damage:[1, 6, "рубаний"],
		properties: ["Легке", "Фехтувальне"],
		category: ["Військове", "Рукопашне"],
	},

];

var light = [

	{
		id: 0,
		name: "Лампа",
		value: [5, 2], 
		weight: 1.0,
	},

	{
		id: 1,
		name: "Свічка",
		value: [1, 1], 
		weight: 0,
	},

	{
		id: 2,
		name: "Факел",
		value: [1, 1], 
		weight: 1.0,
	},

	{
		id: 3,
		name: "Ліхтар закритий",
		value: [5, 4], 
		weight: 2.0,
	},

	{
		id: 37,
		name: "Ліхтар направлений",
		value: [10, 4], 
		weight: 2.0,
	},

];

var sacredSymbol = [
	{
		id: 0,
		name: "Амулет",
		value: [5, 2], 
		weight: 1.0,
	},

	{
		id: 1,
		name: "Релікварій",
		value: [5, 1], 
		weight: 2.0,
	},

	{
		id: 2,
		name: "Емблема",
		value: [5, 1], 
		weight: 0,
	},
];

var goods = [

	{
		id: 0,
		name: "Віл",
		value: [15, 4], 
		weight: 0,
	},
	
	{
		id: 1,
		name: "Гвоздика (пряність)",
		value: [3, 4], 
		weight: 1.0,
	},

	{
		id: 2,
		name: "Залізо",
		value: [1, 2], 
		weight: 1.0,
	},

	{
		id: 3,
		name: "Золото",
		value: [50, 4], 
		weight: 1.0,
	},

		{
		id: 4,
		name: "Імбирь (пряність)",
		value: [1, 4], 
		weight: 1.0,
	},
	
	{
		id: 5,
		name: "Кориця (пряність)",
		value: [2, 4], 
		weight: 1.0,
	},

	{
		id: 6,
		name: "Корова",
		value: [10, 4], 
		weight: 0,
	},

	{
		id: 7,
		name: "Курка",
		value: [2, 4], 
		weight: 0,
	},

		{
		id: 8,
		name: "Мідь",
		value: [5, 2], 
		weight: 1.0,
	},
	
	{
		id: 9,
		name: "Емблема",
		value: [5, 1], 
		weight: 0,
	},

	{
		id: 10,
		name: "Мука",
		value: [2, 1], 
		weight: 1.0,
	},

	{
		id: 11,
		name: "Вівця",
		value: [2, 4], 
		weight: 0,
	},

		{
		id: 12,
		name: "Перець (пряність)",
		value: [2, 4], 
		weight: 1.0,
	},
	
	{
		id: 13,
		name: "Платина",
		value: [500, 4], 
		weight: 1.0,
	},

	{
		id: 14,
		name: "Пшениця",
		value: [1, 1], 
		weight: 1.0,
	},

	{
		id: 15,
		name: "Свиня",
		value: [3, 4], 
		weight: 0,
	},

		{
		id: 16,
		name: "Срібло",
		value: [5, 4], 
		weight: 1.0,
	},
	
	{
		id: 17,
		name: "Сіль",
		value: [5, 1], 
		weight: 1.0,
	},

	{
		id: 18,
		name: "Тканина лляна",
		value: [5, 4], 
		weight: 0,
	},

	{
		id: 19,
		name: "Тканина бавовняна",
		value: [5, 2], 
		weight: 0,
	},

	{
		id: 20,
		name: "Полотно",
		value: [1, 2], 
		weight: 0,
	},
	
	{
		id: 21,
		name: "Шафран (пряність)",
		value: [15, 4], 
		weight: 1.0,
	},
];

var druidFocus = [

	{
		id: 0,
		name: "Гілочка омели",
		value: [1, 4], 
		weight: 0,
	},

	{
		id: 1,
		name: "Тотем",
		value: [1, 4], 
		weight: 0,
	},

	{
		id: 2,
		name: "Дерев'яний ціпок",
		value: [5, 4], 
		weight: 4.0,
	},
	
	{
		id: 3,
		name: "Тисова паличка",
		value: [10, 4], 
		weight: 1.0,
	},

];

var poison = [

	{
		id: 0,
		name: "Протиотрута (флакон)",
		value: [50, 4], 
		weight: 0,
	},

	{
		id: 1,
		name: "Отрута простий (флакон)",
		value: [100, 4], 
		weight: 0,
	},

	{
		id: 2,
		name: "Кров ассасина (Отрута)",
		value: [150, 4], 
		weight: 0,
	},

	{
		id: 3,
		name: "Сивородка правди (Отрута)",
		value: [150, 4], 
		weight: 0,
	},

	{
		id: 4,
		name: "Зміїна отрута",
		value: [200, 4], 
		weight: 0,
	},

	{
		id: 5,
		name: "Слизь повзаючого падальщика (Отрута)",
		value: [200, 4], 
		weight: 0,
	},

	{
		id: 6,
		name: "Отрута дроу",
		value: [200, 4], 
		weight: 0,
	},

	{
		id: 7,
		name: "Блідна настоянка (Отрута)",
		value: [250, 4], 
		weight: 0,
	},

	{
		id: 8,
		name: "Злоба (Отрута)",
		value: [250, 4], 
		weight: 0,
	},

	{
		id: 9,
		name: "Есенція ефіру (Отрута)",
		value: [300, 4], 
		weight: 0,
	},

	{
		id: 10,
		name: "Масло тагіта (Отрута)",
		value: [400, 4], 
		weight: 0,
	},

	{
		id: 11,
		name: "Дим паленого отура (Отрута)",
		value: [500, 4], 
		weight: 0,
	},

	{
		id: 12,
		name: "Ступор (Отрута)",
		value: [600, 4], 
		weight: 0,
	},

	{
		id: 13,
		name: "Отрута віверни",
		value: [1200, 4], 
		weight: 0,
	},

	{
		id: 14,
		name: "Отрута лілового хробака",
		value: [2000, 4], 
		weight: 0,
	},

	{
		id: 15,
		name: "Північні сльози (Отрута)",
		value: [1500, 4], 
		weight: 0,
	},

];

var shield = [
	{	
		id: 0,
		name: "Щит",
		value: [10, 4],
		type:"Щит",
		weight: 6.0,
		KD: 2,
	}
];

var transportWater = [
	{	
		id: 0,
		name: "Військовий корабель",
		value: [25000, 4],
		weight: 0,
	},

	{	
		id: 1,
		name: "Галера",
		value: [30000, 4],
		weight: 6.0,
	},

	{	
		id: 2,
		name: "Драккар",
		value: [10000, 4],
		weight: 6.0,
	},

	{	
		id: 3,
		name: "Човен",
		value: [50, 4],
		weight: 6.0,
	},

	{	
		id: 4,
		name: "Вітрильник",
		value: [10000, 4],
		weight: 6.0,
	},

	{	
		id: 5,
		name: "Шлюпка",
		value: [3000, 4],
		weight: 100.0,
	},

];

var transportAir = [
	{	
		id: 0,
		name: "Повітряний корабель",
		value: [20000, 4],
		weight: 0,
	},
];

var transport = [
	{	
		id: 0,
		name: "Карета",
		value: [250, 4],
		weight: 100,
	},

	{	
		id: 1,
		name: "Коляска",
		value: [100, 4],
		weight: 600,
	},

	{	
		id: 2,
		name: "Сани",
		value: [20, 4],
		weight: 300,
	},

	{	
		id: 3,
		name: "Телега",
		value: [15, 4],
		weight: 200,
	},

	{	
		id: 4,
		name: "Фургон",
		value: [35, 4],
		weight: 400,
	},
];