'use string'
var race = [
	//ГНОМ
	{
		name: "Гном",
		subraces: 
		[
			//ГНОМ
			{
				race: "Гном",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/0, 
					/*Тіл:*/0, 
					/*Інт:*/2, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Маленький",
				minSize: 3,
				maxSize: 4,
				minMass: 40,
				maxMass: 45,
				speed: 25,
				age: 350,
				minAge: 40,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до життя під землею, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Хитрість гнома",
					/*Опис:*/"Ви робите з перевагою спаскидки Інтелекту, Мудрості і Харизми проти магії.",
				],

				languages: [languages[0], languages[2]],
				speciallyRace(player) {

				}
			},

			//ГНОМ (ЛІСНИЙ)
			{
				race: "Гном (лісний)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/1, 
					/*Тіл:*/0, 
					/*Інт:*/2, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Маленький",
				minSize: 3,
				maxSize: 4,
				minMass: 40,
				maxMass: 45,
				speed: 25,
				age: 350,
				minAge: 40,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до життя під землею, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Хитрість гнома",
					/*Опис:*/"Ви робите з перевагою спаскидки Інтелекту, Мудрості і Харизми проти магії.",
					/*Назва:*/"Природна ілюзія",
					/*Опис:*/"Ви знаєте заклинання мала ілюзія (малая илюзия). Базовою характеристикою для його використання є Інтелект.",
					/*Назва:*/"Спілкування з маленькими звірами",
					/*Опис:*/"За допомогою звуків і жестів ви можете передавати прості поняття маленьким або ще меншим звірям. Лісові гноми люблять тварин." +
					"і часто тримають білок, борсуків, кроликів, кротів, дятлів та інших тварин в якості вихованців.",
				],

				languages: [languages[0], languages[2]],
				speciallyRace(player) {
					if(!player.complot.includes(9)) player.complot.push(9);
				}
			},

			//ГНОМ СКЕЛЬНИЙ
			{
				race: "Гном (скельний)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/0, 
					/*Тіл:*/1, 
					/*Інт:*/2, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Маленький",
				minSize: 3,
				maxSize: 4,
				minMass: 40,
				maxMass: 45,
				speed: 25,
				minAge: 40,
				age: 350,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до життя під землею, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Хитрість гнома",
					/*Опис:*/"Ви робите з перевагою спаскидки Інтелекту, Мудрості і Харизми проти магії.",
					/*Назва:*/"Ремісничі знання",
					/*Опис:*/"При здійсненні перевірки Інтелекту (Історія) стосовно до магічного, алхімічному або технологічного об'єкту, " + 
					"ви можете додати до перевірки подвоєний бонус майстерності замість звичайного.",
					/*Назва:*/"Бляхар",
					/*Опис:*/"Ви володієте ремісничими інструментами (інструменти бляхаря). З їх допомогою ви можете, витративши 1 годину часу і матеріали на суму в 10 зм, " + 
					"створити Крихітна механічний пристрій (КД 5, 1 хіт). Це пристрій перестає працювати через 24 години (якщо ви не витратите 1 година на підтримку його роботи). " + 
					"Ви можете Дією розібрати його; в цьому випадку ви можете отримати назад використані матеріали. Одночасно ви можете мати не більше трьох таких пристроїв. " + 
					" <br>  -При створенні пристрою, виберіть один з наступних варіантів:<br>  -Заводна іграшка. Ця заводна іграшка зображує тварину, чудовисько або істоту, на кшталт жаби," + 
					" миші, птахи, дракона або солдатика. Поставлена на землю, вона проходить 5 футів у випадковому напрямку за кожен ваш хід, видаючи звуки.  <br>  -" +
					"Запальничка. Цей пристрій виробляє мініатюрний вогник, за допомогою якого можна запалити свічку, факел або багаття. Використання цього пристрою потребує Дії.<br>" +
					"  -Музична шкатулка. При відкритті ця скринька програє мелодію середньої гучності. Шкатулка перестає грати якщо мелодія закінчилася або якщо шкатулку закрили.",
				],

				languages: [languages[0], languages[2]],
				speciallyRace(player) {
					if(!player.toolsPossession.includes("Інструменти бляхаря")) player.toolsPossession.push("Інструменти бляхаря");
				}
			},

		],
		
	},

	//ДВАРФ
	{
		name: "Дварф",
		subraces: [
			//ДВАРФ
			{
				race: "Дварф",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/0, 
					/*Тіл:*/2, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 4,
				maxSize: 5,
				minMass: 130,
				maxMass: 160,
				speed: 25,
				age: 350,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені", "Лисина"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до життя під землею, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Дварфська стійкість. ",
					/*Опис:*/"Ви робите з перевагою спаскидки від отрути, і ви отримуєте опір до пошкоджень отрутою.",
					/*Назва:*/"Знання каменю",
					/*Опис:*/"Якщо ви робите перевірку Інтелекту (Історія), пов'язану з походженням роботи по каменю, ви, зважайте, володієте навиком Історії, і додаєте до перевірки подвоєний бонус майстерності замість звичайного.",
					],

				languages: [languages[0], languages[4]],
				speciallyRace(player) {
					if(!player.weaponPossessionItems.includes(weapon[7].name) && !player.weaponPossessionTypes.includes(weapon[7].category[0]) ) {
						player.armorAndWaponPossession.push("бойові сокири");
						player.weaponPossessionItems.push(weapon[7].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[33].name) && !player.weaponPossessionTypes.includes(weapon[33].category[0]) ) {
						player.armorAndWaponPossession.push("ручні сокири");
						player.weaponPossessionItems.push(weapon[33].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[5].name) && !player.weaponPossessionTypes.includes(weapon[5].category[0]) ) {
						player.armorAndWaponPossession.push("бойові молоти");
						player.weaponPossessionItems.push(weapon[5].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[23].name) || !player.weaponPossessionTypes.includes(weapon[23].category[0]) ) {
						player.armorAndWaponPossession.push("легкі молоти");
						player.weaponPossessionItems.push(weapon[23].name);
					}

					takeRandomObjects(player.toolsPossession, [ artisanTools[8],artisanTools[4],artisanTools[7] ], 1);

				}
			},

			//ДВАРФ ГОРНИЙ
			{
				race: "Дварф (гірський)",
				increaseCharacteristic: [
					/*Сил:*/2, 
					/*Лов:*/0, 
					/*Тіл:*/2, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 4,
				maxSize: 5,
				minMass: 130,
				maxMass: 160,
				speed: 25,
				age: 350,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені", "Лисина"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до життя під землею, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Дварфська стійкість",
					/*Опис:*/"Ви робите з перевагою спаскидки від отрути, і ви отримуєте опір до пошкоджень отрутою.",
					/*Назва:*/"Знання каменю",
					/*Опис:*/"Якщо ви робите перевірку Інтелекту (Історія), пов'язану з походженням роботи по каменю, ви, зважайте, володієте навиком Історії, і додаєте до перевірки подвоєний бонус майстерності замість звичайного.",
					],

				languages: [languages[0], languages[4]],
				speciallyRace(player) {
					if(!player.weaponPossessionItems.includes(weapon[7].name) && !player.weaponPossessionTypes.includes(weapon[7].category[0]) ) {
						player.armorAndWaponPossession.push("бойові сокири");
						player.weaponPossessionItems.push(weapon[7].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[33].name) && !player.weaponPossessionTypes.includes(weapon[33].category[0]) ) {
						player.armorAndWaponPossession.push("ручні сокири");
						player.weaponPossessionItems.push(weapon[33].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[5].name) && !player.weaponPossessionTypes.includes(weapon[5].category[0]) ) {
						player.armorAndWaponPossession.push("бойові молоти");
						player.weaponPossessionItems.push(weapon[5].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[23].name) && !player.weaponPossessionTypes.includes(weapon[23].category[0]) ) {
						player.armorAndWaponPossession.push("легкі молоти");
						player.weaponPossessionItems.push(weapon[23].name);
					}

					takeRandomObjects(player.toolsPossession, [ artisanTools[8],artisanTools[4],artisanTools[7] ], 1);

					if(!player.armorPossessionTypes.includes("Легкий") ) {
						player.armorAndWaponPossession.push("легкі обладунки");
						player.armorPossessionTypes.push("Легкий");
					}

				}
			},

			//ДВАРФ ХОЛМОВИЙ
			{
				race: "Дварф (пагорбовий)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/0, 
					/*Тіл:*/2, 
					/*Інт:*/0, 
					/*Мудр:*/1, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 4,
				maxSize: 5,
				minMass: 130,
				maxMass: 160,
				speed: 25,
				age: 350,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені", "Лисина"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до життя під землею, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Дварфська стійкість",
					/*Опис:*/"Ви робите з перевагою спаскидки від отрути, і ви отримуєте опір до пошкоджень отрутою.",
					/*Назва:*/"Дварфська витримка",
					/*Опис:*/"Максимальне значення ваших хітів збільшується на 1, і ви отримуєте 1 додатковий хіт з кожним новим рівнем.",
					],

				languages: [languages[0], languages[4]],
				speciallyRace(player) {
					if(!player.weaponPossessionItems.includes(weapon[7].name) && !player.weaponPossessionTypes.includes(weapon[7].category[0]) ) {
						player.armorAndWaponPossession.push("бойові сокири");
						player.weaponPossessionItems.push(weapon[7].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[33].name) && !player.weaponPossessionTypes.includes(weapon[33].category[0]) ) {
						player.armorAndWaponPossession.push("ручні сокири");
						player.weaponPossessionItems.push(weapon[33].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[5].name) && !player.weaponPossessionTypes.includes(weapon[5].category[0]) ) {
						player.armorAndWaponPossession.push("бойові молоти");
						player.weaponPossessionItems.push(weapon[5].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[23].name) && !player.weaponPossessionTypes.includes(weapon[23].category[0]) ) {
						player.armorAndWaponPossession.push("легкі молоти");
						player.weaponPossessionItems.push(weapon[23].name);
					}
					takeRandomObjects(player.toolsPossession, [ artisanTools[8],artisanTools[4],artisanTools[7] ], 1);

					player.maxHits += 1;

				}
			},
		],
	},

	//Дракононароджений
	{
		name: "Дракононароджений",
		subraces: [
			//Дракононароджений
			{
				race: "Дракононароджений",
				increaseCharacteristic: [
					/*Сил:*/2, 
					/*Лов:*/0, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/1
				],
				size: "Середній",
				minSize: 6,
				maxSize: 6,
				minMass: 220,
				maxMass: 320,
				speed: 30,
				age: 80,
				minAge: 15,
				skinColor: ["Біла", "Бронзова", "Зелена", "Золота", "Червона", "Латунна", "Мідна", "Серебриста", "Синя", "Чорна"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Фіолетові","Оранжеві"],
				hair: ["Лисина"],

				//Навики
				features: [ 
				],

				languages: [languages[0], languages[10]],
				
				speciallyRace(player) {
					str = "";
					def = "";
					switch(player.skin) {
						case "Біла": 
						case "Серебриста": 
							str = "Ви наносите урон холодом на дальність 15-фт. Форма заклинання: конус. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на тіло.<br>";
							def = "холодом";
							break;
						case "Бронзова": 
						case "Синя": 
							str = "Ви наносите урон електрикою на дальність 30-фт. Форма заклинання: лінія. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на ловкість.<br>";
							def = "електрикою";
							break;
						case "Зелена": 
							str = "Ви наносите урон ядом на дальність 15-фт. Форма заклинання: конус. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на тіло.<br>";
							def = "ядом";
							break;
						case "Золота": 
						case "Червона": 
							str = "Ви наносите урон вогнем на дальність 15-фт. Форма заклинання: конус. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на ловкість.<br>";
							def = "вогнем";
							break;
						case "Латунна": 
							str = "Ви наносите урон вогнем на дальність 30-фт. Форма заклинання: лінія. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на ловкість.<br>";
							def = "вогнем";
							break;
						case "Мідна": 
						case "Чорна": 
							str = "Ви наносите урон кислотою на дальність 30-фт. Форма заклинання: лінія. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на ловкість.<br>";
							def = "кислотою";
							break;
						default:
							str = "Ви наносите урон вогнем на дальність 15-фт. Форма заклинання: конус. При атаці кожен ворог, що потрапив під залинання "+ 
							"робить спаскидок на ловкість.<br>";
							def = "вогнем";
							break;
					}

					player.featuresList = player.featuresList.concat([
						/*Назва:*/"Зброя дихання",
						/*Опис:*/"Ви можете дією видихнути руйнівну енергію. " + str +
						"Складність цього спаскидка дорівнює 8 + ваш модифікатор Тіла + ваш бонус майстерності. Істоти отримують 2к6 шкоди в разі проваленого спаскидка, або половину цієї шкоди, якщо спаскидок був успішний.<br>" +
						"Після використання зброї дихання ви не можете використовувати її повторно, поки не буде завершений короткий або тривалий відпочинок.",
						/*Назва:*/"Опір урону",
						/*Опис:*/"Ви отримуєте опір до урону " + def + ".",
					]);

				}
			},
		],
	},


	//ПОЛУОРК
	{
		name: "Полуорк",
		subraces: [
			//ПОЛУОРК
			{
				race: "Полуорк",
				increaseCharacteristic: [
					/*Сил:*/2, 
					/*Лов:*/0, 
					/*Тіл:*/1, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 155,
				maxMass: 255,
				speed: 30,
				age: 75,
				minAge: 14,
				skinColor: ["Зелена", "Сіро-зелена", "Сіра", "Світло-сіра", "Сіро-фіолетова", "Темно-зелена"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Завдяки крові орків, ви володієте чудовим зором в темряві і при поганому освітленні. На відстані в 60 футів ви при поганому освітленні можете бачити так, як ніби це яскраве освітлення,"+
					" і в темряві так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Непохитна стійкість",
					/*Опис:*/"Якщо ваші хіти опустилися до нуля, але ви при цьому не вбиті, ваші хіти замість цього опускаються до 1. Ви не можете використовувати цю здатність знову, поки не буде завершений тривалий відпочинок.",
					/*Назва:*/"Люті атаки",
					/*Опис:*/"Якщо ви зробили критичне попадання рукопашною атакою зброєю, ви можете додати до урону ще одну кістку урону зброї.",

				],

				languages: [languages[0], languages[5]],
				speciallyRace(player) {
					tryAddNewSkill(player, 6);
				}
			},
		],
	},

	//ПОЛУРОСЛИК
	{
		name: "Полурослик",
		subraces: [
			//ПОЛУРОСЛИК
			{
				race: "Полурослик",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Маленький",
				minSize: 3,
				maxSize: 4,
				minMass: 40,
				maxMass: 45,
				speed: 25,
				age: 150,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Везучий",
					/*Опис:*/"Якщо при кидку атаки, перевірці характеристики або спаскидку у вас випало «1», ви можете перекинути кубик, і повинні використовувати новий результат.",
					/*Назва:*/"Хоробрий",
					/*Опис:*/"Ви робите з перевагою спаскидки від переляку.",
					/*Назва:*/"Моторність полурослика",
					/*Опис:*/"Ви можете проходити крізь простір, зайнятий істотами, чий розмір більше вашого.",

				],

				languages: [languages[0], languages[6]],
				speciallyRace(player) {

				}
			},

			//ПОЛУРОСЛИК кремезний
			{
				race: "Полурослик (кремезний)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/1, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Маленький",
				minSize: 3,
				maxSize: 4,
				minMass: 40,
				maxMass: 45,
				speed: 25,
				age: 150,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Везучий",
					/*Опис:*/"Якщо при кидку атаки, перевірці характеристики або спаскидку у вас випало «1», ви можете перекинути кубик, і повинні використовувати новий результат.",
					/*Назва:*/"Хоробрий",
					/*Опис:*/"Ви робите з перевагою спаскидки від переляку.",
					/*Назва:*/"Моторність полурослика",
					/*Опис:*/"Ви можете проходити крізь простір, зайнятий істотами, чий розмір більше вашого.",
					/*Назва:*/"Стійкість кремезних",
					/*Опис:*/"Ви робите з перевагою спаскидки від отрути, і ви отримуєте опір до урону отрутою.",

				],

				languages: [languages[0], languages[6]],
				speciallyRace(player) {

				}
			},

			//ПОЛУРОСЛИК легконогий
			{
				race: "Полурослик (легконогий)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/1
				],
				size: "Маленький",
				minSize: 3,
				maxSize: 4,
				minMass: 40,
				maxMass: 45,
				speed: 25,
				age: 150,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Везучий",
					/*Опис:*/"Якщо при кидку атаки, перевірці характеристики або спаскидку у вас випало «1», ви можете перекинути кубик, і повинні використовувати новий результат.",
					/*Назва:*/"Хоробрий",
					/*Опис:*/"Ви робите з перевагою спаскидки від переляку.",
					/*Назва:*/"Моторність полурослика",
					/*Опис:*/"Ви можете проходити крізь простір, зайнятий істотами, чий розмір більше вашого.",
					/*Назва:*/"Природна скритність",
					/*Опис:*/"Ви можете вдатися до спроб сховатися навіть якщо сховані за істотою, що білаша за вас в розмірі як мінімум на одну категорію.",
				],

				languages: [languages[0], languages[6]],
				speciallyRace(player) {

				}
			},
		],
	},

	
	//ПОЛУЕЛЬФ
	{
		name: "Полуельф",
		subraces: [
			//ПОЛУЕЛЬФ
			{
				race: "Полуельф",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/0, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/2
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 130,
				maxMass: 190,
				speed: 30,
				age: 180,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева", "Сіра", "Серебриста"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Завдяки вашій ельфійської крові, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Спадщина фей",
					/*Опис:*/"Ви робите з перевагою спаскидки від очарування, і вас неможливо магічно приспати.",
				],

				languages: [languages[0], languages[7]],
				speciallyRace(player) {
					//+ бонус двом характеристикам
					for(let i = 0; i < 2 ; i++)  {
						rnd = randomInteger(0,5);

		    			if(player.stats[i] > 20) player.stats[i] = 20;

		   				if(player.stats[rnd] < 20) {
		   					player.stats[rnd] += 1;
		   				} else {
		   					i--;
		   					continue;
		   				} 
		 			}

					for(let i = 0; i < 6; i++) {
		    			player.modifierStats[i] = -5+(Math.trunc((player.stats[i]) / 2));
		  			}
				
					//два додаткових навика
					for(let i = 0; i < 2 && player.skills.reduce((acc, num) => acc + num, 0) < 17; i++) {
						let rnd = randomInteger(0, 17);
					    
					    if(player.skills[rnd] == 1) {
					      i--;
					      continue;
					    }
					    player.skills[rnd] = 1;
					}

					//мова на вибір
					takeLanguage(player, languages, 1);
				}
			},
		],
	},

	//Людина
	{
		name: "Людина",
		subraces: [
			//Людина
			{
				race: "Людина",
				increaseCharacteristic: [
					/*Сил:*/1, 
					/*Лов:*/1, 
					/*Тіл:*/1, 
					/*Інт:*/1, 
					/*Мудр:*/1, 
					/*Хар:*/1
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 140,
				maxMass: 220,
				speed: 30,
				age: 100,
				minAge: 20,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева", "Червона", "Фіолетова", "Світло-червона", "Темно-червона", "Світло-фіолетова", "Темно-фіолетова"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові", "Золотисті", "Білі", "Жовті", "Серебристі"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ ],

				languages: [languages[0]],
				speciallyRace(player) {
					takeLanguage(player, languages, 1);
				}
			},
		],
	},

	//Тіфлінг
	{
		name: "Тіфлінг",
		subraces: [
			//Тіфлінг
			{
				race: "Тіфлінг",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/0, 
					/*Тіл:*/0, 
					/*Інт:*/1, 
					/*Мудр:*/0, 
					/*Хар:*/2
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 140,
				maxMass: 220,
				speed: 30,
				age: 130,
				minAge: 18,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева", "Червона", "Фіолетова", "Світло-червона", "Темно-червона", "Світло-фіолетова", "Темно-фіолетова"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові", "Золотисті", "Білі", "Жовті", "Серебристі"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Завдяки вашій диявольській спадщині, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Пекельний опір",
					/*Опис:*/"Ви отримуєте опір до урону вогнем.",
				],

				languages: [languages[0], languages[11]],
				speciallyRace(player) {

				}
			},
		],
	},

	//Ельф
	{
		name: "Ельф",
		subraces: [
			//Ельф
			{
				race: "Ельф",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 130,
				maxMass: 170,
				speed: 30,
				age: 750,
				minAge: 100,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до сутінок лісу і нічного неба, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Спадщина фей",
					/*Опис:*/"Ви робите з перевагою спаскидки від очарування, і вас неможливо магічно приспати.",
					/*Назва:*/"Транс",
					/*Опис:*/"Ельфи не сплять. Замість цього вони занурюються в глибоку медитацію, перебуваючи в напівнепритомному стані до 4 годин на добу (зазвичай таку медитацію називають трансом). Під час цієї медитації ви можете мріяти про різні речі. Деякі з цих мрій є ментальними вправами, виробленими за роки тренувань. Після такого відпочинку ви отримуєте всі переваги, які отримує людина після 8 годин сну.",
				],

				languages: [languages[0], languages[7]],
				speciallyRace(player) {
					tryAddNewSkill(player, 3);
					player.passWinsdom = 10 + player.modifierStats[4] + (player.skills[3]==1?2:0);
				}
			},

			//Ельф (вищий)
			{
				race: "Ельф (вищий)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/0, 
					/*Інт:*/1, 
					/*Мудр:*/0, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 130,
				maxMass: 170,
				speed: 30,
				age: 750,
				minAge: 100,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до сутінок лісу і нічного неба, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Спадщина фей",
					/*Опис:*/"Ви робите з перевагою спаскидки від очарування, і вас неможливо магічно приспати.",
					/*Назва:*/"Транс",
					/*Опис:*/"Ельфи не сплять. Замість цього вони занурюються в глибоку медитацію, перебуваючи в напівнепритомному стані до 4 годин на добу (зазвичай таку медитацію називають трансом). Під час цієї медитації ви можете мріяти про різні речі. Деякі з цих мрій є ментальними вправами, виробленими за роки тренувань. Після такого відпочинку ви отримуєте всі переваги, які отримує людина після 8 годин сну.",
					/*Назва:*/"Заговор",
					/*Опис:*/"Ви знаєте один заговор зі списку заклинань чарівника. Базовою характеристикою для його використання є Інтелект.",
				],

				languages: [languages[0], languages[7]],
				speciallyRace(player) {
					tryAddNewSkill(player, 3);
					player.passWinsdom = 10 + player.modifierStats[4] + (player.skills[3]==1?2:0);

					//заговор
 				  	let complots = shuffle([3, 6, 15, 20, 21, 22, 23, 28, 8]);
				  	for(let i = 0, n = 1; i < complots.length && n > 0; i++) {
				     	if(contains(player.complot, complots[i]) ) continue;
				     	player.complot.push(complots[i]);
				    	 n--;
		 			}

					//мова
					takeLanguage(player, languages, 1);
					
					//зброя
					if(!player.weaponPossessionItems.includes(weapon[22].name) && !player.weaponPossessionTypes.includes(weapon[22].category[0]) ) {
						player.armorAndWaponPossession.push("короткі мечі");
						player.weaponPossessionItems.push(weapon[22].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[14].name) && !player.weaponPossessionTypes.includes(weapon[14].category[0]) ) {
						player.armorAndWaponPossession.push("довгі мечі");
						player.weaponPossessionItems.push(weapon[14].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[13].name) && !player.weaponPossessionTypes.includes(weapon[13].category[0]) ) {
						player.armorAndWaponPossession.push("довгі луки");
						player.weaponPossessionItems.push(weapon[13].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[21].name) && !player.weaponPossessionTypes.includes(weapon[21].category[0]) ) {
						player.armorAndWaponPossession.push("короткі луки");
						player.weaponPossessionItems.push(weapon[21].name);
					}

				}
			},

			//Ельф (дроу)
			{
				race: "Ельф (дроу)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/0, 
					/*Хар:*/1
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 130,
				maxMass: 170,
				speed: 30,
				age: 750,
				minAge: 100,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева", "Сіра", "Темно-сіра", "Серебриста" ],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до сутінок лісу і нічного неба, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 120 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Спадщина фей",
					/*Опис:*/"Ви робите з перевагою спаскидки від очарування, і вас неможливо магічно приспати.",
					/*Назва:*/"Транс",
					/*Опис:*/"Ельфи не сплять. Замість цього вони занурюються в глибоку медитацію, перебуваючи в напівнепритомному стані до 4 годин на добу (зазвичай таку медитацію називають трансом). Під час цієї медитації ви можете мріяти про різні речі. Деякі з цих мрій є ментальними вправами, виробленими за роки тренувань. Після такого відпочинку ви отримуєте всі переваги, які отримує людина після 8 годин сну.",
					/*Назва:*/"Чутливість до сонця",
					/*Опис:*/"Ви робите з перешкодою кидки атаки і перевірки Мудрості (Уважність), засновані на зорі, якщо ви, мета вашої атаки або досліджуваний предмет розташовані на прямому сонячному світлі.",
					/*Назва:*/"Магія дроу",
					/*Опис:*/"Ви знаєте заклинання танцюючі вогники.<br>" +
					"Коли ви досягаєте 3 рівня, ви можете один раз в день використовувати заклинання вогонь фей.<br>" +
					"При досягненні 5 рівня ви також зможете раз в день використовувати заклинання тьма.<br>" +
					"«Раз в день» означає, що ви повинні закінчити тривалий відпочинок, перш ніж зможете накласти це заклинання ще раз за допомогою даного вміння.<br>" +
					"Базовою характеристикою для їх використання є Харизма.",
					/*Назва:*/"Чутливість до сонця",
					/*Опис:*/"Ви робите з перешкодою кидки атаки і перевірки Мудрості (Уважність), засновані на зорі, якщо ви, мета вашої атаки або досліджуваний предмет розташовані на прямому сонячному світлі.",


				],

				languages: [languages[0], languages[7]],
				speciallyRace(player) {
					tryAddNewSkill(player, 3);
					player.passWinsdom = 10 + player.modifierStats[4] + (player.skills[3]==1?2:0);

					if(!player.complot.includes(14)) player.complot.push(14);

					if(!player.weaponPossessionItems.includes(weapon[22].name) && !player.weaponPossessionTypes.includes(weapon[22].category[0]) ) {
						player.armorAndWaponPossession.push("короткі мечі");
						player.weaponPossessionItems.push(weapon[22].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[2].name) && !player.weaponPossessionTypes.includes(weapon[2].category[0]) ) {
						player.armorAndWaponPossession.push("ручні арбалети");
						player.weaponPossessionItems.push(weapon[2].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[32].name) && !player.weaponPossessionTypes.includes(weapon[32].category[0]) ) {
						player.armorAndWaponPossession.push("рапіри");
						player.weaponPossessionItems.push(weapon[32].name);
					}
				}
			},

			//Ельф (лісний)
			{
				race: "Ельф (лісний)",
				increaseCharacteristic: [
					/*Сил:*/0, 
					/*Лов:*/2, 
					/*Тіл:*/0, 
					/*Інт:*/0, 
					/*Мудр:*/1, 
					/*Хар:*/0
				],
				size: "Середній",
				minSize: 5,
				maxSize: 6,
				minMass: 130,
				maxMass: 170,
				speed: 35,
				age: 750,
				minAge: 100,
				skinColor: ["Біла", "Бежева", "Смугла", "Коричнева"],
				eye:[ "Карі", "Блактині", "Сірі", "Зелені", "Темно-сірі", "Сині", "Чорні", "Червоні", "Оранжеві", "Фіолетові"],
				hair: ["Білі", "Сиві", "Чорні", "Червоні", "Помаранчеві", "Фіолетові", "Рожеві", "Сині", "Блакитні", "Зелені", "Пурпупні", "Золотисті",
				 "Темно-червоні", "Темно-сині", "Темно-сірі", "Темно-оранжеві", "Темно-фіолетові", "Темно-зелені", 
				 "Світло-червоні", "Лисина", "Світло-сині", "Світло-сірі", "Світло-оранжеві", "Світло-фіолетові", "Світло-зелені"],

				//Навики
				features: [ 
					/*Назва:*/"Темне бачення",
					/*Опис:*/"Звикнувши до сутінок лісу і нічного неба, ви володієте чудовим зором в темряві і при поганому освітленні. " + 
					"При поганому освітленні, на відстані в 60 футів, ви можете бачити так, як ніби це яскраве освітлення, а в темряві " + 
					"так, як ніби це погане освітлення. У темряві ви не можете розрізняти кольори, тільки відтінки сірого.",
					/*Назва:*/"Спадщина фей",
					/*Опис:*/"Ви робите з перевагою спаскидки від очарування, і вас неможливо магічно приспати.",
					/*Назва:*/"Транс",
					/*Опис:*/"Ельфи не сплять. Замість цього вони занурюються в глибоку медитацію, перебуваючи в напівнепритомному стані до 4 годин на добу (зазвичай таку медитацію називають трансом). Під час цієї медитації ви можете мріяти про різні речі. Деякі з цих мрій є ментальними вправами, виробленими за роки тренувань. Після такого відпочинку ви отримуєте всі переваги, які отримує людина після 8 годин сну.",
					/*Назва:*/"Маскування в дикій місцевості",
					/*Опис:*/"Ви можете вдатися до спроб сховатися, навіть якщо ви трохи закриті листям, сильним дощем, снігопадом, туманом або іншими природними явищами.",

				],

				languages: [languages[0], languages[7]],
				speciallyRace(player) {
					tryAddNewSkill(player, 3);
					player.passWinsdom = 10 + player.modifierStats[4] + (player.skills[3]==1?2:0);

					if(!player.weaponPossessionItems.includes(weapon[22].name) && !player.weaponPossessionTypes.includes(weapon[22].category[0]) ) {
						player.armorAndWaponPossession.push("короткі мечі");
						player.weaponPossessionItems.push(weapon[22].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[14].name) && !player.weaponPossessionTypes.includes(weapon[14].category[0]) ) {
						player.armorAndWaponPossession.push("довгі мечі");
						player.weaponPossessionItems.push(weapon[14].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[13].name) && !player.weaponPossessionTypes.includes(weapon[13].category[0]) ) {
						player.armorAndWaponPossession.push("довгі луки");
						player.weaponPossessionItems.push(weapon[13].name);
					}
					if(!player.weaponPossessionItems.includes(weapon[21].name) && !player.weaponPossessionTypes.includes(weapon[21].category[0]) ) {
						player.armorAndWaponPossession.push("короткі луки");
						player.weaponPossessionItems.push(weapon[21].name);
					}

				}
			},
		],
	},



];

