'use strict'

var complot = [
	//КНИГА ГРАВЦЯ
	{
		id: 0,
		name:"Бризки кислоти",
		components: [1,1,0],
		items: "",
	},

	{
		id: 1,
		name:"Чарівна Рука",
		components: [1,1,0],
		items: "",
	},

	{
		id: 2,
		name:"Дружба",
		components: [0,1,1],
		items: "(невелика кількість гриму, що наноситься на обличчя при накладанні цього заклинання)",
	},

	{
		id: 3,
		name:"Дубинка",
		components: [1,1,1],
		items: "(омела, лист конюшини і кийок або бойову палицю)",
	},

	{
		id: 4,
		name:"Захист від Зброї",
		components: [1,1,0],
		items: "",
	},

	{
		id: 5,
		name:"Зла насмішка",
		components: [1,0,0],
		items: "",
	},

	{
		id: 6,
		name:"Мистецтво друїдів",
		components: [1,1,0],
		items: "",
	},

	{
		id: 7,
		name:"Крижаний дотик",
		components: [1,1,0],
		items: "",
	},

	{
		id: 8,
		name:"Луч холода",
		components: [1,1,0],
		items: "",
	},

	{
		id: 9,
		name:"Мала ілюзія",
		components: [0,1,1],
		items: "(шматок овечої вовни)",
	},

	{
		id: 10,
		name:"Влучний удар",
		components: [0,1,0],
		items: "",
	},

	{
		id: 11,
		name:"Містичний заряд",
		components: [1,1,0],
		items: "",
	},

	{
		id: 12,
		name:"Навала",
		components: [1,1,1],
		items: "(Жива блоха)",
	},

	{
		id: 13,
		name:"Вогняний снаряд",
		components: [1,1,0],
		items: "",
	},

	{
		id: 14,
		name:"Танцюючі вогники",
		components: [1,1,1],
		items: "(шматочок фосфору, гнилиця або світлячок)",
	},

	{
		id: 15,
		name:"Починка",
		components: [1,1,1],
		items: "(два магнетита)",
	},

	{
		id: 16,
		name:"Світло",
		components: [1,0,1],
		items: "(світлячок або фосфоресцірующий мох)",
	},

	{
		id: 17,
		name:"Святе полум'я",
		components: [1,1,0],
		items: "",
	},

	{
		id: 18,
		name:"Слово сяйва",
		components: [1,1,1],
		items: "(священний символ)",
	},

	{
		id: 19,
		name:"Повідомлення",
		components: [1,1,1],
		items: "(шматочок мідного дроту)",
	},

	{
		id: 20,
		name:"Опір",
		components: [1,1,1],
		items: "(крихітний плащ)",
	},

	{
		id: 21,
		name:"Створеня полум'я",
		components: [1,1,0],
		items: "",
	},

	{
		id: 22,
		name:"Терновий кнут",
		components: [1,1,1],
		items: "(стебло рослини з шипами)",
	},

	{
		id: 23,
		name:"Вказівка",
		components: [1,1,0],
		items: "",
	},

	{
		id: 24,
		name:"Догляд за вмираючим",
		components: [1,1,0],
		items: "",
	},

	{
		id: 25,
		name:"Фокуси",
		components: [1,1,0],
		items: "",
	},

	{
		id: 26,
		name:"Чудотворство",
		components: [1,0,0],
		items: "",
	},

	{
		id: 27,
		name:"Електрошок",
		components: [1,1,0],
		items: "",
	},

	{
		id: 28,
		name:"Отруйні бризки",
		components: [1,1,0],
		items: "",
	},

];

var spells = [
	{
		id: 0,
		name:"Пекельна відплата",
		components: [1,1,0],
		items: "",
	},

	{
		id: 1,
		name:"Безмовний образ",
		components: [1,1,1],
		items: "(шматок овечої вовни)",
	},

	{
		id: 2,
		name:"Благословення",
		components: [1,1,1],
		items: "(крапля святої води)",
	},

	{
		id: 3,
		name:"Божественне благовоління",
		components: [1,1,0],
		items: "",
	},

	{
		id: 4,
		name:"Відьмений снаряд",
		components: [1,1,1],
		items: "(гілочка дерева, в яке вдарила блискавка)",
	},

	{
		id: 5,
		name:"Хвиля грому",
		components: [1,1,0],
		items: "",
	},

	{
		id: 6,
		name:"Чарівна стріла",
		components: [1,1,0],
		items: "",
	},

	{
		id: 7,
		name:"Виклик на дуель",
		components: [1,0,0],
		items: "",
	},

	{
		id: 8,
		name:"Героїзм",
		components: [1,1,0],
		items: "",
	},

	{
		id: 9,
		name:"Гнівна кара",
		components: [1,1,0],
		items: "",
	},


	{
		id: 10,
		name:"Град шипів",
		components: [1,0,0],
		items: "",
	},

	{
		id: 11,
		name:"Громова кара",
		components: [1,0,0],
		items: "",
	},

	{
		id: 12,
		name:"Дисонуючий шепіт",
		components: [1,0,0],
		items: "",
	},

	{
		id: 13,
		name:"Обладунок Агатіса",
		components: [1,1,1],
		items: "(чашка води)",
	},

	{
		id: 14,
		name:"Обладунки мага",
		components: [1,1,1],
		items: "(шматочок вичиненої шкіри)",
	},


	{
		id: 15,
		name:"Дружба з Тваринами",
		components: [1,1,1],
		items: "(шматочок їжі)",
	},

	{
		id: 16,
		name:"Моторошний сміх Таші",
		components: [1,1,1],
		items: "(маленькі тістечка і перо, яким потрібно махати в повітрі)",
	},

	{
		id: 17,
		name:"Захист від Добра і Зла",
		components: [1,1,1],
		items: "(свята вода або порошок срібла і заліза, що витрачаються заклинанням)",
	},

	{
		id: 18,
		name:"Лікуюче слово",
		components: [1,0,0],
		items: "",
	},

	{
		id: 19,
		name:"Лікування ран",
		components: [1,1,0],
		items: "",
	},


	{
		id: 20,
		name:"Промінь хвороби",
		components: [1,1,0],
		items: "",
	},

	{
		id: 21,
		name:"Маскування",
		components: [1,1,0],
		items: "",
	},

	{
		id: 22,
		name:"Мітка мисливця",
		components: [1,0,0],
		items: "",
	},

	{
		id: 23,
		name:"Нанесення ран",
		components: [1,1,0],
		items: "",
	},

	{
		id: 24,
		name:"Спрямований снаряд",
		components: [1,1,0],
		items: "",
	},


	{
		id: 25,
		name:"Невидимий лист",
		components: [1,0,1],
		items: "(свинцеві чорнила, які коштують як мінімум 10 зм, що витрачаються заклинанням)",
	},

	{
		id: 26,
		name:"Невидимий слуга",
		components: [1,1,1],
		items: "(частина тятиви і шматочок дерева)",
	},

	{
		id: 27,
		name:"Виявлення хвороб і отрути",
		components: [1,1,1],
		items: "(лист тиса)",
	},

	{
		id: 28,
		name:"Виявлення Добра і Зла",
		components: [1,1,0],
		items: "",
	},

	{
		id: 29,
		name:"Виявлення магії",
		components: [1,1,0],
		items: "",
	},

	{
		id: 30,
		name:"Вогненні долоні",
		components: [1,1,0],
		items: "",
	},

	{
		id: 31,
		name:"Вогонь фей",
		components: [1,0,0],
		items: "",
	},

	{
		id: 32,
		name:"Впізнання",
		components: [1,1,1],
		items: "(Перлина, що коштує як мінімум 100 зм, і перо сови)",
	},

	{
		id: 33,
		name:"Обплутування",
		components: [1,1,0],
		items: "",
	},

	{
		id: 34,
		name:"Обплутуючий удар",
		components: [1,0,0],
		items: "",
	},

	{
		id: 35,
		name:"Очарувнання особистості",
		components: [1,1,0],
		items: "",
	},

	{
		id: 36,
		name:"Очищення їжі й води",
		components: [1,1,0],
		items: "",
	},

	{
		id: 37,
		name:"Падіння пір'їнки",
		components: [1,0,1],
		items: "(невелике перо або шматочок пуху)",
	},

	{
		id: 38,
		name:"Пекельна кара",
		components: [1,0,0],
		items: "",
	},

	{
		id: 39,
		name:"Пошук Фамільяра",
		components: [1,1,1],
		items: "(варті 10 зм вугілля, пахощі і трави, спалюються в вогні або в латунній жаровні)",
	},

	{
		id: 40,
		name:"Розуміння мов",
		components: [1,1,1],
		items: "(щіпка сажі і солі)",
	},

	{
		id: 41,
		name:"Порча",
		components: [1,1,1],
		items: "(крапля крові)",
	},

	{
		id: 42,
		name:"Поспішний відступ",
		components: [1,1,0],
		items: "",
	},

	{
		id: 43,
		name:"Наказ",
		components: [1,0,0],
		items: "",
	},

	{
		id: 44,
		name:"Стрибок",
		components: [1,1,1],
		items: "(задня лапка коника)",
	},

	{
		id: 45,
		name:"Псевдожиття",
		components: [1,1,1],
		items: "(невелика кількість алкоголю або дистильованого спирту)",
	},

	{
		id: 46,
		name:"Розмова з Тваринами",
		components: [1,1,0],
		items: "",
	},

	{
		id: 47,
		name:"Руки Хадара",
		components: [1,1,0],
		items: "",
	},

	{
		id: 48,
		name:"Блискучі Бризки",
		components: [1,1,1],
		items: "(щіпка порошку або піску, пофарбованого в червоний, жовтий і синій колір)",
	},

	{
		id: 49,
		name:"Пристріт (Сглаз)",
		components: [1,1,1],
		items: "(окам'яніле око тритона)",
	},

	{
		id: 50,
		name:"Сигнал тривоги",
		components: [1,1,1],
		items: "(дзвіночок і срібний провід)",
	},

	{
		id: 51,
		name:"Ковзання",
		components: [1,1,1],
		items: "(шматок масла або свинячого сала)",
	},

	{
		id: 52,
		name:"Скорохід",
		components: [1,1,1],
		items: "(щіпка землі)",
	},

	{
		id: 53,
		name:"Створено або Знищення Води",
		components: [1,1,1],
		items: "(крапля води, якщо вода створюється, або кілька піщинок, якщо вода знищується)",
	},

	{
		id: 54,
		name:"Тензеров літаючий диск",
		components: [1,1,1],
		items: "(крапля ртуті)",
	},

	{
		id: 55,
		name:"Туманна хмара",
		components: [1,1,0],
		items: "",
	},

	{
		id: 56,
		name:"Притулок",
		components: [1,1,1],
		items: "(маленьке срібне дзеркало)",
	},

	{
		id: 57,
		name:"Усипляння (сон)",
		components: [1,1,1],
		items: "(щіпка дрібного піску, пелюстки троянди або цвіркун)",
	},

	{
		id: 58,
		name:"Кольоровий шарик",
		components: [1,1,1],
		items: "(алмаз, що коштує як мінімум 50 зм)",
	},

	{
		id: 59,
		name:"Чудо-ягоди",
		components: [1,1,1],
		items: "(гілка омели)",
	},

	{
		id: 60,
		name:"Щит",
		components: [1,1,0],
		items: "",
	},

	{
		id: 61,
		name:"Щит Віри",
		components: [1,1,1],
		items: "(невеликий пергамент зі святими письменами)",
	},
];


